[
    {
        "title": "Ingénieur Process Battery",
        "description_html": null,
        "description_text": "General information\nJob Title\nIngénieur Process Battery\nRef #\n20001497\nEmployment Type\nPermanent\nDepartment\nEngineering\nPosition level\nEngineer\nDate\nWednesday, January 28, 2026\nAESC Office Location\nDouai, Hauts-de-France, France\nDescription & Requirements\nJob Description\nL'ingénieur process Senior est en charge de mettre en œuvre et d'optimiser l'implantation des équipements, des processus majeurs en zones dédiées. Il agit selon les orientations et l'adaptation des moyens alloués avec validation par les résultats.\nRequirements / Required skills\nManufacturing Engineering\nMechanical Engineering\nQualifications\nAnalyser et formaliser les besoins techniques et opérationnels de l’entreprise en matière d’équipements industriels, en intégrant les contraintes de production, de qualité, de sécurité et de performance.\nConcevoir et planifier l’implantation des équipements industriels en optimisant l’ergonomie, les flux, la capacité et l’intégration dans l’environnement industriel existant.\nPiloter les échanges techniques avec les fournisseurs et partenaires industriels afin de garantir la conformité des équipements aux exigences normatives (qualité, sécurité, réglementaire), aux performances attendues et aux délais contractuels.\nAssurer le pilotage global des projets d’implantation d’équipements industriels, dans le respect des budgets, des plannings et des objectifs définis, en coordonnant les équipes internes et les intervenants externes.\nSuperviser les phases d’installation, de mise en service et de qualification des équipements, en veillant à la conformité aux spécifications techniques et aux standards HSE.\nOrganiser et dispenser la formation des opérateurs et des équipes de maintenance afin de garantir une prise en main optimale, sécurisée et durable des nouveaux équipements.\nTravailler en étroite collaboration avec les équipes opérationnelles pour identifier, analyser et déployer des actions d’amélioration continue visant à optimiser la performance des équipements, la productivité et l’efficacité globale des processus industriels.\nExigences du poste:\n- Niveau ingénieur à dominante industrielle avec  expériences dans l'installation d'équipements complexes\n- Anglais professionnel obligatoire\nLe poste est en forfait jour, avec des astreintes certain weekend et certain samedi travaillés ( 1/3 mois environ)\nPostulez, notre équipe prendra le soin de vous recontacter pour vous présenter le poste et répondre à vos questions.\n#LI-EO1\nGo back\nApply\nShare this job\nEmail\nFacebook\nX\nWeChat\nWhatsApp\nLinkedIn",
        "application_url": "https://jobs.aesc-group.com/en_US/careers/Login?jobId=990&recommendation=&source=&tags=&user=&formValues=",
        "": {},
        "metadata": {
            "Job Title": "Ingénieur Process Battery",
            "Ref #": "20001497",
            "Employment Type": "Permanent",
            "Department": "Engineering",
            "Position level": "Engineer",
            "Date": "Wednesday, January 28, 2026",
            "AESC Office Location": "Douai, Hauts-de-France, France"
        },
        "link": "https://jobs.aesc-group.com/en_US/careers/JobDetail/LAMBRES-LEZ-DOUAI-France-Ing-nieur-Process-Battery/990"
    },
    {
        "title": "Regional Finance Analyst",
        "description_html": null,
        "description_text": "General information\nJob Title\nRegional Finance Analyst\nRef #\n20001496\nEmployment Type\nPermanent\nDepartment\nFinance\nPosition level\nAnalyst\nDate\nTuesday, January 20, 2026\nAESC Office Location\nSmyrna, Tennessee USA\nDescription & Requirements\nJob Description\nAESC US, LLC\nRegional Finance Analyst (Job Code: 20001496)\nResponsible for coordinating corporate financial operations and analysis within the manufacturing department; play a critical role in driving financial performance, cost efficiency, and operational excellence within the manufacturing processes by utilizing a deep understanding of both financial principles and manufacturing operations, as well as strong analytical and leadership skills; provide monthly financial support to the management team, ensuring successful understanding and execution of financial objectives; execute informed business decisions by analyzing financial information to forecast business, industry, and economic conditions; conduct regular financial analysis to monitor manufacturing costs, expenses, and variances against budgets and forecasts; identify opportunities for cost optimization, process improvements, and efficiency enhancement; prepare financial reports, performance metrics, and presentations for management and stakeholders; collaborate with corporate finance and accounting teams to ensure accurate and timely financial reporting for manufacturing activities; employ financial models to develop optimal solutions to financial problems, and assess the financial and capital impact of transactions; collaborate with manufacturing teams to develop annual budgets and periodic forecasts; track and analyze actual performance against budgeted targets, providing insights and recommendations for corrective actions; provide variance analysis and recommendations to management; present oral and written reports on economic trends, corporations, and industries; analyze financial and operational performance to identify and recommend remedies and cost saving opportunities; monitor fundamental economic, industrial, and corporate developments by analyzing information from financial publications and services, investment banking firms, government agencies, trade publications, and company sources; utilize and apply knowledge of project management processes, ERP, SAP systems, financial planning/analysis techniques, manufacturing environment business planning procedures, dynamic financial model development, financial audits, financial system evaluations, financial performance reviews, financial forecasts, Anaplan financial applications, system implementations, IFRS and GAAP, process improvements, Cycle Review reporting, Power BI and Microsoft Query to perform duties; coordinate cost accounting processes, ensuring accurate allocation of costs to products and production lines and standardize costing globally; develop and implement cost accounting policies and procedures to maintain consistency and compliance with accounting standards; monitor inventory levels and implement strategies to optimize inventory turnover and minimize carrying costs; develop and report on a weekly, monthly, and quarterly basis projections and actuals on production, plant performance, inventory, spending on direct labor, direct burden, fixed burden and associated variances; and conduct financial analyses related to investments in green construction or green retrofitting projects.\nLocation: Smyrna, Tennessee, and multiple undetermined worksites throughout the US;\nSalary: $175,000 per year\nEducation: Bachelors – Finance, Accounting, Business Administration, or in a related field of study (will accept equivalent foreign degree);\nTraining: None;\nExperience: Seven (7) years in the position above, as a Corporate Finance Manager, as a Corporate Financial Planning and Analysis Team Leader, as a Senior Finance Analyst, as a Senior Associate, as an Analyst, as an Associate, or in a related occupation;\nOther Requirements: Experience must include all the following:\n•\nOne (1) year experience with Power BI, Microsoft Query, SAP systems, and financial audits.\n•\nFour (4) years experience with project management processes, ERP, financial planning/analysis techniques, manufacturing environment business planning procedures, dynamic financial model development, financial system evaluations, financial performance reviews, financial forecasts, Anaplan financial applications, system implementations, IFRS and GAAP, process improvements, and Cycle Review reporting.\nWill also accept any suitable combination of education, training and/or experience.\nAESC US, LLC\n2350 Mission College Blvd, Suite 1400\nSanta Clara, California 95054\n(Reference Code: 20001496)\nApply for position on AESC website at\nhttps://us.aesc-group.com/\nby searching above Reference code and applying.\n#LI-DNI\nQualifications\nEducation: Bachelors – Finance, Accounting, Business Administration, or in a related field of study (will accept equivalent foreign degree);\nTraining: None;\nExperience: Seven (7) years in the position above, as a Corporate Finance Manager, as a Corporate Financial Planning and Analysis Team Leader, as a Senior Finance Analyst, as a Senior Associate, as an Analyst, as an Associate, or in a related occupation;\nOther Requirements: Experience must include all the following:\nOne (1) year experience with Power BI, Microsoft Query, SAP systems, and financial audits.\nFour (4) years experience with project management processes, ERP, financial planning/analysis techniques, manufacturing environment business planning procedures, dynamic financial model development, financial system evaluations, financial performance reviews, financial forecasts, Anaplan financial applications, system implementations, IFRS and GAAP, process improvements, and Cycle Review reporting.\nWill also accept any suitable combination of education, training and/or experience.\nAESC US, LLC\n2350 Mission College Blvd, Suite 1400\nSanta Clara, California 95054\n(Reference Code: 20001496)\nApply for position on AESC website at\nhttps://us.aesc-group.com/\nby searching above Reference code and applying.\n#LI-DNI\nGo back\nApply\nShare this job\nEmail\nFacebook\nX\nWeChat\nWhatsApp\nLinkedIn",
        "application_url": "https://jobs.aesc-group.com/en_US/careers/Login?jobId=981&recommendation=&source=&tags=&user=&formValues=",
        "": {},
        "metadata": {
            "Job Title": "Regional Finance Analyst",
            "Ref #": "20001496",
            "Employment Type": "Permanent",
            "Department": "Finance",
            "Position level": "Analyst",
            "Date": "Tuesday, January 20, 2026",
            "AESC Office Location": "Smyrna, Tennessee USA"
        },
        "link": "https://jobs.aesc-group.com/en_US/careers/JobDetail/Smyrna-Tennessee-Tennessee-United-States-Regional-Finance-Analyst/981"
    },
    {
        "title": "HR - Référent Intérim Usine",
        "description_html": null,
        "description_text": "General information\nJob Title\nHR - Référent Intérim Usine\nRef #\n20001495\nEmployment Type\nTemporary\nDepartment\nHuman Resources\nPosition level\nAnalyst\nDate\nTuesday, January 13, 2026\nAESC Office Location\nDouai, Hauts-de-France, France\nDescription & Requirements\nJob Description\nPiloter l’ensemble du processus de gestion du personnel intérimaire au sein d’une gigafactory ou d’une usine de batteries automobiles, en garantissant la conformité réglementaire, la disponibilité des ressources, la sécurité des personnes et la qualité des partenariats avec les agences d’intérim.\n🛠️\nResponsabilités et activités clés\n1. Gestion opérationnelle de l’intérim\nRecueillir les besoins en renforts auprès des différents managers\nAnticiper les variations de charge liées aux ramp-up, aux arrêts techniques ou aux pics de production.\nRédiger les demandes de personnel et coordonner les propositions avec les agences partenaires.\nOrganiser les entretiens ou tests pratiques si requis (manipulation chimique, précision gestuelle, travail en salle sèche…).\nSuivre les affectations, renouvellements, fins de mission et remplacements.\n2. Administration du personnel intérimaire\nVérifier les contrats, habilitations et documents obligatoires (CACES, habilitations électriques, ATEX, EPI spécifiques…).\nGérer les accès aux zones sensibles (salle sèche, zones chimiques, zones automatisées).\nSuivre les heures, absences, accidents, incidents qualité ou sécurité.\nContrôler les factures et résoudre les écarts avec les agences.\n3. Intégration et sécurité\nOrganiser les parcours d’intégration spécifiques au secteur batterie :\nformation sécurité renforcée,\nrisques chimiques (solvants, poudres actives),\nprocédures en salle sèche,\nmanipulation de cellules lithium-ion.\nS’assurer que chaque intérimaire dispose des EPI adaptés (gants spécifiques, lunettes, tenues salle sèche…).\nSuivre l’adaptation au poste et remonter les difficultés aux managers.\n4. Relation avec les agences d’intérim\nÊtre l’interlocuteur privilégié pour les besoins du site.\nSuivre les KPI : taux de couverture, turnover, qualité des profils, taux de présence, conformité sécurité.\nParticiper aux comités de pilotage et proposer des actions d’amélioration.\nGarantir le respect des engagements contractuels et des règles légales.\n5. Reporting et amélioration continue\nProduire les tableaux de bord hebdomadaires et mensuels (effectifs, coûts, heures, taux de renouvellement).\nAnalyser les tendances (absentéisme, accidents, qualité des recrutements).\nParticiper aux projets RH du site : digitalisation, standardisation des processus, amélioration de l’accueil sécurité, optimisation des flux intérim.\n?\nCompétences requises\nCompétences techniques\nConnaissance du droit du travail et du travail temporaire.\nMaîtrise des outils RH et des systèmes de badgeage/planification.\nCompréhension des environnements industriels automatisés et des contraintes spécifiques aux gigafactories (salle sèche, chimie, haute cadence).\nSensibilité forte aux enjeux sécurité et qualité.\nCompétences comportementales\nRigueur, organisation, gestion des priorités.\nAisance relationnelle avec les équipes terrain et les partenaires externes.\nRéactivité, autonomie, sens du service.\nCapacité à travailler dans un environnement en forte croissance et en évolution rapide.\nQualifications\nBac+2/Bac+3 en RH, gestion ou équivalent.\nExpérience en gestion de l’intérim en milieu industriel, idéalement dans l’automobile, la chimie, l’électronique ou une gigafactory.\nConnaissance des enjeux sécurité liés aux batteries lithium-ion appréciée.\nGo back\nApply\nShare this job\nEmail\nFacebook\nX\nWeChat\nWhatsApp\nLinkedIn",
        "application_url": "https://jobs.aesc-group.com/en_US/careers/Login?jobId=979&recommendation=&source=&tags=&user=&formValues=",
        "": {},
        "metadata": {
            "Job Title": "HR - Référent Intérim Usine",
            "Ref #": "20001495",
            "Employment Type": "Temporary",
            "Department": "Human Resources",
            "Position level": "Analyst",
            "Date": "Tuesday, January 13, 2026",
            "AESC Office Location": "Douai, Hauts-de-France, France"
        },
        "link": "https://jobs.aesc-group.com/en_US/careers/JobDetail/LAMBRES-LEZ-DOUAI-France-HR-R-f-rent-Int-rim-Usine/979"
    },
    {
        "title": "Project Management Coordinator",
        "description_html": null,
        "description_text": "General information\nJob Title\nProject Management Coordinator\nRef #\nP1008594\nEmployment Type\nPermanent\nDepartment\nSales\nPosition level\nCoordinator\nDate\nTuesday, January 6, 2026\nAESC Office Location\nRemote worker USA\nDescription & Requirements\nJob Description\nAESC is looking to add a Project Management Coordinator to our team.\nFull-Time\nRemote\nAbout AESC US LLC\nAESC is an exciting, newly created global organization committed to solving the challenges of a sustainable future and becoming the leading supplier of full-value-chain battery solutions. Our lithium-ion batteries can be found in nearly one million electric vehicles worldwide and have a stellar safety record of zero-critical issues. AESC US is leading the way in battery technology. We design and manufacture EV battery technology for various electric vehicles and equipment. We are working hard towards unlocking the full potential of sustainable energy and climate change mitigation. We will continue to build upon our successes and expand into new markets and industries, producing innovative and competitive products and technologies that advance the goal of a zero-carbon emission future. AESC is headquartered in Japan and has battery manufacturing locations in Japan, UK, China, and the U.S.\nAESC Mission\nOur mission is to solve the challenges for a sustainable future. Together, we can make a meaningful impact.\nAbout the Role\nWe are seeking a detail-oriented and highly organized Project Management Coordinator to support the execution of utility-scale energy storage and infrastructure projects. This role will focus on project administration, scheduling, documentation, and internal cross-team coordination to ensure smooth delivery of complex projects. The Project Management Coordinator will work closely with sales managers, engineering teams, and external stakeholders to maintain project momentum from initiation through completion.\nWhat You Will Do\nServe as the central point of contact for project documentation, scheduling, and reporting.\nSupport sales managers and project managers in tracking milestones, deliverables, and dependencies.\nCoordinate internal resources and external partners to ensure timely execution of project tasks.\nMaintain accurate project records, including meeting minutes, action items, and progress reports.\nAssist with preparation of project proposals, RFP/RFQ responses, and client-facing documentation.\nMonitor project timelines and budgets, escalating risks or delays to senior management.\nFacilitate communication between cross-functional teams (engineering, procurement, sales, and services).\nSupport compliance with organizational standards, safety requirements, and quality assurance processes.\nQualifications\nWhat You Need\nBachelor’s degree in Business, Engineering, Project Management, or related field (or equivalent experience).\n2–4 years of project coordination, project support, or operations experience; exposure to utility-scale energy, infrastructure, or construction projects preferred.\nFamiliarity with project management methodologies (Agile, Waterfall, Hybrid).\nStrong organizational skills with the ability to manage multiple projects simultaneously.\nProficiency with project management tools (MS Project, Smartsheet, Asana, Jira) and Microsoft Office.\nExcellent communication skills with the ability to convey technical and commercial information clearly.\nSelf-driven, detail-oriented, and comfortable working in a fast-paced environment.\nWhat is “Nice to Have”?\nKnowledge of energy storage systems, renewable energy, or large-scale infrastructure projects.\nUnderstanding of permitting, interconnection, and regulatory processes.\nExperience supporting EPCs, utilities, IPPs, or project developers.\nFamiliarity with CRM platforms and project tracking systems.\nWhat We Offer\nWelcome to AESC, supporting our state-of-the-art Gigafactories, where you'll have the opportunity to tackle the world's most fascinating challenges alongside exceptionally talented individuals who are driven to make a difference. At AESC, we offer a comprehensive compensation package. In addition, we provide a range of valuable benefits, such as 401K,\nand health insurance. We strive to ensure that our employees are well taken care of, enabling them to focus on their work and contribute to our collective mission of changing the world.\nAn inclusive and diverse work environment that fosters and encourages professional and personal development.\nHighly automated, clean, safe, and temperature-controlled production environment\nMedical, Dental and Vision Insurance\nHSA and Flexible Spending Accounts\n401K with company match\nLife Insurance (Company paid and additional voluntary life available)\nPaid Vacation and 14 Paid Holidays\nShort term and long-term disability coverage (Company Paid)\nTuition reimbursement\nCompetitive base salary with performance-based incentives.\nOpportunity to contribute to large-scale energy transition projects impacting grid reliability and decarbonization.\nHands-on exposure to complex, high-value infrastructure projects.\nComprehensive training in project management methodologies and energy storage technologies.\nCareer growth opportunities within project management, operations, or commercial functions.\nComprehensive benefits package including [health insurance, retirement plan, PTO, etc.].\nApplication Process\nEven if you don't meet every requirement listed, if you believe this role suits you well, we encourage you to apply. Your application gives us the opportunity to learn more about you and explore potential fits within our team.\nFollowing the submission of your application, we are committed to providing timely responses to all applicants, though response times may vary depending on the volume of submissions. If you do not receive an immediate response, please rest assured that this in no way reflects on the quality of your candidacy. Your application will be retained in our files, and we may reach out to you for future roles that align with your skills and interests. As our organization experiences rapid growth, we appreciate your patience in this process. We are actively working each day to enhance our application procedures to ensure a smoother and more efficient experience for all applicants. Thank you for your understanding and enthusiasm for joining our dynamic team.\nEqual Employment Opportunity\nAt AESC, we are committed to providing Equal Employment Opportunity (EEO) to all individuals. We participate in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S Join us in our passion to design, manufacture, and sell high-performance products, contributing to a sustainable and zero-carbon emission future.\nPhysical Requirements\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodation may be made to enable otherwise qualified individuals with disabilities to perform the essential job functions.\nAbility to sit for extended periods of time.\nAbility to read, write, speak, hear; stand; walk; use hands to finger, handle, or feel; reach and lift with hands and arms frequently throughout the day.\nRequired to occasionally lift, push, pull and/or move up to 10 pounds and occasionally required to lift, push, pull and/or move up to 35 pounds.\nWork Environment\nThe work environment is primarily an automated manufacturing plant with a concrete floor and is characterized by some temperature extremes, moderate noise, and forklift traffic. The individual must be able to perform all essential functions as appropriate on the plant floor, in meetings, and with employees, management, customers and suppliers.\nCandidate must perform the essential duties and responsibilities with or without reasonable accommodation efficiently and accurately, and without causing significant safety threat to self or others. The statements made herein are intended to describe the general nature and level of work being performed by employees assigned to this job classification. They are not intended to be construed as an exhaustive and inclusive list of all responsibilities, duties, and/or skills required of personnel so classified.\nGo back\nApply\nShare this job\nEmail\nFacebook\nX\nWeChat\nWhatsApp\nLinkedIn",
        "application_url": "https://jobs.aesc-group.com/en_US/careers/Login?jobId=977&recommendation=&source=&tags=&user=&formValues=",
        "": {},
        "metadata": {
            "Job Title": "Project Management Coordinator",
            "Ref #": "P1008594",
            "Employment Type": "Permanent",
            "Department": "Sales",
            "Position level": "Coordinator",
            "Date": "Tuesday, January 6, 2026",
            "AESC Office Location": "Remote worker USA"
        },
        "link": "https://jobs.aesc-group.com/en_US/careers/JobDetail/Santa-Clara-California-United-States-Project-Management-Coordinator/977"
    },
    {
        "title": "Senior Project Manager",
        "description_html": null,
        "description_text": "General information\nJob Title\nSenior Project Manager\nRef #\nP1008597\nEmployment Type\nPermanent\nDepartment\nSales\nPosition level\nManager\nDate\nTuesday, January 6, 2026\nAESC Office Location\nRemote worker USA\nDescription & Requirements\nJob Description\nAESC is looking to add a Senior Project Manager to our team.\nFull-Time\nRemote/Hybrid/On-site\nAbout AESC US LLC\nAESC is an exciting, newly created global organization committed to solving the challenges of a sustainable future and becoming the leading supplier of full-value-chain battery solutions. Our lithium-ion batteries can be found in nearly one million electric vehicles worldwide and have a stellar safety record of zero-critical issues. AESC US is leading the way in battery technology. We design and manufacture EV battery technology for various electric vehicles and equipment. We are working hard towards unlocking the full potential of sustainable energy and climate change mitigation. We will continue to build upon our successes and expand into new markets and industries, producing innovative and competitive products and technologies that advance the goal of a zero-carbon emission future. AESC is headquartered in Japan and has battery manufacturing locations in Japan, UK, China, and the U.S.\nAESC Mission\nOur mission is to solve the challenges for a sustainable future. Together, we can make a meaningful impact.\nAbout the Role\nWe are seeking an experienced and strategic Senior Project Manager to lead the execution of complex, utility-scale energy storage and infrastructure projects. This role will oversee project planning, delivery, and stakeholder management, ensuring projects are completed on time, within scope, and within budget. The Senior Project Manager will act as a trusted advisor to leadership, mentor junior staff, and drive continuous improvement across the project management function.\nWhat You Will Do\nLead end-to-end project management for large-scale energy storage and infrastructure initiatives.\nDefine project scope, objectives, and success metrics in alignment with organizational strategy.\nDevelop and manage detailed project plans, schedules, budgets, and resource allocations.\nIdentify risks, issues, and dependencies; implement mitigation strategies proactively.\nServe as the primary point of contact for clients, partners, and internal stakeholders.\nFacilitate communication and decision-making across cross-functional teams (engineering, procurement, sales, and services).\nEnsure compliance with organizational standards, safety requirements, and quality assurance processes.\nMentor and supervise project coordinators and junior project managers, fostering professional growth.\nDrive adoption of project management best practices and continuous improvement initiatives.\nQualifications\nWhat You Need\nBachelor’s degree in Business, Engineering, Project Management, or related field (Master’s preferred).\n7+ years of project management experience, with at least 3 years in a senior or lead role.\nProven track record of managing large-scale, complex projects in energy, infrastructure, or construction.\nStrong knowledge of project management methodologies (Agile, Waterfall, Hybrid).\nPMP, PRINCE2, or Agile certification strongly preferred.\nProficiency with project management tools (MS Project, Smartsheet, Asana, Jira) and Microsoft Office.\nExceptional communication, negotiation, and leadership skills.\nWhat is “Nice to Have”?\nKnowledge of utility-scale energy storage systems, renewable energy, or large infrastructure projects.\nUnderstanding of permitting, interconnection, and regulatory processes.\nExperience working with EPCs, utilities, IPPs, or project developers.\nStrong financial acumen and budget management skills.\nWhat We Offer\nWelcome to AESC, supporting our state-of-the-art Gigafactories, where you'll have the opportunity to tackle the world's most fascinating challenges alongside exceptionally talented individuals who are driven to make a difference. At AESC, we offer a comprehensive compensation package. In addition, we provide a range of valuable benefits, such as 401K,\nand health insurance. We strive to ensure that our employees are well taken care of, enabling them to focus on their work and contribute to our collective mission of changing the world.\nAn inclusive and diverse work environment that fosters and encourages professional and personal development.\nHighly automated, clean, safe, and temperature-controlled production environment\nMedical, Dental and Vision Insurance\nHSA and Flexible Spending Accounts\n401K with company match\nLife Insurance (Company paid and additional voluntary life available)\nPaid Vacation and 14 Paid Holidays\nShort term and long-term disability coverage (Company Paid)\nTuition reimbursement\nCompetitive base salary with performance-based incentives.\nOpportunity to lead high-impact energy transition projects that enhance grid reliability and decarbonization.\nHands-on exposure to complex, high-value infrastructure initiatives.\nComprehensive training in advanced project management methodologies and energy storage technologies.\nCareer growth opportunities into leadership roles within project management or services.\nComprehensive benefits package including [health insurance, retirement plan, PTO, etc.].\nApplication Process\nEven if you don't meet every requirement listed, if you believe this role suits you well, we encourage you to apply. Your application gives us the opportunity to learn more about you and explore potential fits within our team.\nFollowing the submission of your application, we are committed to providing timely responses to all applicants, though response times may vary depending on the volume of submissions. If you do not receive an immediate response, please rest assured that this in no way reflects on the quality of your candidacy. Your application will be retained in our files, and we may reach out to you for future roles that align with your skills and interests. As our organization experiences rapid growth, we appreciate your patience in this process. We are actively working each day to enhance our application procedures to ensure a smoother and more efficient experience for all applicants. Thank you for your understanding and enthusiasm for joining our dynamic team.\nEqual Employment Opportunity\nAt AESC, we are committed to providing Equal Employment Opportunity (EEO) to all individuals. We participate in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S Join us in our passion to design, manufacture, and sell high-performance products, contributing to a sustainable and zero-carbon emission future.\nPhysical Requirements\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodation may be made to enable otherwise qualified individuals with disabilities to perform the essential job functions.\nAbility to sit for extended periods of time.\nAbility to read, write, speak, hear; stand; walk; use hands to finger, handle, or feel; reach and lift with hands and arms frequently throughout the day.\nRequired to occasionally lift, push, pull and/or move up to 10 pounds and occasionally required to lift, push, pull and/or move up to 35 pounds.\nWork Environment\nThe work environment is primarily an automated manufacturing plant with a concrete floor and is characterized by some temperature extremes, moderate noise, and forklift traffic. The individual must be able to perform all essential functions as appropriate on the plant floor, in meetings, and with employees, management, customers and suppliers.\nCandidate must perform the essential duties and responsibilities with or without reasonable accommodation efficiently and accurately, and without causing significant safety threat to self or others. The statements made herein are intended to describe the general nature and level of work being performed by employees assigned to this job classification. They are not intended to be construed as an exhaustive and inclusive list of all responsibilities, duties, and/or skills required of personnel so classified.\nGo back\nApply\nShare this job\nEmail\nFacebook\nX\nWeChat\nWhatsApp\nLinkedIn",
        "application_url": "https://jobs.aesc-group.com/en_US/careers/Login?jobId=978&recommendation=&source=&tags=&user=&formValues=",
        "": {},
        "metadata": {
            "Job Title": "Senior Project Manager",
            "Ref #": "P1008597",
            "Employment Type": "Permanent",
            "Department": "Sales",
            "Position level": "Manager",
            "Date": "Tuesday, January 6, 2026",
            "AESC Office Location": "Remote worker USA"
        },
        "link": "https://jobs.aesc-group.com/en_US/careers/JobDetail/Santa-Clara-California-United-States-Senior-Project-Manager/978"
    },
    {
        "title": "Manufacturing Technician",
        "description_html": null,
        "description_text": "General information\nJob Title\nManufacturing Technician\nRef #\n158\nEmployment Type\nPermanent\nDepartment\nManufacturing\nPosition level\nTechnician\nDate\nMonday, January 5, 2026\nAESC Office Location\nSmyrna, Tennessee USA\nDescription & Requirements\nJob Description\nAbout AESC US LLC\nAESC is an exciting, newly created global organization committed to solving the challenges of a sustainable future and becoming the leading supplier of full-value-chain battery solutions. Our lithium-ion batteries can be found in nearly one million electric vehicles worldwide and have a stellar safety record of zero-critical issues. AESC US is leading the way in battery technology. We design and manufacture EV battery technology for various electric vehicles and equipment. We are working hard towards unlocking the full potential of sustainable energy and climate change mitigation. We will continue to build upon our successes and expand into new markets and industries, producing innovative and competitive products and technologies that advance the goal of a zero-carbon emission future. AESC is headquartered in Japan and has battery manufacturing locations in Japan, UK, China, and the U.S.\nAESC Mission\nOur mission is to solve the challenges for a sustainable future. Together, we can make a meaningful impact.\nAbout the Role\nJoin our dynamic team in Smyrna, TN, and contribute to the production of cutting-edge electric vehicle batteries at our state-of-the-art factory. Collaborate with cross-functional teams, uphold our commitment to sustainability, and be part of the journey towards a zero-carbon emission future.\nKey Responsibilities:\nContribute to the production of lithium-ion batteries for electric vehicles.\nCollaborate with cross-functional teams to ensure efficient and high-quality production processes.\nUphold our commitment to environmental sustainability and innovation.\nEmbrace a culture of continuous improvement and adaptability.\nWhat You'll Bring:\nHigh school diploma or GED required\nPrevious experience in manufacturing or related fields preferred.\nStrong work ethic and commitment to excellence.\nAbility to thrive in a dynamic and collaborative team environment.\nPassion for innovation and making a positive impact on the automotive industry.\nWhat You'll Gain at AESC:\nHighly automated, clean, safe, and temperature-controlled production environment.\nBe part of an organization committed to solving challenges for a sustainable future.\nEnjoy competitive compensation and benefits supporting your physical, mental, and financial well-being.\nCareer growth opportunities.\nQualifications\nWhat You'll Bring:\nHigh school diploma or GED required\nPrevious experience in manufacturing or related fields preferred.\nStrong work ethic and commitment to excellence.\nAbility to thrive in a dynamic and collaborative team environment.\nPassion for innovation and making a positive impact on the automotive industry.\nGo back\nApply\nShare this job\nEmail\nFacebook\nX\nWeChat\nWhatsApp\nLinkedIn",
        "application_url": "https://jobs.aesc-group.com/en_US/careers/Login?jobId=164&recommendation=&source=&tags=&user=&formValues=",
        "": {},
        "metadata": {
            "Job Title": "Manufacturing Technician",
            "Ref #": "158",
            "Employment Type": "Permanent",
            "Department": "Manufacturing",
            "Position level": "Technician",
            "Date": "Monday, January 5, 2026",
            "AESC Office Location": "Smyrna, Tennessee USA"
        },
        "link": "https://jobs.aesc-group.com/en_US/careers/JobDetail/Smyrna-Tennessee-United-States-Manufacturing-Technician/164"
    },
    {
        "title": "Infirmier(ère)",
        "description_html": null,
        "description_text": "General information\nJob Title\nInfirmier(ère)\nRef #\n20001494\nEmployment Type\nPermanent\nDepartment\nEnvironmental Health and Safety\nPosition level\nTechnician\nDate\nMonday, December 22, 2025\nAESC Office Location\nDouai, Hauts-de-France, France\nDescription & Requirements\nJob Description\n🌍♻️\nPrêt(e) à contribuer à la santé et au bien-être des salariés dans un environnement industriel exigeant ?\n♻️🌍\nRejoignez AESC\net participez activement à la prévention des risques professionnels et à la promotion de la santé au travail !\nInfirmier(ère) (H/F)\n🎯 Vos missions principales\nAu sein de l’équipe HSE et rattaché(e) au Manager HSE, vous jouez un rôle clé dans la surveillance de la santé des salariés et la prévention des risques professionnels.\nRéaliser des consultations infirmières en santé au travail (suivi, conseils, visites)\nParticiper à l’évaluation des risques professionnels avec l’équipe pluridisciplinaire (médecin du travail, ergonomes, etc.)\nConseiller les salariés et l’employeur sur les bonnes pratiques en matière de santé, d’hygiène et de sécurité\nMettre en œuvre des actions de prévention, d’éducation à la santé et de dépistage\nAssurer le suivi des dossiers médicaux et des vaccinations\nCollaborer avec les acteurs internes et externes (CSSCT, médecine du travail, CARSAT, inspection du travail…)\nParticiper à la veille réglementaire et au respect des normes en santé au travail\nRédiger les rapports et bilans d’activité\n💼 Savoir-faire requis\nBonne connaissance de la réglementation en santé et sécurité au travail\nMaîtrise des outils informatiques (bureautique, logiciels de gestion médicale)\nExpérience en milieu industriel appréciée\n? Savoir-être requis\nExcellent sens du relationnel et de l’écoute\nAutonomie, rigueur et esprit d’équipe\nDiscrétion absolue et respect de la confidentialité\n✅ Exigences du poste\nDiplôme d’État d’Infirmier(ère)\nobligatoire\nFormation complémentaire en santé au travail\nobligatoire\n#LI-EO1\nQualifications\n🌍♻️\nPrêt(e) à contribuer à la santé et au bien-être des salariés dans un environnement industriel exigeant ?\n♻️🌍\nRejoignez AESC\net participez activement à la prévention des risques professionnels et à la promotion de la santé au travail !\nInfirmier(ère) (H/F)\n🎯 Vos missions principales\nAu sein de l’équipe HSE et rattaché(e) au Manager HSE, vous jouez un rôle clé dans la surveillance de la santé des salariés et la prévention des risques professionnels.\nRéaliser des consultations infirmières en santé au travail (suivi, conseils, visites)\nParticiper à l’évaluation des risques professionnels avec l’équipe pluridisciplinaire (médecin du travail, ergonomes, etc.)\nConseiller les salariés et l’employeur sur les bonnes pratiques en matière de santé, d’hygiène et de sécurité\nMettre en œuvre des actions de prévention, d’éducation à la santé et de dépistage\nAssurer le suivi des dossiers médicaux et des vaccinations\nCollaborer avec les acteurs internes et externes (CSSCT, médecine du travail, CARSAT, inspection du travail…)\nParticiper à la veille réglementaire et au respect des normes en santé au travail\nRédiger les rapports et bilans d’activité\n💼 Savoir-faire requis\nBonne connaissance de la réglementation en santé et sécurité au travail\nMaîtrise des outils informatiques (bureautique, logiciels de gestion médicale)\nExpérience en milieu industriel appréciée\n? Savoir-être requis\nExcellent sens du relationnel et de l’écoute\nAutonomie, rigueur et esprit d’équipe\nDiscrétion absolue et respect de la confidentialité\n✅ Exigences du poste\nDiplôme d’État d’Infirmier(ère)\nobligatoire\nFormation complémentaire en santé au travail\nobligatoire\n#LI-EO1\nGo back\nApply\nShare this job\nEmail\nFacebook\nX\nWeChat\nWhatsApp\nLinkedIn",
        "application_url": "https://jobs.aesc-group.com/en_US/careers/Login?jobId=972&recommendation=&source=&tags=&user=&formValues=",
        "": {},
        "metadata": {
            "Job Title": "Infirmier(ère)",
            "Ref #": "20001494",
            "Employment Type": "Permanent",
            "Department": "Environmental Health and Safety",
            "Position level": "Technician",
            "Date": "Monday, December 22, 2025",
            "AESC Office Location": "Douai, Hauts-de-France, France"
        },
        "link": "https://jobs.aesc-group.com/en_US/careers/JobDetail/LAMBRES-LEZ-DOUAI-Nord-France-Infirmier-re/972"
    },
    {
        "title": "Service Operations Manager",
        "description_html": null,
        "description_text": "General information\nJob Title\nService Operations Manager\nRef #\nP1008523\nEmployment Type\nPermanent\nDepartment\nSales\nPosition level\nManager\nDate\nMonday, December 22, 2025\nAESC Office Location\nSanta Clara, California USA\nDescription & Requirements\nJob Description\nAESC is looking to add a Service Operations Manager to our team remotely.\nFull-Time\nRemote\nAbout AESC US LLC\nAESC is an exciting, newly created global organization committed to solving the challenges of a sustainable future and becoming the leading supplier of full-value-chain battery solutions. Our lithium-ion batteries can be found in nearly one million electric vehicles worldwide and have a stellar safety record of zero-critical issues. AESC US is leading the way in battery technology. We design and manufacture EV battery technology for various electric vehicles and equipment. We are working hard towards unlocking the full potential of sustainable energy and climate change mitigation. We will continue to build upon our successes and expand into new markets and industries, producing innovative and competitive products and technologies that advance the goal of a zero-carbon emission future. AESC is headquartered in Japan and has battery manufacturing locations in Japan, UK, China, and the U.S.\nAESC Mission\nOur mission is to solve the challenges for a sustainable future. Together, we can make a meaningful impact.\nAbout the Role\nWe are seeking an experienced Service Operations Manager to oversee all aspects of service operations for utility-scale energy storage systems. This role is responsible for managing spare parts inventory, warranty requirements, long-term service agreement (LTSA) obligations, and warehouse operations. The Service Operations Manager will ensure efficient processes, compliance with contractual commitments, and timely delivery of parts and services to support customer satisfaction and operational excellence.\nWhat You Will Do\nManage spare parts inventory, procurement, and distribution to support service and maintenance activities.\nOversee warranty administration, including claim processing, documentation, and compliance with manufacturer and customer requirements.\nEnsure fulfillment of LTSA obligations, including scheduled maintenance, parts availability, and performance guarantees.\nCoordinate warehouse operations with our internal logistics team, including receiving, storage, and shipping of parts and equipment.\nDevelop and maintain accurate records for inventory, warranty claims, and LTSA performance metrics.\nCollaborate with service teams, engineering, and procurement to forecast parts demand and optimize inventory levels.\nImplement process improvements to enhance efficiency, reduce costs, and improve service delivery.\nEnsure compliance with safety standards, quality requirements, and regulatory guidelines in all operations.\nPrepare regular reports on inventory status, warranty performance, and LTSA compliance for senior management.\nQualifications\nWhat You Need\nBachelor’s degree in Supply Chain Management, Business Administration, Engineering, or related field (or equivalent experience).\n5+ years of experience in service operations, inventory management, or supply chain roles; experience in energy or industrial sectors preferred.\nStrong understanding of warranty processes, contractual obligations, and service agreements.\nProficiency with inventory management systems, ERP platforms, and Microsoft Office applications.\nExcellent organizational and analytical skills with attention to detail.\nStrong communication and collaboration skills for working with cross-functional teams and external partners.\nWhat is “Nice to Have”?\nExperience managing LTSA programs and spare parts logistics for complex systems.\nKnowledge of energy storage systems, renewable energy technologies, or large-scale industrial equipment.\nFamiliarity with warehouse safety standards and best practices.\nUnderstanding of cost optimization strategies in service operations.\nWhat We Offer\nWelcome to AESC, supporting our state-of-the-art Gigafactories, where you'll have the opportunity to tackle the world's most fascinating challenges alongside exceptionally talented individuals who are driven to make a difference. At AESC, we offer a comprehensive compensation package. In addition, we provide a range of valuable benefits, such as 401K,\nand health insurance. We strive to ensure that our employees are well taken care of, enabling them to focus on their work and contribute to our collective mission of changing the world.\nAn inclusive and diverse work environment that fosters and encourages professional and personal development.\nHighly automated, clean, safe, and temperature-controlled production environment\nMedical, Dental and Vision Insurance\nHSA and Flexible Spending Accounts\n401K with company match\nLife Insurance (Company paid and additional voluntary life available)\nPaid Vacation and 14 Paid Holidays\nShort term and long-term disability coverage (Company Paid)\nTuition reimbursement\nCompetitive base salary with performance-based incentives. Salary range: $105,000-$132,000/annual.\nOpportunity to lead service operations for cutting-edge energy storage projects.\nComprehensive training and career development opportunities.\nFull benefits package including [health insurance, retirement plan, PTO, etc.].\nApplication Process\nEven if you don't meet every requirement listed, if you believe this role suits you well, we encourage you to apply. Your application gives us the opportunity to learn more about you and explore potential fits within our team.\nFollowing the submission of your application, we are committed to providing timely responses to all applicants, though response times may vary depending on the volume of submissions. If you do not receive an immediate response, please rest assured that this in no way reflects on the quality of your candidacy. Your application will be retained in our files, and we may reach out to you for future roles that align with your skills and interests. As our organization experiences rapid growth, we appreciate your patience in this process. We are actively working each day to enhance our application procedures to ensure a smoother and more efficient experience for all applicants. Thank you for your understanding and enthusiasm for joining our dynamic team.\nEqual Employment Opportunity\nAt AESC, we are committed to providing Equal Employment Opportunity (EEO) to all individuals. We participate in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S Join us in our passion to design, manufacture, and sell high-performance products, contributing to a sustainable and zero-carbon emission future.\nPhysical Requirements\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodation may be made to enable otherwise qualified individuals with disabilities to perform the essential job functions.\nAbility to sit for extended periods of time.\nAbility to read, write, speak, hear; stand; walk; use hands to finger, handle, or feel; reach and lift with hands and arms frequently throughout the day.\nRequired to occasionally lift, push, pull and/or move up to 10 pounds and occasionally required to lift, push, pull and/or move up to 35 pounds.\nAbility to work in warehouse environments and occasionally lift light to moderate objects.\nComfortable conducting inventory checks and inspections in varying conditions.\nStrict adherence to OSHA requirements and company safety protocols.\nUse of appropriate PPE when in warehouse or operational areas.\nWork Environment\nThe work environment is primarily an automated manufacturing plant with a concrete floor and is characterized by some temperature extremes, moderate noise, and forklift traffic. The individual must be able to perform all essential functions as appropriate on the plant floor, in meetings, and with employees, management, customers and suppliers.\nCandidate must perform the essential duties and responsibilities with or without reasonable accommodation efficiently and accurately, and without causing significant safety threat to self or others. The statements made herein are intended to describe the general nature and level of work being performed by employees assigned to this job classification. They are not intended to be construed as an exhaustive and inclusive list of all responsibilities, duties, and/or skills required of personnel so classified.\nGo back\nApply\nShare this job\nEmail\nFacebook\nX\nWeChat\nWhatsApp\nLinkedIn",
        "application_url": "https://jobs.aesc-group.com/en_US/careers/Login?jobId=973&recommendation=&source=&tags=&user=&formValues=",
        "": {},
        "metadata": {
            "Job Title": "Service Operations Manager",
            "Ref #": "P1008523",
            "Employment Type": "Permanent",
            "Department": "Sales",
            "Position level": "Manager",
            "Date": "Monday, December 22, 2025",
            "AESC Office Location": "Santa Clara, California USA"
        },
        "link": "https://jobs.aesc-group.com/en_US/careers/JobDetail/Santa-Clara-California-United-States-Service-Operations-Manager/973"
    },
    {
        "title": "Field Service Technician",
        "description_html": null,
        "description_text": "General information\nJob Title\nField Service Technician\nRef #\nP1008519\nEmployment Type\nPermanent\nDepartment\nSales\nPosition level\nTechnician\nDate\nMonday, December 22, 2025\nAESC Office Location\nSanta Clara, California USA\nDescription & Requirements\nJob Description\nAESC is looking to add a Field Service Technician to our team in remotely.\nFull-Time\nRemote\nAbout AESC US LLC\nAESC is an exciting, newly created global organization committed to solving the challenges of a sustainable future and becoming the leading supplier of full-value-chain battery solutions. Our lithium-ion batteries can be found in nearly one million electric vehicles worldwide and have a stellar safety record of zero-critical issues. AESC US is leading the way in battery technology. We design and manufacture EV battery technology for various electric vehicles and equipment. We are working hard towards unlocking the full potential of sustainable energy and climate change mitigation. We will continue to build upon our successes and expand into new markets and industries, producing innovative and competitive products and technologies that advance the goal of a zero-carbon emission future. AESC is headquartered in Japan and has battery manufacturing locations in Japan, UK, China, and the U.S.\nAESC Mission\nOur mission is to solve the challenges for a sustainable future. Together, we can make a meaningful impact.\nAbout the Role\nWe are seeking a skilled and hands-on Field Service Technician to support the installation and commissioning of utility-scale energy storage systems. This role will oversee on-site activities, including installation verification checks and coordination of commissioning processes, ensuring compliance with safety and quality standards. The ideal candidate will have strong technical aptitude, attention to detail, and the ability to work effectively in dynamic field environments.\nWhat You Will Do\nServe as the on-site representative during equipment installation and commissioning.\nPerform installation verification checks to ensure compliance with design specifications and safety standards.\nCoordinate and execute site commissioning activities for energy storage systems, including functional testing and troubleshooting.\nInterface with project managers, engineering teams, and customer representatives to resolve technical issues promptly.\nDocument installation and commissioning activities, including test results and punch lists.\nEnsure adherence to safety protocols and regulatory requirements during all field operations.\nProvide feedback to engineering and product teams on field performance and installation best practices.\nSupport training for customer personnel on system operation and maintenance.\nQualifications\nWhat You Need\nAssociate degree or technical certification in Electrical Engineering, Mechanical Engineering, or related field (or equivalent experience).\n2–5 years of experience in field service, commissioning, or installation of electrical or energy systems; experience with energy storage systems preferred.\nStrong understanding of electrical systems, power electronics, and industrial safety standards.\nAbility to read and interpret technical drawings, schematics, and installation manuals.\nProficiency with diagnostic tools and commissioning software.\nExcellent problem-solving skills and ability to work independently in fast-paced environments.\nWillingness to travel extensively and work on-site at customer locations.\nWhat is “Nice to Have”?\nFamiliarity with battery energy storage systems (BESS) and renewable energy technologies.\nExperience with SCADA systems, PLCs, and communication protocols.\nKnowledge of commissioning procedures for large-scale electrical equipment.\nWhat We Offer\nWelcome to AESC, supporting our state-of-the-art Gigafactories, where you'll have the opportunity to tackle the world's most fascinating challenges alongside exceptionally talented individuals who are driven to make a difference. At AESC, we offer a comprehensive compensation package. In addition, we provide a range of valuable benefits, such as 401K,\nand health insurance. We strive to ensure that our employees are well taken care of, enabling them to focus on their work and contribute to our collective mission of changing the world.\nAn inclusive and diverse work environment that fosters and encourages professional and personal development.\nHighly automated, clean, safe, and temperature-controlled production environment\nMedical, Dental and Vision Insurance\nHSA and Flexible Spending Accounts\n401K with company match\nLife Insurance (Company paid and additional voluntary life available)\nPaid Vacation and 14 Paid Holidays\nShort term and long-term disability coverage (Company Paid)\nTuition reimbursement\nCompetitive base salary with performance-based incentives. Salary range: $86,000-$108,000/annual.\nOpportunity to work on cutting-edge energy storage projects contributing to grid reliability and decarbonization.\nHands-on exposure to advanced technologies in real-world applications.\nComprehensive training and career development opportunities.\nComprehensive benefits package including [health insurance, retirement plan, PTO, etc.].\nApplication Process\nEven if you don't meet every requirement listed, if you believe this role suits you well, we encourage you to apply. Your application gives us the opportunity to learn more about you and explore potential fits within our team.\nFollowing the submission of your application, we are committed to providing timely responses to all applicants, though response times may vary depending on the volume of submissions. If you do not receive an immediate response, please rest assured that this in no way reflects on the quality of your candidacy. Your application will be retained in our files, and we may reach out to you for future roles that align with your skills and interests. As our organization experiences rapid growth, we appreciate your patience in this process. We are actively working each day to enhance our application procedures to ensure a smoother and more efficient experience for all applicants. Thank you for your understanding and enthusiasm for joining our dynamic team.\nEqual Employment Opportunity\nAt AESC, we are committed to providing Equal Employment Opportunity (EEO) to all individuals. We participate in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S Join us in our passion to design, manufacture, and sell high-performance products, contributing to a sustainable and zero-carbon emission future.\nPhysical Requirements\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodation may be made to enable otherwise qualified individuals with disabilities to perform the essential job functions.\nAbility to sit for extended periods of time.\nAbility to read, write, speak, hear; stand; walk; use hands to finger, handle, or feel; reach and lift with hands and arms frequently throughout the day.\nRequired to occasionally lift, push, pull and/or move up to 10 pounds and occasionally required to lift, push, pull and/or move up to 35 pounds.\nAbility to lift light objects and use basic hand tools.\nCapability to stand and walk for extended periods during site activities.\nComfort working in outdoor conditions, including heat, cold, and varying weather.\nStrict adherence to OSHA requirements and site-specific safety protocols.\nUse of appropriate PPE (Personal Protective Equipment) at all times on site.\nWork Environment\nThe work environment is primarily an automated manufacturing plant with a concrete floor and is characterized by some temperature extremes, moderate noise, and forklift traffic. The individual must be able to perform all essential functions as appropriate on the plant floor, in meetings, and with employees, management, customers and suppliers.\nCandidate must perform the essential duties and responsibilities with or without reasonable accommodation efficiently and accurately, and without causing significant safety threat to self or others. The statements made herein are intended to describe the general nature and level of work being performed by employees assigned to this job classification. They are not intended to be construed as an exhaustive and inclusive list of all responsibilities, duties, and/or skills required of personnel so classified.\nGo back\nApply\nShare this job\nEmail\nFacebook\nX\nWeChat\nWhatsApp\nLinkedIn",
        "application_url": "https://jobs.aesc-group.com/en_US/careers/Login?jobId=974&recommendation=&source=&tags=&user=&formValues=",
        "": {},
        "metadata": {
            "Job Title": "Field Service Technician",
            "Ref #": "P1008519",
            "Employment Type": "Permanent",
            "Department": "Sales",
            "Position level": "Technician",
            "Date": "Monday, December 22, 2025",
            "AESC Office Location": "Santa Clara, California USA"
        },
        "link": "https://jobs.aesc-group.com/en_US/careers/JobDetail/Santa-Clara-California-United-States-Field-Service-Technician/974"
    },
    {
        "title": "Technical Services Engineer",
        "description_html": null,
        "description_text": "General information\nJob Title\nTechnical Services Engineer\nRef #\nP1008521\nEmployment Type\nPermanent\nDepartment\nSales\nPosition level\nEngineer\nDate\nMonday, December 22, 2025\nAESC Office Location\nRemote worker USA\nDescription & Requirements\nJob Description\nAESC is looking to add a Technician Services Engineer to our team remotely.\nFull-Time\nRemote\nAbout AESC US LLC\nAESC is an exciting, newly created global organization committed to solving the challenges of a sustainable future and becoming the leading supplier of full-value-chain battery solutions. Our lithium-ion batteries can be found in nearly one million electric vehicles worldwide and have a stellar safety record of zero-critical issues. AESC US is leading the way in battery technology. We design and manufacture EV battery technology for various electric vehicles and equipment. We are working hard towards unlocking the full potential of sustainable energy and climate change mitigation. We will continue to build upon our successes and expand into new markets and industries, producing innovative and competitive products and technologies that advance the goal of a zero-carbon emission future. AESC is headquartered in Japan and has battery manufacturing locations in Japan, UK, China, and the U.S.\nAESC Mission\nOur mission is to solve the challenges for a sustainable future. Together, we can make a meaningful impact.\nAbout the Role\nWe are seeking a highly skilled Technical Services Engineer to lead commissioning activities and manage technical service work for utility-scale energy storage systems. This role operates remotely and serves as the technical expert during commissioning and service operations, ensuring successful system start-up, troubleshooting, and compliance with all technical standards. The Technical Services Engineer will support the commissioning team and handle technical service activities, including diagnostics, repairs, and remote support. The ideal candidate will have deep technical knowledge, leadership ability, and a commitment to quality and safety.\nWhat You Will Do\nLead remote commissioning activities for energy storage systems, including system configuration, functional testing, and performance validation.\nAct as the technical authority during commissioning, guiding and directing the commissioning team to ensure successful project execution.\nPerform and oversee technical service work, including troubleshooting, diagnostics, and repairs for energy storage systems.\nProvide advanced technical support for service issues and collaborate with engineering teams to resolve complex challenges.\nPrepare and maintain detailed commissioning and service documentation, including test reports and maintenance records.\nEnsure compliance with safety standards, quality requirements, and regulatory guidelines during all commissioning and service activities.\nOffer technical training and mentorship to commissioning and service team members.\nSupport post-commissioning activities such as performance monitoring and issue resolution as needed.\nQualifications\nWhat You Need\nBachelor’s degree in Electrical Engineering, Mechanical Engineering, or related technical field (or equivalent experience).\n3–6 years of experience in commissioning and service engineering for electrical or energy systems; experience with energy storage systems strongly preferred.\nExpertise in commissioning processes, system integration, troubleshooting, and repair of complex technical systems.\nProficiency with remote diagnostic tools, SCADA systems, and commissioning software.\nStrong analytical and problem-solving skills with the ability to lead technical activities independently.\nExcellent communication skills for guiding teams and interacting with customers remotely.\nWhat is “Nice to Have”?\nExpert knowledge of battery energy storage systems (BESS) and renewable energy technologies.\nFamiliarity with PLC programming, communication protocols, and control systems.\nExperience with cybersecurity best practices for remote system access.\nWhat We Offer\nWelcome to AESC, supporting our state-of-the-art Gigafactories, where you'll have the opportunity to tackle the world's most fascinating challenges alongside exceptionally talented individuals who are driven to make a difference. At AESC, we offer a comprehensive compensation package. In addition, we provide a range of valuable benefits, such as 401K,\nand health insurance. We strive to ensure that our employees are well taken care of, enabling them to focus on their work and contribute to our collective mission of changing the world.\nAn inclusive and diverse work environment that fosters and encourages professional and personal development.\nHighly automated, clean, safe, and temperature-controlled production environment\nMedical, Dental and Vision Insurance\nHSA and Flexible Spending Accounts\n401K with company match\nLife Insurance (Company paid and additional voluntary life available)\nPaid Vacation and 14 Paid Holidays\nShort term and long-term disability coverage (Company Paid)\nTuition reimbursement\nCompetitive base salary with performance-based incentives. Salary range: $105,000-$132,000/annual.\nOpportunity to lead technical commissioning and service work for cutting-edge energy storage projects.\nRemote work flexibility with occasional site visits for critical activities.\nComprehensive training and career development opportunities.\nFull benefits package including [health insurance, retirement plan, PTO, etc.].\nApplication Process\nEven if you don't meet every requirement listed, if you believe this role suits you well, we encourage you to apply. Your application gives us the opportunity to learn more about you and explore potential fits within our team.\nFollowing the submission of your application, we are committed to providing timely responses to all applicants, though response times may vary depending on the volume of submissions. If you do not receive an immediate response, please rest assured that this in no way reflects on the quality of your candidacy. Your application will be retained in our files, and we may reach out to you for future roles that align with your skills and interests. As our organization experiences rapid growth, we appreciate your patience in this process. We are actively working each day to enhance our application procedures to ensure a smoother and more efficient experience for all applicants. Thank you for your understanding and enthusiasm for joining our dynamic team.\nEqual Employment Opportunity\nAt AESC, we are committed to providing Equal Employment Opportunity (EEO) to all individuals. We participate in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S Join us in our passion to design, manufacture, and sell high-performance products, contributing to a sustainable and zero-carbon emission future.\nPhysical Requirements\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodation may be made to enable otherwise qualified individuals with disabilities to perform the essential job functions.\nAbility to sit for extended periods of time.\nAbility to read, write, speak, hear; stand; walk; use hands to finger, handle, or feel; reach and lift with hands and arms frequently throughout the day.\nRequired to occasionally lift, push, pull and/or move up to 10 pounds and occasionally required to lift, push, pull and/or move up to 35 pounds.\nAbility to work extended hours during critical commissioning and service phases.\nComfortable working remotely while coordinating with on-site teams.\nStrict adherence to OSHA requirements and company safety protocols during all activities.\nUse of appropriate PPE when visiting sites for audits or troubleshooting.\nWork Environment\nThe work environment is primarily an automated manufacturing plant with a concrete floor and is characterized by some temperature extremes, moderate noise, and forklift traffic. The individual must be able to perform all essential functions as appropriate on the plant floor, in meetings, and with employees, management, customers and suppliers.\nCandidate must perform the essential duties and responsibilities with or without reasonable accommodation efficiently and accurately, and without causing significant safety threat to self or others. The statements made herein are intended to describe the general nature and level of work being performed by employees assigned to this job classification. They are not intended to be construed as an exhaustive and inclusive list of all responsibilities, duties, and/or skills required of personnel so classified.\nGo back\nApply\nShare this job\nEmail\nFacebook\nX\nWeChat\nWhatsApp\nLinkedIn",
        "application_url": "https://jobs.aesc-group.com/en_US/careers/Login?jobId=975&recommendation=&source=&tags=&user=&formValues=",
        "": {},
        "metadata": {
            "Job Title": "Technical Services Engineer",
            "Ref #": "P1008521",
            "Employment Type": "Permanent",
            "Department": "Sales",
            "Position level": "Engineer",
            "Date": "Monday, December 22, 2025",
            "AESC Office Location": "Remote worker USA"
        },
        "link": "https://jobs.aesc-group.com/en_US/careers/JobDetail/Santa-Clara-California-United-States-Technical-Services-Engineer/975"
    },
    {
        "title": "Manager, Inside Sales",
        "description_html": null,
        "description_text": "General information\nJob Title\nManager, Inside Sales\nRef #\nP1008515\nEmployment Type\nPermanent\nDepartment\nSales\nPosition level\nAnalyst\nDate\nFriday, December 19, 2025\nAESC Office Location\nRemote worker USA\nDescription & Requirements\nJob Description\nAESC is looking to add an Inside Sales Manager to our team remotely.\nFull-Time\nRemote/Hybrid/On-site\nAbout AESC US LLC\nAESC is an exciting, newly created global organization committed to solving the challenges of a sustainable future and becoming the leading supplier of full-value-chain battery solutions. Our lithium-ion batteries can be found in nearly one million electric vehicles worldwide and have a stellar safety record of zero-critical issues. AESC US is leading the way in battery technology. We design and manufacture EV battery technology for various electric vehicles and equipment. We are working hard towards unlocking the full potential of sustainable energy and climate change mitigation. We will continue to build upon our successes and expand into new markets and industries, producing innovative and competitive products and technologies that advance the goal of a zero-carbon emission future. AESC is headquartered in Japan and has battery manufacturing locations in Japan, UK, China, and the U.S.\nAESC Mission\nOur mission is to solve the challenges for a sustainable future. Together, we can make a meaningful impact.\nAbout the Role\nWe are seeking a highly organized and technically curious\nInside Sales\nManager\nto support our\nutility-scale energy storage (BESS)\nbusiness. This role will focus on lead qualification, sales support, and opportunity management for large-scale battery storage projects serving utilities, independent power producers (IPPs), developers, and EPCs. The Inside Sales Representative will work closely with account managers, engineering, and project teams to help drive project development from early-stage inquiry through contract award.\nWhat You Will Do\nServe as the primary point of contact for inbound inquiries related to utility-scale BESS projects (typically 10 MW to 500+ MW).\nSupport Account Managers to qualify leads by gathering project details such as project size, location, interconnection status, application (capacity, ancillary services, renewable integration, etc.), and project timeline.\nSupport the sales team by coordinating resources within the company to prepare proposal packages\nWork within the sales org and marketing department to assist in scheduling and planning related to both internal and external activities and industry trade shows\nMaintain accurate opportunity tracking, forecasts, and customer communications within the CRM system.\nAssist with RFP and RFQ responses, including data collection, document organization, and submission support.\nFollow up with customers on proposals, technical clarifications, and commercial discussions.\nMonitor utility-scale market activity, policy drivers, and competitive landscape.\nSupport channel partners, EPCs, and developers throughout early project development phases.\nQualifications\nWhat You Need\nBachelor’s degree in Business, Engineering, Energy Systems, or a related field (or equivalent experience).\n2–4 years of inside sales, sales operations, or commercial support experience; exposure to utility-scale renewable energy, energy storage, power generation, or transmission & distribution preferred.\nFamiliarity with large infrastructure or capital equipment sales cycles.\nStrong understanding of sales funnel management and CRM tools.\nAbility to communicate complex technical and commercial concepts clearly and professionally.\nExcellent organizational skills with the ability to manage multiple large-scale opportunities simultaneously.\nSelf-driven, detail-oriented, and comfortable working in a fast-paced project environment.\nWhat is “Nice to Have”?\nKnowledge of utility-scale BESS components (battery containers, PCS, EMS, transformers, SCADA).\nUnderstanding of grid-connected applications such as frequency regulation, capacity, energy arbitrage, and renewable integration.\nExperience supporting EPCs, utilities, IPPs, or project developers.\nFamiliarity with interconnection processes, permitting, and project development phases for Utility scale ESS projects.\nProficiency with CRM platforms (Salesforce, HubSpot) and Microsoft Office or Google Workspace.\nBilingual of English and Mandarin is preferred\nWhat We Offer\nWelcome to AESC, supporting our state-of-the-art Gigafactories, where you'll have the opportunity to tackle the world's most fascinating challenges alongside exceptionally talented individuals who are driven to make a difference. At AESC, we offer a comprehensive compensation package. In addition, we provide a range of valuable benefits, such as 401K,\nand health insurance. We strive to ensure that our employees are well taken care of, enabling them to focus on their work and contribute to our collective mission of changing the world.\nAn inclusive and diverse work environment that fosters and encourages professional and personal development.\nHighly automated, clean, safe, and temperature-controlled production environment\nMedical, Dental and Vision Insurance\nHSA and Flexible Spending Accounts\n401K with company match\nLife Insurance (Company paid and additional voluntary life available)\nPaid Vacation and 14 Paid Holidays\nShort term and long-term disability coverage (Company Paid)\nTuition reimbursement\nHands-on exposure to complex, high-value utility-scale infrastructure projects.\nOpportunity to work on large-scale energy transition projects impacting grid reliability and decarbonization.\nCompetitive base salary with performance-based incentives.\nComprehensive training in energy storage technologies and market dynamics.\nCareer growth opportunities within utility-scale sales, project development, or commercial operations.\nComprehensive benefits package including [health insurance, retirement plan, PTO, etc.].\nApplication Process\nEven if you don't meet every requirement listed, if you believe this role suits you well, we encourage you to apply. Your application gives us the opportunity to learn more about you and explore potential fits within our team.\nFollowing the submission of your application, we are committed to providing timely responses to all applicants, though response times may vary depending on the volume of submissions. If you do not receive an immediate response, please rest assured that this in no way reflects on the quality of your candidacy. Your application will be retained in our files, and we may reach out to you for future roles that align with your skills and interests. As our organization experiences rapid growth, we appreciate your patience in this process. We are actively working each day to enhance our application procedures to ensure a smoother and more efficient experience for all applicants. Thank you for your understanding and enthusiasm for joining our dynamic team.\nEqual Employment Opportunity\nAt AESC, we are committed to providing Equal Employment Opportunity (EEO) to all individuals. We participate in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S Join us in our passion to design, manufacture, and sell high-performance products, contributing to a sustainable and zero-carbon emission future.\nPhysical Requirements\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodation may be made to enable otherwise qualified individuals with disabilities to perform the essential job functions.\nAbility to sit for extended periods of time.\nAbility to read, write, speak, hear; stand; walk; use hands to finger, handle, or feel; reach and lift with hands and arms frequently throughout the day.\nRequired to occasionally lift, push, pull and/or move up to 10 pounds and occasionally required to lift, push, pull and/or move up to 35 pounds.\nWork Environment\nThe work environment is primarily an automated manufacturing plant with a concrete floor and is characterized by some temperature extremes, moderate noise, and forklift traffic. The individual must be able to perform all essential functions as appropriate on the plant floor, in meetings, and with employees, management, customers and suppliers.\nCandidate must perform the essential duties and responsibilities with or without reasonable accommodation efficiently and accurately, and without causing significant safety threat to self or others. The statements made herein are intended to describe the general nature and level of work being performed by employees assigned to this job classification. They are not intended to be construed as an exhaustive and inclusive list of all responsibilities, duties, and/or skills required of personnel so classified.\nGo back\nApply\nShare this job\nEmail\nFacebook\nX\nWeChat\nWhatsApp\nLinkedIn",
        "application_url": "https://jobs.aesc-group.com/en_US/careers/Login?jobId=969&recommendation=&source=&tags=&user=&formValues=",
        "": {},
        "metadata": {
            "Job Title": "Manager, Inside Sales",
            "Ref #": "P1008515",
            "Employment Type": "Permanent",
            "Department": "Sales",
            "Position level": "Analyst",
            "Date": "Friday, December 19, 2025",
            "AESC Office Location": "Remote worker USA"
        },
        "link": "https://jobs.aesc-group.com/en_US/careers/JobDetail/Santa-Clara-California-United-States-Manager-Inside-Sales/969"
    },
    {
        "title": "Manager, Commercial Contract",
        "description_html": null,
        "description_text": "General information\nJob Title\nManager, Commercial Contract\nRef #\nP1008517\nEmployment Type\nPermanent\nDepartment\nSales\nPosition level\nAnalyst\nDate\nFriday, December 19, 2025\nAESC Office Location\nSanta Clara, California USA\nDescription & Requirements\nJob Description\nAESC is looking to add a Commercial Contract Manager to our team remotely.\nFull-Time\nRemote\nAbout AESC US LLC\nAESC is an exciting, newly created global organization committed to solving the challenges of a sustainable future and becoming the leading supplier of full-value-chain battery solutions. Our lithium-ion batteries can be found in nearly one million electric vehicles worldwide and have a stellar safety record of zero-critical issues. AESC US is leading the way in battery technology. We design and manufacture EV battery technology for various electric vehicles and equipment. We are working hard towards unlocking the full potential of sustainable energy and climate change mitigation. We will continue to build upon our successes and expand into new markets and industries, producing innovative and competitive products and technologies that advance the goal of a zero-carbon emission future. AESC is headquartered in Japan and has battery manufacturing locations in Japan, UK, China, and the U.S.\nAESC Mission\nOur mission is to solve the challenges for a sustainable future. Together, we can make a meaningful impact.\nAbout the Role\nThe\nCommercial Contract Manager\nwill be responsible for managing the commercial and contractual aspects of utility-scale energy storage projects, from bid stage through contract execution and project delivery. This role serves as a key interface between sales, legal, engineering, supply chain, and project execution teams to ensure contracts are commercially sound, risk-balanced, and aligned with company strategy. The ideal candidate has experience with large-scale energy or infrastructure contracts and a strong understanding of project risk, pricing, and commercial terms.\nWhat You Will Do\nContract Development & Negotiation\nLead the review, drafting, and negotiation of commercial contracts for utility-scale BESS projects, including supply agreements, EPC contracts, LTSA/O&M agreements, and framework agreements.\nSupport sales and business development teams during RFP, RFQ, and bid phases by reviewing commercial terms and conditions.\nNegotiate key commercial terms including pricing structures, payment milestones, liquidated damages, performance guarantees, warranties, limitations of liability, and change management provisions.\nIdentify, assess, and mitigate commercial and contractual risks associated with utility-scale projects.\nCross-Functional Collaboration\nWork closely with legal counsel to ensure contracts comply with applicable laws, regulations, and company policies.\nCollaborate with engineering, project management, compliance team, and supply chain teams to align contract terms with technical scope, delivery schedules, and manufacturing constraints.\nSupport project execution teams by interpreting contract terms, managing contractual correspondence, and resolving commercial disputes.\nContract Administration & Governance\nMaintain ownership of contracts throughout the project lifecycle, from contract signature through final acceptance and closeout.\nManage change orders, claims, variations, and amendments in coordination with project management teams.\nEnsure compliance with contractual obligations, including milestone deliverables, documentation, and notice requirements.\nMaintain accurate contract records, risk registers, and commercial trackers.\nCommercial Strategy & Risk Management\nSupport the development of standard contract templates, commercial playbooks, and negotiation guidelines.\nMonitor market trends, customer contracting practices, and risk profiles in utility-scale energy storage and power infrastructure markets.\nProvide input on commercial structures, contract exhibits, and risk allocation\nQualifications\nWhat You Need\nBachelor’s degree in Business, Law, Engineering, Finance, or a related field; advanced degree or legal background preferred.\n5+ years of experience in commercial contract management, contract negotiation, or commercial operations within energy, power generation, renewables, or large infrastructure projects.\nProven experience managing high-value, long-duration contracts (multi-million-dollar projects).\nStrong understanding of project-based contracting, including EPC and equipment supply agreements.\nAbility to identify and balance commercial risk while supporting business objectives.\nExcellent negotiation, communication, and stakeholder management skills.\nWhat is “Nice to Have”?\nPreferred Skills & Knowledge\nExperience with utility-scale BESS projects, renewable energy, power electronics, or grid infrastructure.\nFamiliarity with performance guarantees, availability metrics, degradation warranties, and long-term service agreements for energy storage.\nUnderstanding of utility and IPP contracting practices.\nExperience working across international projects and multi-jurisdictional contracts.\nProficiency with contract management systems and Microsoft Office or Google\nWhat We Offer\nWelcome to AESC, supporting our state-of-the-art Gigafactories, where you'll have the opportunity to tackle the world's most fascinating challenges alongside exceptionally talented individuals who are driven to make a difference. At AESC, we offer a comprehensive compensation package. In addition, we provide a range of valuable benefits, such as 401K,\nand health insurance. We strive to ensure that our employees are well taken care of, enabling them to focus on their work and contribute to our collective mission of changing the world.\nAn inclusive and diverse work environment that fosters and encourages professional and personal development.\nHighly automated, clean, safe, and temperature-controlled production environment\nMedical, Dental and Vision Insurance\nHSA and Flexible Spending Accounts\n401K with company match\nLife Insurance (Company paid and additional voluntary life available)\nPaid Vacation and 14 Paid Holidays\nShort term and long-term disability coverage (Company Paid)\nTuition reimbursement\nCompetitive compensation package, including performance-based incentives.\nOpportunity to play a critical role in delivering large-scale energy storage projects supporting grid reliability and decarbonization.\nExposure to complex, high-impact infrastructure contracts.\nCollaborative, cross-functional working environment.\nCareer growth opportunities within commercial leadership, project management, or executive roles.\nComprehensive benefits package including [health insurance, retirement plan, PTO, etc.].\nApplication Process\nEven if you don't meet every requirement listed, if you believe this role suits you well, we encourage you to apply. Your application gives us the opportunity to learn more about you and explore potential fits within our team.\nFollowing the submission of your application, we are committed to providing timely responses to all applicants, though response times may vary depending on the volume of submissions. If you do not receive an immediate response, please rest assured that this in no way reflects on the quality of your candidacy. Your application will be retained in our files, and we may reach out to you for future roles that align with your skills and interests. As our organization experiences rapid growth, we appreciate your patience in this process. We are actively working each day to enhance our application procedures to ensure a smoother and more efficient experience for all applicants. Thank you for your understanding and enthusiasm for joining our dynamic team.\nEqual Employment Opportunity\nAt AESC, we are committed to providing Equal Employment Opportunity (EEO) to all individuals. We participate in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S Join us in our passion to design, manufacture, and sell high-performance products, contributing to a sustainable and zero-carbon emission future.\nPhysical Requirements\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodation may be made to enable otherwise qualified individuals with disabilities to perform the essential job functions.\nAbility to sit for extended periods of time.\nAbility to read, write, speak, hear; stand; walk; use hands to finger, handle, or feel; reach and lift with hands and arms frequently throughout the day.\nRequired to occasionally lift, push, pull and/or move up to 10 pounds and occasionally required to lift, push, pull and/or move up to 35 pounds.\nWork Environment\nThe work environment is primarily an automated manufacturing plant with a concrete floor and is characterized by some temperature extremes, moderate noise, and forklift traffic. The individual must be able to perform all essential functions as appropriate on the plant floor, in meetings, and with employees, management, customers and suppliers.\nCandidate must perform the essential duties and responsibilities with or without reasonable accommodation efficiently and accurately, and without causing significant safety threat to self or others. The statements made herein are intended to describe the general nature and level of work being performed by employees assigned to this job classification. They are not intended to be construed as an exhaustive and inclusive list of all responsibilities, duties, and/or skills required of personnel so classified.\nGo back\nApply\nShare this job\nEmail\nFacebook\nX\nWeChat\nWhatsApp\nLinkedIn",
        "application_url": "https://jobs.aesc-group.com/en_US/careers/Login?jobId=970&recommendation=&source=&tags=&user=&formValues=",
        "": {},
        "metadata": {
            "Job Title": "Manager, Commercial Contract",
            "Ref #": "P1008517",
            "Employment Type": "Permanent",
            "Department": "Sales",
            "Position level": "Analyst",
            "Date": "Friday, December 19, 2025",
            "AESC Office Location": "Santa Clara, California USA"
        },
        "link": "https://jobs.aesc-group.com/en_US/careers/JobDetail/Santa-Clara-California-United-States-Manager-Commercial-Contract/970"
    },
    {
        "title": "Environmental Health & Safety Engineer",
        "description_html": null,
        "description_text": "General information\nJob Title\nEnvironmental Health & Safety Engineer\nRef #\nP1008419\nEmployment Type\nPermanent\nDepartment\nEnvironmental Health and Safety\nPosition level\nEngineer\nDate\nMonday, November 24, 2025\nAESC Office Location\nFlorence, South Carolina USA\nDescription & Requirements\nJob Description\nAESC is looking to add a Engineer 3 Environmental, Health and Safety to our team in Florence, SC, supporting Columbia, SC 50/50 split.\nFull-Time\nOn-site\nAbout AESC US LLC\nAESC is a global leader in the development and manufacturing of high-performance batteries for zero-emission electric vehicles and energy storage systems. Founded in Japan in 2007 and headquartered in Yokohama, AESC has been building manufacturing capabilities around the world in the U.S., U.K., Europe, Japan and China to serve key markets and leading customers locally for over 14 years. Today, AESC has become the partner of choice for the world’s leading OEMs and energy storage providers in North America, Europe, and Asia. Its advanced technology powers over one million electric vehicles and provides more than 15GWh of installed capacity for battery energy systems in over 60 countries.\nAESC is expanding its footprint in the United States with gigafactories in Kentucky, South Carolina, and Tennessee to meet the growing demand for EV and BESS batteries and strengthen its presence in the North American market. AESC's Tennessee gigafactory in Smyrna, which has been operational since 2012, produces batteries for Nissan. The Kentucky gigafactory in Bowling Green will supply Mercedes-Benz with high-performance battery cell modules. The South Carolina gigafactory in Florence will supply technology-leading battery cells for new electric models produced in BMW Group's Spartanburg plant. AESC is committed to our local communities where it is making its investments, creating jobs, and supporting local charities.\nAbout the Role\nAs a key member of AESC US LLC, the EHS Engineer (Level 3) will play a crucial role in advancing our mission to lead in full-value-chain battery solutions for a sustainable future. Reporting to the EHS Manager, you will be responsible for developing and implementing procedures, guidelines and recommending equipment to promote and ensure industrial safety and health.\nYour work within the EHS team will directly impact our strategic goals and contribute to our position as a global leader in battery technology.\nWhat You Will Do\nSupport the Development, Implementation, and Execution of MDS safety policies, requirements, and programs\nMaintain Safety Records\nReview documents tverify compliance with Safety Policies and requirements\nMaintain Hazard Tracking System data\nSupport System Safety Risk Identification and Management Processes\nEvaluate Safety documentation, system design, and baseline changes\nReview Program-level system safety assessment reports for completeness, technical accuracy and assessment of safety risk\nReview verification evidence and provide an assessment of whether safety specifications, hazard mitigations, and requirements are met\nConduct Program Reviews and Meetings\nAttend and support system-level design reviews and assessing changes throughout the life cycle of the Programs/Project\nSupport design and test reviews, change and failure review boards, and technical interchange meetings to identify and characterize risks\nSupport milestone reviews including Preliminary Design Reviews (PDR), Critical Design Reviews (CDR), Test Readiness Reviews (TRR)\nAssist in the tracking and closure of safety-related action items assigned during program reviews/meetings\nConduct Safety Audits and report deficiencies identified in the audits related to the implementation of and compliance with safety policies\nPerform safety audit follow-ups, track findings, and verify closure within the guidelines identified\nParticipate in the development and review of safety risk assessments and other safety analysis and assist in obtaining approval from the appropriate authority\nDevelop work instructions related tEHS\nSupport Safe Conduct System Demonstration Activities\nEvaluate mission-specific safety risks, particularly for the interaction of the test event with other systems\nAssess test architecture for safety concerns and review test plans and procedures for safety concerns\nSupport the development of Final Hazard Classification (FHC) detailed plans\nParticipate in pre-test reviews, such as Test Planning Reviews (TPRs)\nParticipate in daily status briefings\nParticipate in Failure Reviews and Mishap Investigations\nDevelop and publish Hazard Classification Documentation\nComplete Department of Transportation documentation in accordance with Federal Regulations\nComplete other duties as assigned\nQualifications\nWhat You Need\nBachelor’s degree in safety engineering, industrial technology, or a related field\n5 years of related experience at a professional level is required\nWorking knowledge of Statistics and related Improvement Processes\nAbility to identify unsafe situations or potentially unsafe safety laws\nStrong knowledge of applicable Occupational Safety and Health Administration (OSHA) standards\nKnowledge of PSM (Process Safety) and RMP (Risk Management) processes\nEffective Problem-Solving/Root Cause Analysis\nAbility to work cross-functionally with staff in all departments\nExperience working and leading a team across cultural and discipline boundaries\nExperience or willingness to work in a global context, with an understanding of the challenges and opportunities associated with operating in diverse international markets\nProven ability to thrive in a fast-paced and evolving environment, demonstrating flexibility and adaptability to meet changing business needs and priorities\nProficient skills in Microsoft Office applications and conferencing systems\nUnderstands and follows all standards of IATF16949 and VDA 6.3 quality standards. (training and awareness will be provided for those who are not familiar with these standards)\nUnderstands and follows all standards of ISO14001 environmental standards. (training and awareness will be provided for those who are not familiar with these standards)\nUnderstands and follows all standards of IATF16949 and VDA 6.3 quality standards. (training and awareness will be provided for those who are not familiar with these standards)\nUnderstands and follows all standards of ISO14001 environmental standards. (training and awareness will be provided for those who are not familiar with these standards)\nWhat is “Nice to Have”?\nCertified Safety Professional status\nKnowledge of battery manufacturing, EV manufacturing, or refinery operations\nAutomotive OEM or Tier 1 supplier experience\nNew model experience and equipment design, installation, and commissioning\nPrevious EHS experience in a battery manufacturing facility is highly preferred\nHigh-volume manufacturing environment experience\nStart-up experience\nTravel\nOccasional domestic and international travel required.\nWhat We Offer\nWelcome to AESC, where you'll have the opportunity to tackle the world's most fascinating challenges alongside exceptionally talented individuals who are driven to make a difference. We strive to ensure that our employees are well taken care of, enabling them to focus on their work and contribute to our collective mission.\nWe offer:\n•\nComprehensive compensation packages including a competitive salary and a rewarding bonus program.\n•\nAn inclusive and diverse work environment that fosters and encourages professional and personal development.\n•\nHighly automated, clean, safe, and temperature-controlled production environment\n•\nMedical, Dental and Vision Insurance\n•\nHSA and Flexible Spending Accounts\n•\n401K with company match\n•\nLife Insurance (Company paid and additional voluntary life available)\n•\nPaid Vacation and 14 Paid Holidays\n•\nShort term and long-term disability coverage (Company Paid)\n•\nTuition reimbursement\nApplication Process\nEven if you don't meet every requirement, we encourage you to apply. Your application allows us to learn more about you and find potential fits within our team. We strive to respond to all applicants promptly, though times may vary with submission volume. If you don't receive an immediate response, it doesn't reflect on your candidacy; we'll keep your application for future opportunities. Thank you for your patience and enthusiasm as we improve our application process.\nEqual Employment Opportunity\nAt AESC, we are committed to providing Equal Employment Opportunity (EEO) to all individuals. We participate in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S Join us in our passion to design, manufacture, and sell high-performance products, contributing to a sustainable and zero-carbon emission future.\nPhysical Requirements\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodation may be made to enable otherwise qualified individuals with disabilities to perform the essential job functions.\n•\nAbility to sit for extended periods of time.\n•\nAbility to read, write, speak, hear; stand; walk; use hands to finger, handle, or feel; reach and lift with hands and arms frequently throughout the day.\n•\nRequired to occasionally lift, push, pull and/or move up to 10 pounds and occasionally required to lift, push, pull and/or move up to 35 pounds.\nWork Environment\nThe work environment is primarily an automated manufacturing plant with a concrete floor and is characterized by some temperature extremes, moderate noise, and forklift traffic. The individual must be able to perform all essential functions as appropriate on the plant floor, in meetings, and with employees, management, customers and suppliers.\nCandidate must perform the essential duties and responsibilities with or without reasonable accommodation efficiently and accurately, and without causing significant safety threat to self or others. The statements made herein are intended to describe the general nature and level of work being performed by employees assigned to this job classification. They are not intended to be construed as an exhaustive and inclusive list of all responsibilities, duties, and/or skills required of personnel so classified.\nHiring is contingent upon successful completion of drug screen and background check. AESC US LLC is a drug-free workplace.\nGo back\nApply\nShare this job\nEmail\nFacebook\nX\nWeChat\nWhatsApp\nLinkedIn",
        "application_url": "https://jobs.aesc-group.com/en_US/careers/Login?jobId=959&recommendation=&source=&tags=&user=&formValues=",
        "": {},
        "metadata": {
            "Job Title": "Environmental Health & Safety Engineer",
            "Ref #": "P1008419",
            "Employment Type": "Permanent",
            "Department": "Environmental Health and Safety",
            "Position level": "Engineer",
            "Date": "Monday, November 24, 2025",
            "AESC Office Location": "Florence, South Carolina USA"
        },
        "link": "https://jobs.aesc-group.com/en_US/careers/JobDetail/Florence-South-Carolina-United-States-Environmental-Health-Safety-Engineer/959"
    },
    {
        "title": "Superviseur Maintenance (H/F)",
        "description_html": null,
        "description_text": "General information\nJob Title\nSuperviseur Maintenance (H/F)\nRef #\n20001481\nEmployment Type\nPermanent\nDepartment\nHuman Resources\nPosition level\nManager\nDate\nMonday, November 3, 2025\nAESC Office Location\nDouai, Hauts-de-France, France\nDescription & Requirements\nJob Description\nRejoignez AESC et prenez part à la révolution de la mobilité électrique !\nEn tant que\nSuperviseur Maintenance\n, vous êtes le véritable chef d’orchestre des opérations d’entretien et de fiabilisation des équipements de votre secteur. Garant de la performance, de la sécurité et de la disponibilité des lignes, vous veillez à ce que chaque intervention contribue à la fiabilité et à l’excellence industrielle d’AESC. Vous managez une équipe d'une 40 aine de salariés en horaires postés 4*12.\nVos missions principales\n💡 Piloter et animer vos équipes\nManager et planifier les activités de maintenance (préventive, curative, améliorative).\nAccompagner techniquement les techniciens dans la remise en service des équipements.\nSuivre et développer les compétences de vos équipes (formation, entretiens annuels et disciplinaires).\n📊 Garantir la performance et la fiabilité des installations\nSuivre et analyser les indicateurs clés (OEE, MTBF, MTTR, taux de réalisation des préventifs).\nAssurer la qualité et la pertinence des procédures et standards du département.\nContribuer activement aux démarches d’amélioration continue et à la résolution de problèmes.\n🔧 Assurer la disponibilité et la conformité des équipements\nSuperviser les opérations d’inspection, de maintenance préventive et curative, dans le strict respect des règles de sécurité et environnementales.\nCollecter, analyser et partager les informations liées aux pannes et incidents.\nPromouvoir la bonne utilisation de la GMAO/EAM.\n? Être un acteur clé de la culture AESC\nPromouvoir une culture sécurité forte — la sécurité est notre priorité numéro une.\nParticiper aux QRQC (Qualité avec Réponse Rapide) et piloter les plans d’actions correctifs.\nAnimer la démarche 5S et garantir un environnement de travail propre, organisé et efficace.\nAppliquer et faire respecter les politiques et procédures de l’entreprise.\nCe que nous recherchons\nUne expérience confirmée en management d’équipes de maintenance dans un environnement industriel exigeant (idéalement automatisé ou électromécanique).\nUne forte culture sécurité, qualité et performance.\nUn leadership naturel, orienté terrain et développement des collaborateurs.\nUne réelle appétence pour l’amélioration continue et les environnements technologiques de pointe.\nPourquoi rejoindre AESC ?\nParticiper à un projet industriel d’envergure mondiale au cœur de la transition énergétique.\nÉvoluer dans un environnement high-tech, stimulant et en pleine croissance.\nBénéficier d’un parcours d’intégration et de développement valorisant vos compétences.\nRejoindre une entreprise où la sécurité, l’innovation et la collaboration sont des valeurs fortes.\nMutuelle 100% prise en charge par l'entreprise pour le salarié\nhoraires actuels 4*12 contrat 40h cadre\nRequirements / Required skills\nElectrical Maintenance\nQualifications\nCompétences techniques requises:\n- Pneumatique/Hydraulique/Mécanique : Capacité à lire des schémas/plans, à comprendre les concepts de puissance des fluides/ la logique d’assemblage.\n· Maintenance électrique : capacité à lire des plans et à comprendre les installations\n· Automates programmables (PLC) : notions d’automatismes\n· Robotique : Compréhension du fonctionnement et des processus\n· Connaissance du process général d’une gigafactory\n· Connaissance avancée de l'outil GMAO/EAM\n· Planification d’activités et des arrêts techniques en accord avec la production\n· Maîtrise de la suite Office et des logiciels de bureautique de base\n· Capacité à utiliser efficacement les logiciels à disposition pour saisir des données et référencer des pièces\n· Maitrise des outils de résolution de problème\n· Capacité à remplacer son manager de façon ponctuelle, à la demande de celui-ci\nLes savoir être:\n· Vigilance et attention particulière lors des activités réalisées avec pour priorité d’éviter de se blesser et/ou de blesser les autres\n· Capacité à manager des équipes\n· Autonome, rigoureux et bienveillant\n· Capacité de communication écrite et verbale\n· Capacité de résolution de problèmes au travers d’outils méthodologiques\n· Capacité à travailler sous pression et à respecter les délais\n· Capacité à travailler en équipe\n· Capacité de pédagogie\nEXIGENCES DU POSTE\n· Diplôme de BTS ou DUT à dominante technique ou équivalent avec expérience éprouvée\n· Master à dominante technique ou équivalent avec expérience éprouvée\n· Mobilité nationale et/ou internationale ponctuelle\n· Respect des règles de confidentialité\n· Anglais avancé (niveau B2 écrit et oral souhaité)\n#LI-EO1\nGo back\nApply\nShare this job\nEmail\nFacebook\nX\nWeChat\nWhatsApp\nLinkedIn",
        "application_url": "https://jobs.aesc-group.com/en_US/careers/Login?jobId=939&recommendation=&source=&tags=&user=&formValues=",
        "": {},
        "metadata": {
            "Job Title": "Superviseur Maintenance (H/F)",
            "Ref #": "20001481",
            "Employment Type": "Permanent",
            "Department": "Human Resources",
            "Position level": "Manager",
            "Date": "Monday, November 3, 2025",
            "AESC Office Location": "Douai, Hauts-de-France, France"
        },
        "link": "https://jobs.aesc-group.com/en_US/careers/JobDetail/LAMBRES-LEZ-DOUAI-France-Superviseur-Maintenance-H-F/939"
    },
    {
        "title": "Associate General Counsel",
        "description_html": null,
        "description_text": "General information\nJob Title\nAssociate General Counsel\nRef #\n20000757\nEmployment Type\nPermanent\nDepartment\nLegal\nPosition level\nSpecialist\nDate\nSaturday, November 1, 2025\nAESC Office Location\nMurfreesboro, Tennessee USA\nDescription & Requirements\nJob Description\nAESC is looking to add a Associate General Counsel to our team in Murfreesboro, TN.\n•\nFull-Time\n•\nHybrid/On-site\nAbout AESC US LLC\nAESC is a global leader in the development and manufacturing of high-performance batteries for zero-emission electric vehicles and energy storage systems. Founded in Japan in 2007 and headquartered in Yokohama, AESC has been building manufacturing capabilities around the world in the U.S., U.K., Europe, Japan and China to serve key markets and leading customers locally for over 14 years. Today, AESC has become the partner of choice for the world’s leading OEMs and energy storage providers in North America, Europe, and Asia. Its advanced technology powers over one million electric vehicles and provides more than 15GWh of installed capacity for battery energy systems in over 60 countries.\nAESC is expanding its footprint in the United States with gigafactories in Kentucky, South Carolina, and Tennessee to meet the growing demand for EV and BESS batteries and strengthen its presence in the North American market. AESC's Tennessee gigafactory in Smyrna, which has been operational and supplying electric vehicle batteries for the Nissan LEAF since 2012, was retooled in 2025 and now produces batteries for Energy Storage Systems. The South Carolina gigafactory in Florence will supply next generation cells for BMW starting in 2026. The Kentucky gigafactory in Bowling Green will supply high-performance batteries and components for other OEMs. AESC is committed to our local communities where it is making its investments, creating jobs, and supporting local charities.\nAbout the Role\nAs the Associate General Counsel at AESC, you will play a key role in shaping the legal structure and supporting the company’s growth and compliance. You will work closely with the General Counsel Americas and other legal leaders to develop legal strategies, manage large-scale legal projects, and oversee the drafting, negotiation, and review of key contracts and agreements. This position requires a deep understanding of legal risk management, commercial law, and regulatory compliance while fostering scalable legal processes within a fast-paced, dynamic environment.\nWhat You Will Do\nLegal Strategy and Structure:\nCollaborate with the General Counsel and other legal leaders to develop the foundational structures for a robust legal function.\nEstablish processes and procedures for managing legal projects and daily operations to ensure efficiency and compliance.\nContract Drafting and Negotiation:\nServe as a primary legal advisor to review, draft, and negotiate key commercial agreements, including master services agreements, EPC contracts, vendor agreements, and other contractual documents.\nEnsure all contracts comply with relevant laws, regulations, and internal policies, and analyze legal terms to mitigate risks.\nCompliance and Risk Management:\nProvide counsel on legal and regulatory compliance issues and work to ensure adherence to internal policies and external legal requirements.\nIdentify and creatively solve legal and contractual risks while advising internal teams on various legal questions and long-term projects.\nProject Management and Leadership:\nLead and manage large-scale legal projects on critical issues facing the organization.\nSupervise and mentor junior legal professionals, helping them develop professionally and ensuring their work aligns with company goals.\nProcess Improvement:\nImplement scalable contracting processes to streamline the legal function and improve operational efficiency.\nCollaborate with internal teams across sales, compliance, finance, and operations to provide legal guidance on projects and daily operations.\nComplete other duties as assigned\nWhat You Need\nEducational Background:\n·\nJ.D. from an ABA-accredited law school is required.\n·\nMust be a member in good standing of a state bar, enabling independent legal practice.\nExperience:\n·\nAt least 5 years of legal experience in a law firm, in-house legal department, or equivalent setting.\n·\nExtensive experience in reviewing, drafting, and negotiating commercial agreements and contracts.\nSkills:\n·\nStrong organizational, analytical, and drafting skills with great attention to detail.\n·\nAbility to work independently with sound problem-solving skills and a proactive approach.\n·\nExceptional communication skills, both written and oral, with the ability to collaborate effectively with cross-functional teams.\n·\nAbility to manage and prioritize multiple tasks in a fast-paced environment.\no\nUnderstands and follows all standards of IATF16949 and VDA 6.3 quality standards. (training and awareness will be provided for those who are not familiar with these standards)\no\nUnderstands and follows all standards of ISO14001 environmental standards. (training and awareness will be provided for those who are not familiar with these standards)\n·\nUnderstands and follows all standards of IATF16949 and VDA 6.3 quality standards. (training and awareness will be provided for those who are not familiar with these standards)\n·\nUnderstands and follows all standards of ISO14001 environmental standards. (training and awareness will be provided for those who are not familiar with these standards)\nWhat is “Nice to Have”?\nLeadership Experience:\n·\nPrior experience managing junior legal professionals or teams in a legal setting.\nIndustry Knowledge:\n·\nExperience working in the energy, manufacturing, or technology sectors, with a focus on commercial and regulatory issues.\nProject Management:\n·\nDemonstrated success in managing large-scale legal projects and cross-functional initiatives.\nProcess Improvement:\n·\nFamiliarity with legal process automation and the implementation of scalable legal workflows.\nIndustry Knowledge:\n·\nExperience in a high-volume manufacturing environment, particularly in automotive or battery production, is advantageous.\nStartup Experience:\n·\nExperience in a startup or rapidly growing environment, demonstrating adaptability to change and the ability to work in a dynamic setting.\nTravel\nOccasional domestic and international travel required.\nWhat We Offer\nWelcome to AESC, where you'll have the opportunity to tackle the world's most fascinating challenges alongside exceptionally talented individuals who are driven to make a difference. We strive to ensure that our employees are well taken care of, enabling them to focus on their work and contribute to our collective mission.\nWe offer:\n•\nComprehensive compensation packages including a competitive salary and a rewarding bonus program.\n•\nAn inclusive and diverse work environment that fosters and encourages professional and personal development.\n•\nHighly automated, clean, safe, and temperature-controlled production environment\n•\nMedical, Dental and Vision Insurance\n•\nHSA and Flexible Spending Accounts\n•\n401K with company match\n•\nLife Insurance (Company paid and additional voluntary life available)\n•\nPaid Vacation and 14 Paid Holidays\n•\nShort term and long-term disability coverage (Company Paid)\n•\nTuition reimbursement\nApplication Process\nEven if you don't meet every requirement, we encourage you to apply. Your application allows us to learn more about you and find potential fits within our team. We strive to respond to all applicants promptly, though times may vary with submission volume. If you don't receive an immediate response, it doesn't reflect on your candidacy; we'll keep your application for future opportunities. Thank you for your patience and enthusiasm as we improve our application process.\nEqual Employment Opportunity\nAt AESC, we are committed to providing Equal Employment Opportunity (EEO) to all individuals. We participate in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S Join us in our passion to design, manufacture, and sell high-performance products, contributing to a sustainable and zero-carbon emission future.\nPhysical Requirements\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodation may be made to enable otherwise qualified individuals with disabilities to perform the essential job functions.\n•\nAbility to sit for extended periods of time.\n•\nAbility to read, write, speak, hear; stand; walk; use hands to finger, handle, or feel; reach and lift with hands and arms frequently throughout the day.\n•\nRequired to occasionally lift, push, pull and/or move up to 10 pounds and occasionally required to lift, push, pull and/or move up to 35 pounds.\nWork Environment\nThe work environment is primarily an automated manufacturing plant with a concrete floor and is characterized by some temperature extremes, moderate noise, and forklift traffic. The individual must be able to perform all essential functions as appropriate on the plant floor, in meetings, and with employees, management, customers and suppliers.\nCandidate must perform the essential duties and responsibilities with or without reasonable accommodation efficiently and accurately, and without causing significant safety threat to self or others. The statements made herein are intended to describe the general nature and level of work being performed by employees assigned to this job classification. They are not intended to be construed as an exhaustive and inclusive list of all responsibilities, duties, and/or skills required of personnel so classified.\nHiring is contingent upon successful completion of drug screen and background check. AESC US LLC is a drug-free workplace.\nQualifications\nWhat You Need\nEducational Background:\n·\nJ.D. from an ABA-accredited law school is required.\n·\nMust be a member in good standing of a state bar, enabling independent legal practice.\nExperience:\n·\nAt least 5 years of legal experience in a law firm, in-house legal department, or equivalent setting.\n·\nExtensive experience in reviewing, drafting, and negotiating commercial agreements and contracts.\nSkills:\n·\nStrong organizational, analytical, and drafting skills with great attention to detail.\n·\nAbility to work independently with sound problem-solving skills and a proactive approach.\n·\nExceptional communication skills, both written and oral, with the ability to collaborate effectively with cross-functional teams.\n·\nAbility to manage and prioritize multiple tasks in a fast-paced environment.\no\nUnderstands and follows all standards of IATF16949 and VDA 6.3 quality standards. (training and awareness will be provided for those who are not familiar with these standards)\no\nUnderstands and follows all standards of ISO14001 environmental standards. (training and awareness will be provided for those who are not familiar with these standards)\n·\nUnderstands and follows all standards of IATF16949 and VDA 6.3 quality standards. (training and awareness will be provided for those who are not familiar with these standards)\n·\nUnderstands and follows all standards of ISO14001 environmental standards. (training and awareness will be provided for those who are not familiar with these standards)\nWhat is “Nice to Have”?\nLeadership Experience:\n·\nPrior experience managing junior legal professionals or teams in a legal setting.\nIndustry Knowledge:\n·\nExperience working in the energy, manufacturing, or technology sectors, with a focus on commercial and regulatory issues.\nProject Management:\n·\nDemonstrated success in managing large-scale legal projects and cross-functional initiatives.\nProcess Improvement:\n·\nFamiliarity with legal process automation and the implementation of scalable legal workflows.\nIndustry Knowledge:\n·\nExperience in a high-volume manufacturing environment, particularly in automotive or battery production, is advantageous.\nStartup Experience:\n·\nExperience in a startup or rapidly growing environment, demonstrating adaptability to change and the ability to work in a dynamic setting.\nTravel\nOccasional domestic and international travel required.\nWhat We Offer\nWelcome to AESC, where you'll have the opportunity to tackle the world's most fascinating challenges alongside exceptionally talented individuals who are driven to make a difference. We strive to ensure that our employees are well taken care of, enabling them to focus on their work and contribute to our collective mission.\nWe offer:\n•\nComprehensive compensation packages including a competitive salary and a rewarding bonus program.\n•\nAn inclusive and diverse work environment that fosters and encourages professional and personal development.\n•\nHighly automated, clean, safe, and temperature-controlled production environment\n•\nMedical, Dental and Vision Insurance\n•\nHSA and Flexible Spending Accounts\n•\n401K with company match\n•\nLife Insurance (Company paid and additional voluntary life available)\n•\nPaid Vacation and 14 Paid Holidays\n•\nShort term and long-term disability coverage (Company Paid)\n•\nTuition reimbursement\nApplication Process\nEven if you don't meet every requirement, we encourage you to apply. Your application allows us to learn more about you and find potential fits within our team. We strive to respond to all applicants promptly, though times may vary with submission volume. If you don't receive an immediate response, it doesn't reflect on your candidacy; we'll keep your application for future opportunities. Thank you for your patience and enthusiasm as we improve our application process.\nEqual Employment Opportunity\nAt AESC, we are committed to providing Equal Employment Opportunity (EEO) to all individuals. We participate in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S Join us in our passion to design, manufacture, and sell high-performance products, contributing to a sustainable and zero-carbon emission future.\nPhysical Requirements\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodation may be made to enable otherwise qualified individuals with disabilities to perform the essential job functions.\n•\nAbility to sit for extended periods of time.\n•\nAbility to read, write, speak, hear; stand; walk; use hands to finger, handle, or feel; reach and lift with hands and arms frequently throughout the day.\n•\nRequired to occasionally lift, push, pull and/or move up to 10 pounds and occasionally required to lift, push, pull and/or move up to 35 pounds.\nWork Environment\nThe work environment is primarily an automated manufacturing plant with a concrete floor and is characterized by some temperature extremes, moderate noise, and forklift traffic. The individual must be able to perform all essential functions as appropriate on the plant floor, in meetings, and with employees, management, customers and suppliers.\nCandidate must perform the essential duties and responsibilities with or without reasonable accommodation efficiently and accurately, and without causing significant safety threat to self or others. The statements made herein are intended to describe the general nature and level of work being performed by employees assigned to this job classification. They are not intended to be construed as an exhaustive and inclusive list of all responsibilities, duties, and/or skills required of personnel so classified.\nHiring is contingent upon successful completion of drug screen and background check. AESC US LLC is a drug-free workplace.\nGo back\nApply\nShare this job\nEmail\nFacebook\nX\nWeChat\nWhatsApp\nLinkedIn",
        "application_url": "https://jobs.aesc-group.com/en_US/careers/Login?jobId=943&recommendation=&source=&tags=&user=&formValues=",
        "": {},
        "metadata": {
            "Job Title": "Associate General Counsel",
            "Ref #": "20000757",
            "Employment Type": "Permanent",
            "Department": "Legal",
            "Position level": "Specialist",
            "Date": "Saturday, November 1, 2025",
            "AESC Office Location": "Murfreesboro, Tennessee USA"
        },
        "link": "https://jobs.aesc-group.com/en_US/careers/JobDetail/Murfreesboro-Tennessee-United-States-Associate-General-Counsel/943"
    },
    {
        "title": "Ingénieur Contamination",
        "description_html": null,
        "description_text": "General information\nJob Title\nIngénieur Contamination\nRef #\n20001480\nEmployment Type\nPermanent\nDepartment\nEngineering\nPosition level\nEngineer\nDate\nFriday, October 24, 2025\nAESC Office Location\nDouai, Hauts-de-France, France\nDescription & Requirements\nJob Description\nReady to tackle the challenges of environmentally conscious mobility? ♻️\nJoin AESC and become a key player in the development and production of high-performance lithium-ion batteries!\nAESC is recruiting for the Contamination Control Manager position to join our Giga factory project in France. This role will be critical to the successful launch of the facility and will focus on process engineering, delivery, commissioning, and ongoing production support for the dedicated process area.\nThis is an exciting opportunity to contribute to a major European battery project and be part of a significant industrial transformation within the electric vehicle marketplace. The role will be based in Douai.\n#LI-EO1\nQualifications\nKey Responsibilities:\n-  Reduce contamination in the production process by ensuring ramp-up to production volume.\n- Oversee contamination control during ongoing production, providing quick issue resolution, continuous optimization, and root cause analysis.\n- Lead the assessment of equipment in term of contamination\n- Lead process contamination monitoring and problem-solving efforts for contamination-related issues.\n- Optimize dust removal and magnetization processes.\n- Inspect foreign bodies and contamination on-site, promote training for contamination control.\n- Lead the tracking of contamination control plans and optimize cleaning work instructions.\n- Conduct regular contamination audits across the facility and provide support during the ramp-up to mass production.\nRequired Skills:\n- Experience in process engineering with a focus on process control and optimization.\n- Leadership in problem-solving and root cause analysis for complex manufacturing issues.\n- Experience conducting lab-based analysis and operating lab equipment for contamination analysis.\n- Experience investigating product quality through tear-downs or investigations.\n- Strong report writing skills with the ability to drive issues to resolution.\n- Self-motivated, results-driven, and capable of leading teams in cross-functional environments.\nAdvantageous Experience:\n- Previous involvement in battery manufacturing or similar technologies (e.g., high-speed consumer goods, high-speed machining or assembly, printing, web conversion).\n- Background in high-volume, quality-focused environments.\nPrerequisites:\n- Degree in Engineering or a related field.\n- Excellent verbal and written communication skills in English and French\n- Willingness to travel internationally (<10%).\n-Proficiency in Microsoft Excel, PowerPoint, and word processing tools.\nGo back\nApply\nShare this job\nEmail\nFacebook\nX\nWeChat\nWhatsApp\nLinkedIn",
        "application_url": "https://jobs.aesc-group.com/en_US/careers/Login?jobId=934&recommendation=&source=&tags=&user=&formValues=",
        "": {},
        "metadata": {
            "Job Title": "Ingénieur Contamination",
            "Ref #": "20001480",
            "Employment Type": "Permanent",
            "Department": "Engineering",
            "Position level": "Engineer",
            "Date": "Friday, October 24, 2025",
            "AESC Office Location": "Douai, Hauts-de-France, France"
        },
        "link": "https://jobs.aesc-group.com/en_US/careers/JobDetail/DOUAI-France-Ing-nieur-Contamination/934"
    },
    {
        "title": "Senior Counsel",
        "description_html": null,
        "description_text": "General information\nJob Title\nSenior Counsel\nRef #\nP1007974\nEmployment Type\nPermanent\nDepartment\nLegal\nPosition level\nSpecialist\nDate\nThursday, October 23, 2025\nAESC Office Location\nMurfreesboro, Tennessee USA\nDescription & Requirements\nJob Description\nAbout AESC US LLC\nAESC is an exciting, newly created global organization committed to solving the challenges of a sustainable future and becoming the leading supplier of full-value-chain battery solutions. Our lithium-ion batteries can be found in nearly one million electric vehicles worldwide and have a stellar safety record of zero-critical issues. AESC US is leading the way in battery technology. We design and manufacture EV battery technology for various electric vehicles and equipment. We are working hard towards unlocking the full potential of sustainable energy and climate change mitigation. We will continue to build upon our successes and expand into new markets and industries, producing innovative and competitive products and technologies that advance the goal of a zero-carbon emission future. AESC is headquartered in Japan and has battery manufacturing locations in Japan, UK, China, and the U.S.\nAESC Mission\nOur mission is to solve the challenges for a sustainable future. Together, we can make a meaningful impact.\nWhat You Will Do\nThis position reports to General Counsel Americas\nManage large-scale as well as routine legal projects on key substantive legal issues facing the organization.\nServe as a primary lawyer to review, draft, and negotiate customer and supply side commercial agreements, such as supply agreements, master services agreements, EPC and vendor agreements and other contracts.\nAnalyze, revise, and negotiate contractual provisions to facilitate the needs of the business as well as compliance with appropriate laws, regulations, as well as company policies and procedures.\nIdentify and solve legal and contractual risks with a focus on organizational profitability.\nAdvise internal sales, purchasing, trade, financial, and operations personnel on daily questions and long-term projects.\nImplement scalable contracting processes.\nWork with and supervise the work of junior legal professionals.\nPerform other related duties as required.\nWhat You Need\nAt least 5 years' experience in a law firm, in-house legal department, or equivalent setting.\nJ.D. from an ABA accredited law school.\nMember in good standing of a state bar such that legal work may be performed independently.\nExceptional organizational, analytical, and drafting skills with great attention to detail.\nStrong team player with a positive attitude and desire to work collectively to achieve team and company goals.\nAbility to work and think independently, possessing sound, creative problem-solving skills.\nResponsive, client-service focused, and professional.\nWilling to accept additional responsibility, challenging tasks, and/or projects.\nAble to flexibly react to multiple and shifting priorities.\nStrong communication (written and oral) and interpersonal skills.\nHigh achieving, win-focused, inquisitive nature.\nUnderstanding of how to practice law in a commercial setting as well as the rigors of the manufacturing environment.\nDesire to learn, grow, and promote continuous improvement in the legal department.\nStrong work ethic and sense of ownership and proactivity.\nAbility to work positively in an international work environment.\nWhat is “Nice to Have”?\nTennessee bar admission is highly valued; Bar admission(s) in South Carolina and/or Kentucky are also useful\nForeign language fluency, especially in East Asian languages\nSpecialized legal ability to lead in a subject matter without sacrificing flexibility to be a generalist\nExperience leading the implementation of legal technology\nWhat We Offer\nWelcome to AESC, supporting our state-of-the-art Gigafactories, where you'll have the opportunity to tackle the world's most fascinating challenges alongside exceptionally talented individuals who are driven to make a difference. At AESC, we offer a comprehensive compensation package. In addition, we provide a range of valuable benefits, such as 401K,\nand health insurance. We strive to ensure that our employees are well taken care of, enabling them to focus on their work and contribute to our collective mission of changing the world.\nAn inclusive and diverse work environment that fosters and encourages professional and personal development.\nHighly automated, clean, safe, and temperature-controlled production environment\nMedical, Dental and Vision Insurance\nHSA and Flexible Spending Accounts\n401K with company match\nLife Insurance (Company paid and additional voluntary life available)\nPaid Vacation and 14 Paid Holidays\nShort term and long-term disability coverage (Company Paid)\nTuition reimbursement\nApplication Process\nEven if you don't meet every requirement listed, if you believe this role suits you well, we encourage you to apply. Your application gives us the opportunity to learn more about you and explore potential fits within our team.\nFollowing the submission of your application, we are committed to providing timely responses to all applicants, though response times may vary depending on the volume of submissions. If you do not receive an immediate response, please rest assured that this in no way reflects on the quality of your candidacy. Your application will be retained in our files, and we may reach out to you for future roles that align with your skills and interests. As our organization experiences rapid growth, we appreciate your patience in this process. We are actively working each day to enhance our application procedures to ensure a smoother and more efficient experience for all applicants. Thank you for your understanding and enthusiasm for joining our dynamic team.\nEqual Employment Opportunity\nAt AESC, we are committed to providing Equal Employment Opportunity (EEO) to all individuals. We participate in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S Join us in our passion to design, manufacture, and sell high-performance products, contributing to a sustainable and zero-carbon emission future.\nPhysical Requirements\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodation may be made to enable otherwise qualified individuals with disabilities to perform the essential job functions.\nAbility to sit for extended periods of time.\nAbility to read, write, speak, hear; stand; walk; use hands to finger, handle, or feel; reach and lift with hands and arms frequently throughout the day.\nWork Environment\nThe individual must be able to perform all essential functions as appropriate on the plant floor, in meetings, and with employees, management, customers and suppliers.\nCandidate must perform the essential duties and responsibilities with or without reasonable accommodation efficiently and accurately, and without causing significant safety threat to self or others. The statements made herein are intended to describe the general nature and level of work being performed by employees assigned to this job classification. They are not intended to be construed as an exhaustive and inclusive list of all responsibilities, duties, and/or skills required of personnel so classified.\nQualifications\nWhat You Need\nAt least 5 years' experience in a law firm, in-house legal department, or equivalent setting.\nJ.D. from an ABA accredited law school.\nMember in good standing of a state bar such that legal work may be performed independently.\nExceptional organizational, analytical, and drafting skills with great attention to detail.\nStrong team player with a positive attitude and desire to work collectively to achieve team and company goals.\nAbility to work and think independently, possessing sound, creative problem-solving skills.\nResponsive, client-service focused, and professional.\nWilling to accept additional responsibility, challenging tasks, and/or projects.\nAble to flexibly react to multiple and shifting priorities.\nStrong communication (written and oral) and interpersonal skills.\nHigh achieving, win-focused, inquisitive nature.\nUnderstanding of how to practice law in a commercial setting as well as the rigors of the manufacturing environment.\nDesire to learn, grow, and promote continuous improvement in the legal department.\nStrong work ethic and sense of ownership and proactivity.\nAbility to work positively in an international work environment.\nWhat is “Nice to Have”?\nTennessee bar admission is highly valued; Bar admission(s) in South Carolina and/or Kentucky are also useful\nForeign language fluency, especially in East Asian languages\nSpecialized legal ability to lead in a subject matter without sacrificing flexibility to be a generalist\nExperience leading the implementation of legal technology\nWhat We Offer\nWelcome to AESC, supporting our state-of-the-art Gigafactories, where you'll have the opportunity to tackle the world's most fascinating challenges alongside exceptionally talented individuals who are driven to make a difference. At AESC, we offer a comprehensive compensation package. In addition, we provide a range of valuable benefits, such as 401K,\nand health insurance. We strive to ensure that our employees are well taken care of, enabling them to focus on their work and contribute to our collective mission of changing the world.\nAn inclusive and diverse work environment that fosters and encourages professional and personal development.\nHighly automated, clean, safe, and temperature-controlled production environment\nMedical, Dental and Vision Insurance\nHSA and Flexible Spending Accounts\n401K with company match\nLife Insurance (Company paid and additional voluntary life available)\nPaid Vacation and 14 Paid Holidays\nShort term and long-term disability coverage (Company Paid)\nTuition reimbursement\nApplication Process\nEven if you don't meet every requirement listed, if you believe this role suits you well, we encourage you to apply. Your application gives us the opportunity to learn more about you and explore potential fits within our team.\nFollowing the submission of your application, we are committed to providing timely responses to all applicants, though response times may vary depending on the volume of submissions. If you do not receive an immediate response, please rest assured that this in no way reflects on the quality of your candidacy. Your application will be retained in our files, and we may reach out to you for future roles that align with your skills and interests. As our organization experiences rapid growth, we appreciate your patience in this process. We are actively working each day to enhance our application procedures to ensure a smoother and more efficient experience for all applicants. Thank you for your understanding and enthusiasm for joining our dynamic team.\nEqual Employment Opportunity\nAt AESC, we are committed to providing Equal Employment Opportunity (EEO) to all individuals. We participate in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S Join us in our passion to design, manufacture, and sell high-performance products, contributing to a sustainable and zero-carbon emission future.\nPhysical Requirements\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodation may be made to enable otherwise qualified individuals with disabilities to perform the essential job functions.\nAbility to sit for extended periods of time.\nAbility to read, write, speak, hear; stand; walk; use hands to finger, handle, or feel; reach and lift with hands and arms frequently throughout the day.\nWork Environment\nThe individual must be able to perform all essential functions as appropriate on the plant floor, in meetings, and with employees, management, customers and suppliers.\nCandidate must perform the essential duties and responsibilities with or without reasonable accommodation efficiently and accurately, and without causing significant safety threat to self or others. The statements made herein are intended to describe the general nature and level of work being performed by employees assigned to this job classification. They are not intended to be construed as an exhaustive and inclusive list of all responsibilities, duties, and/or skills required of personnel so classified.\nGo back\nApply\nShare this job\nEmail\nFacebook\nX\nWeChat\nWhatsApp\nLinkedIn",
        "application_url": "https://jobs.aesc-group.com/en_US/careers/Login?jobId=933&recommendation=&source=&tags=&user=&formValues=",
        "": {},
        "metadata": {
            "Job Title": "Senior Counsel",
            "Ref #": "P1007974",
            "Employment Type": "Permanent",
            "Department": "Legal",
            "Position level": "Specialist",
            "Date": "Thursday, October 23, 2025",
            "AESC Office Location": "Murfreesboro, Tennessee USA"
        },
        "link": "https://jobs.aesc-group.com/en_US/careers/JobDetail/Murfreesboro-Tennessee-United-States-Senior-Counsel/933"
    },
    {
        "title": "Coordinateur HSE (H/F)",
        "description_html": null,
        "description_text": "General information\nJob Title\nCoordinateur HSE (H/F)\nRef #\nP1007533\nEmployment Type\nPermanent\nDepartment\nEnvironmental Health and Safety\nPosition level\nTechnician\nDate\nWednesday, October 1, 2025\nAESC Office Location\nDouai, Hauts-de-France, France\nDescription & Requirements\nJob Description\nMettre en œuvre des actions via la politique de sécurité, d'hygiène et de respect de l'environnement\nConcevoir et suivre les indicateurs\nInstaurer et coordonner système de management en Santé et Sécurité au Travail (SST).\nDéployer la politique de sécurité pour limiter les accidents de travail, les maladies professionnelles et préserver la santé des collaborateurs.\nDéployer la politique environnementale\nPrévenir les risques professionnels et environnementaux\nAssurer des conditions de travail optimales pour les salariés et garantir le respect des consignes de sécurité sur les chantiers (port obligatoire du casque, chaussures de sécurité, etc.).\nGarantir le respect des normes en vigueur, suivre les mises à jour des décrets réglementaires et les appliquer.\nRéaliser une évaluation des risques professionnels et chimiques en identifiant les risques potentiels et en conduisant des actions de maîtrise des risques.\nMettre à jour le document unique.\nConduire des audits de chantiers.\nParticiper à l'élaboration et au déploiement des Plans de Prévention (PDP)\nAnalyser les accidents du travail\nSuivre les plans d'actions\nQualifications\nConnaissances des normes et procédures de certification\nMaîtrise des réglementations relatives à la santé, à la sécurité et à l'environnement. Vous avez également des compétences avancées en gestion de projet et en résolution de problèmes.\nExpérience en industrie\nExpérience en milieu ATEX et risques chimiques\nBon communicant\nAutonome\nTravail en équipe\nGo back\nApply\nShare this job\nEmail\nFacebook\nX\nWeChat\nWhatsApp\nLinkedIn",
        "application_url": "https://jobs.aesc-group.com/en_US/careers/Login?jobId=907&recommendation=&source=&tags=&user=&formValues=",
        "": {},
        "metadata": {
            "Job Title": "Coordinateur HSE (H/F)",
            "Ref #": "P1007533",
            "Employment Type": "Permanent",
            "Department": "Environmental Health and Safety",
            "Position level": "Technician",
            "Date": "Wednesday, October 1, 2025",
            "AESC Office Location": "Douai, Hauts-de-France, France"
        },
        "link": "https://jobs.aesc-group.com/en_US/careers/JobDetail/Douai-Hauts-de-Seine-France-Coordinateur-HSE-H-F/907"
    },
    {
        "title": "Ingénieur process sénior",
        "description_html": null,
        "description_text": "General information\nJob Title\nIngénieur process sénior\nRef #\nP1005096\nEmployment Type\nPermanent\nDepartment\nEngineering\nPosition level\nExecutive\nDate\nThursday, September 4, 2025\nAESC Office Location\nDouai, Hauts-de-France, France\nDescription & Requirements\nJob Description\n1. Comprendre les exigences techniques et opérationnelles de l'entreprise en termes d'équipements industriels.\n2. Concevoir et planifier l'implantation des équipements industriels en fonction des exigences spécifiques de l'entreprise.\n3. Collaborer avec les fournisseurs pour s'assurer que les équipements sélectionnés répondent aux normes de qualité et de sécurité requises, ainsi qu'aux délais de livraison convenus.\n4. Gérer l'ensemble du processus d'implantation des équipements industriels, en veillant à ce que les délais et les budgets soient respectés. Cela peut impliquer la coordination de différentes équipes internes et externes, ainsi que la résolution de problèmes qui pourraient survenir en cours de route.\n5. Superviser l'installation des équipements sur le site de l'entreprise, en veillant à ce que tout soit mis en place conformément aux spécifications techniques et aux normes de sécurité.\n6. Fournir une formation aux opérateurs et au personnel de maintenance sur l'utilisation et l'entretien des nouveaux équipements afin d'assurer une utilisation efficace et sécurisée.\n7. Collaborer avec les équipes opérationnelles pour identifier et mettre en œuvre des améliorations continues des processus liés à l'utilisation des équipements industriels, afin d'optimiser la productivité et l'efficacité globale de l'entreprise\nQualifications\nSavoir faire :\n- Maîtrise des outils de management\n- Maîtrise de la suite bureautique MS Office\n- Compétences dans la réalisation de dispositions de procédé et de la documentation technique\n- Connaissances avancées des processus de production, des méthodes et technologies de production\n- Compétences en gestion de projet\n- Niveau ingénieur à dominante industrielle avec 10 ans d'expériences dans l'installation d'équipements complexes\n- Anglais professionnel obligatoire (TOEIC 800 minimum)\nSavoir être :\n- Rigueur\n- Autonomie\n- Sens de l'organisation\n- Aisance relationnelle\n- Esprit méthodique\nGo back\nApply\nShare this job\nEmail\nFacebook\nX\nWeChat\nWhatsApp\nLinkedIn",
        "application_url": "https://jobs.aesc-group.com/en_US/careers/Login?jobId=822&recommendation=&source=&tags=&user=&formValues=",
        "": {},
        "metadata": {
            "Job Title": "Ingénieur process sénior",
            "Ref #": "P1005096",
            "Employment Type": "Permanent",
            "Department": "Engineering",
            "Position level": "Executive",
            "Date": "Thursday, September 4, 2025",
            "AESC Office Location": "Douai, Hauts-de-France, France"
        },
        "link": "https://jobs.aesc-group.com/en_US/careers/JobDetail/Douai-Hauts-de-Seine-France-Ing-nieur-process-s-nior/822"
    },
    {
        "title": "EHS Specialist  1-4 (All shifts)",
        "description_html": null,
        "description_text": "General information\nJob Title\nEHS Specialist  1-4 (All shifts)\nRef #\nP1001378\nEmployment Type\nPermanent\nDepartment\nEnvironmental Health and Safety\nPosition level\nSpecialist\nDate\nTuesday, September 2, 2025\nAESC Office Location\nSmyrna, Tennessee USA\nDescription & Requirements\nJob Description\nAbout AESC US LLC\nAESC is a global leader in the development and manufacturing of high-performance batteries for zero-emission electric vehicles and energy storage systems. Founded in Japan in 2007 and headquartered in Yokohama, AESC has been building manufacturing capabilities around the world in the U.S., U.K., Europe, Japan and China to serve key markets and leading customers locally for over 14 years. Today, AESC has become the partner of choice for the world’s leading OEMs and energy storage providers in North America, Europe, and Asia. Its advanced technology powers over one million electric vehicles and provides more than 15GWh of installed capacity for battery energy systems in over 60 countries.\nAESC is expanding its footprint in the United States with gigafactories in Kentucky, South Carolina, and Tennessee to meet the growing demand for EV and BESS batteries and strengthen its presence in the North American market. AESC's Tennessee gigafactory in Smyrna, which has been operational and supplying electric vehicle batteries for the Nissan LEAF since 2012, was retooled in 2025 and now produces batteries for Energy Storage Systems. The South Carolina gigafactory in Florence will supply next generation cells for BMW starting in 2026. The Kentucky gigafactory in Bowling Green will supply high-performance batteries and components for other OEMs. AESC is committed to our local communities where it is making investments, creating jobs, and supporting local charities.\nAbout the Role\nAs the Environmental, Health & Safety Specialist, you will play a critical role in ensuring a safe, compliant, and environmentally responsible workplace at our state-of-the-art battery manufacturing facility. You will collaborate with cross-functional teams to support the development, implementation, and monitoring of EHS programs and initiatives, helping to drive continuous improvement in our gigafactories. You will support the compliance of EHS standards at the local, state, and federal levels, and work to promote a culture of safety and environmental stewardship.\nWhat You Will Do\nEHS Support and Compliance: Provide environmental, health, and safety (EHS) support to plant personnel, ensuring compliance with all applicable environmental, occupational safety, and health regulations.\nEHS Programs: Prepare, update, and maintain written safety, health, and environmental programs and policies, generating applicable metrics for tracking.\nPermit to work (PTW): Serve as the PTW expert, supporting job hazard assessments (JHA), job safety analysis (JSA), risk assessments, and personal protective equipment (PPE) matrix development, as well as auditing permit paperwork for compliance.\nAwareness and Training: Promote EHS awareness by developing and delivering internal company communications, safety training, and specialized EHS programs to the workforce.\nEngineering Collaboration: Support corporate and plant engineering in implementing engineering controls to reduce environmental, safety, and health hazards.\nRegulatory Compliance: Ensure facility compliance with federal, state, and local environmental regulations, covering aspects such as solid waste, hazardous waste, stormwater, air emissions, wastewater, community right-to-know, and petroleum storage.\nIncident Investigation: Review injury/illness reports and non-injury incident investigations, follow up on trends, recommend countermeasures, and support management in action planning.\nSDS Management: Support production areas with submittals of Safety Data Sheets (SDS) to ensure they are electronically maintained in a database to support site compliance with environmental and safety regulations.\nErgonomic Planning: Utilize ergonomic guidelines to address current manufacturing injury concerns and future model planning, contributing to overall employee safety.\nComplete other duties as assigned\nEqual Employment Opportunity\nAt AESC, we are committed to providing Equal Employment Opportunity (EEO) to all individuals. We participate in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S Join us in our passion to design, manufacture, and sell high-performance products, contributing to a sustainable and zero-carbon emission future.\nPhysical Requirements\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodation may be made to enable otherwise qualified individuals with disabilities to perform the essential job functions.\nAbility to sit for extended periods of time.\nAbility to read, write, speak, hear; stand; walk; use hands to finger, handle, or feel; reach and lift with hands and arms frequently throughout the day.\nRequired to occasionally lift, push, pull and/or move up to 10 pounds and occasionally required to lift, push, pull and/or move up to 35 pounds.\nWork Environment\nThe work environment is primarily an automated manufacturing plant with a concrete floor and is characterized by some temperature extremes, moderate noise, and forklift traffic. The individual must be able to perform all essential functions as appropriate on the plant floor, in meetings, and with employees, management, customers and suppliers.\nCandidate must perform the essential duties and responsibilities with or without reasonable accommodation efficiently and accurately, and without causing significant safety threat to self or others. The statements made herein are intended to describe the general nature and level of work being performed by employees assigned to this job classification. They are not intended to be construed as an exhaustive and inclusive list of all responsibilities, duties, and/or skills required of personnel so classified.\nHiring is contingent upon successful completion of drug screen and background check. AESC US LLC is a drug-free workplace.\nQualifications\nWhat You Need\nEducation: Bachelor's degree in safety science, engineering, or industrial engineering discipline is preferred.\nExperience: 2-5 years of experience supporting safety, health, and environmental operations within a manufacturing or production environment.\nTechnical Knowledge:\nLife Safety Design: Familiarity with IBC/IFC/NFPA101 for life safety design requirements.\nTitle V Air Permit: Experience with compliance, conditions, and tracking of CFC inventory logs, RICE MACT generator data logs, and chemical tracking.\nRCRA Compliance: Knowledge of hazardous waste regulations pertaining to Large Quantity Generators (LQGs) and management of hazardous waste tank systems.\nEPCRA Compliance: Knowledge of Tier 2 Reports, Toxic Release Inventory Reports, and other reporting requirements for industrial facilities.\nCross-Functional Collaboration: Proven ability to work cross-functionally with teams in Operations, Maintenance, Logistics, Engineering, and Quality.\nState and Federal Safety Standards: Extensive knowledge of state and federal safety standards and a working knowledge of the company’s manufacturing processes.\nUnderstands and follows all standards of IATF16949 and VDA 6.3 quality standards. (training and awareness will be provided for those who are not familiar with these standards)\nUnderstands and follows all standards of ISO14001 environmental standards. (training and awareness will be provided for those who are not familiar with these standards)\nTravel Requirements\nOccasional domestic travel to other gigafactory locations or regional compliance meetings may be required.\nGo back\nApply\nShare this job\nEmail\nFacebook\nX\nWeChat\nWhatsApp\nLinkedIn",
        "application_url": "https://jobs.aesc-group.com/en_US/careers/Login?jobId=351&recommendation=&source=&tags=&user=&formValues=",
        "": {},
        "metadata": {
            "Job Title": "EHS Specialist  1-4 (All shifts)",
            "Ref #": "P1001378",
            "Employment Type": "Permanent",
            "Department": "Environmental Health and Safety",
            "Position level": "Specialist",
            "Date": "Tuesday, September 2, 2025",
            "AESC Office Location": "Smyrna, Tennessee USA"
        },
        "link": "https://jobs.aesc-group.com/en_US/careers/JobDetail/Smyrna-Tennessee-United-States-EHS-Specialist-1-4-All-shifts/351"
    },
    {
        "title": "Technicien Métrologie",
        "description_html": null,
        "description_text": "General information\nJob Title\nTechnicien Métrologie\nRef #\n20001469\nEmployment Type\nPermanent\nDepartment\nQuality\nPosition level\nTechnician\nDate\nThursday, August 21, 2025\nAESC Office Location\nDouai, Hauts-de-France, France\nDescription & Requirements\nJob Description\nPrêt(e) à relever les défis d’une mobilité plus respectueuse de l’environnement ? Rejoignez AESC et devenez un acteur clé dans le développement et la production de batteries lithium-ion à haute performance !\nEn tant que technicien en métrologie / MSA (Measurement System Analysis), vous serez rattaché(e) au Responsable Métrologue au sein du site de Douai classé SEVESO seuil haut. Nous vous proposons un poste polyvalent qui vous permettra de mettre à profit vos connaissances mais aussi monter en compétences dans un environnement industriel automobile.\nLe technicien MSA a la charge de l’évaluation des systèmes de mesure utilisés dans le cadre du contrôle qualité. Il réalise les études MSA afin de garantir la fiabilité, la répétabilité et la reproductibilité des instruments de mesure utilisés dans les processus de fabrication et de contrôle.\nVos futures missions\n:\nPlanifier, piloter, réaliser et être moteur sur les activités des MSA (Gage R&R, linéarité, biais, stabilité, Cg, Cgk…),\nFaire un suivi des activités de MSA,\nIdentifier les sources de variation dans les systèmes de mesure,\nAnalyser les résultats et rédiger les rapports associés,\nMise à jour des indicateurs MSA,\nProposer des actions correctives en cas de non-conformité du système de mesure,\nCollaborer avec les équipes de Production, Qualité, Ingénieur Process et Métrologie,\nAssurer la mise à jour des documents techniques et procédures internes,\nFormer les opérateurs aux bonnes pratiques de mesure si nécessaire,\nRéaliser les activités liées aux MSA des appareils en respectant les règles d'hygiène et de sécurité lors des interventions, les délais et les procédures en vigueur,\nÊtre force de proposition auprès des ingénieurs process et responsables Qualité pour remonter les problèmes rencontrés,\nContribuer à l'amélioration continue de l'usine.\nQualifications\nQualifications, ce qui vous différencie :\nFormation Bac+2 minimum en mesures physiques, qualité, métrologie ou domaine technique équivalent,\nExpérience en MSA souhaitée,\nMaîtrise des outils qualité (MSA, SPC, AMDEC, etc.),\nConnaissance des normes ISO 9001, IATF 16949 (automobile),\nMaîtrise des logiciels statistiques (Minitab, Excel avec macros, etc.)\nRigueur, autonomie, esprit d’analyse et bon relationnel\nDe formation supérieure de niveau Bac +2 / 3 type Licence en Métrologie. Vous avez au minimum une première expérience réussie sur un poste similaire dans le domaine industriel, idéalement dans l’automobile. Vous avez des connaissances dans les domaines de la métrologie: en étalonnage, vérification, incertitude de mesure, EMT, capabilité, MSA, … Vous avez démontré dans vos expériences, votre esprit d’analyse, votre sens de la communication et une aisance dans le travail collaboratif.\nCompétences particulières recherchées\n:\nExpérience dans l’automobile :\nIATF 16949 / APQP / PPAP / MSA / SPC / PFMEA,\nAMDEC Process\nMaitrise du plan de control.\nMaitrise du suivi des KPI, tableau de bord\nConnaissance des normes IATF/45001/14001/17025.\nAutonome, rigoureux, force de proposition\nConnaissance métrologie analytique et instrumentation\nPossibilité poste en travail posté 3/8\n#LI-EO1\nGo back\nApply\nShare this job\nEmail\nFacebook\nX\nWeChat\nWhatsApp\nLinkedIn",
        "application_url": "https://jobs.aesc-group.com/en_US/careers/Login?jobId=813&recommendation=&source=&tags=&user=&formValues=",
        "": {},
        "metadata": {
            "Job Title": "Technicien Métrologie",
            "Ref #": "20001469",
            "Employment Type": "Permanent",
            "Department": "Quality",
            "Position level": "Technician",
            "Date": "Thursday, August 21, 2025",
            "AESC Office Location": "Douai, Hauts-de-France, France"
        },
        "link": "https://jobs.aesc-group.com/en_US/careers/JobDetail/Lambres-lez-Douai-Nord-France-Technicien-M-trologie/813"
    },
    {
        "title": "Engineer MES",
        "description_html": null,
        "description_text": "General information\nJob Title\nEngineer MES\nRef #\n20001465\nEmployment Type\nPermanent\nDepartment\nInformation Technology\nPosition level\nEngineer\nDate\nTuesday, August 12, 2025\nAESC Office Location\nDouai, Hauts-de-France, France\nDescription & Requirements\nJob Description\nJoin AESC, a global leader in lithium-ion battery technology, and become a key player in the development and production of high-performance batteries.\nAs part of our expansion in France, we are recruiting a MES (Manufacturing Execution System) Engineer for our new site in Lambres-lez-Douai.\nThe purpose of the MES:\n· MES application is running 24/7 (Maintenance period 4h on Sat and 4h on Sun)\n· MES ensure full traceability of production data.\n· MES Capture information at every stage of the manufacturing process and trigger next stage.\n· MES manage scheduling and production tracking.\nYou will play a pivotal role in deploying and ensuring the smooth operation of MES systems in our state-of-the-art facility.\nKey Responsibilities\n· Coordinate hardware, software, and communication protocols between MES developments from Japan and China, and local equipment suppliers.\n· Oversee and validate the work of the local MES integrator, including system deployment.\n· Ensure all MES interfaces are properly integrated, including connections with production equipment and other systems (SAP, PLM, Maintenance).\n· Manage and align testing, integration, and qualification phases.\n· Provide regular progress reports and highlight critical issues.\n· Collaborate with MES counterparts in the other countries to leverage lessons learned from ongoing projects.\n· Coordinate with IT colleagues, especially those responsible for networks and data centers.\n· Proactively propose actions to mitigate risks.\n· Prepare post-deployment support and system maintenance strategies.\n· Drive all necessary actions to ensure successful MES deployment and meet project objectives.\n· Support company growth and adapt to evolving organizational needs.\n· The MES Engineer may be required to participate in on-call duty to support system operations outside regular working hours. (1 Week per month)\nQualifications\nRequired Skills & Experience\n· Fluent in English (French is not mandatory).\n· Proven experience in international project management.\n· Strong background in MES deployment in industrial environments (preferably DELMIA APRISO).\n· Expertise in industrial control systems (various PLC brands).\n· In-depth knowledge of industrial communication protocols.\nKey Competencies\n· Strategic and analytical mindset.\n· Resilience in solving complex, diverse challenges.\n· Precision and reliability.\n· Adaptability and flexibility.\n· Strong organizational skills and autonomy.\n· Curiosity and ability to work in multicultural, matrixed teams.\n· Excellent communication, teaching, and interpersonal skills.\n· Proactive and solution-oriented.\nPosition Requirements\n· Engineering degree in industrial automation or IT.\n· Minimum 5 years of experience on MES project deployment.\n· Experience in international, matrixed industrial environments.\n· Working language: English.\n#LI-EO1\nGo back\nApply\nShare this job\nEmail\nFacebook\nX\nWeChat\nWhatsApp\nLinkedIn",
        "application_url": "https://jobs.aesc-group.com/en_US/careers/Login?jobId=798&recommendation=&source=&tags=&user=&formValues=",
        "": {},
        "metadata": {
            "Job Title": "Engineer MES",
            "Ref #": "20001465",
            "Employment Type": "Permanent",
            "Department": "Information Technology",
            "Position level": "Engineer",
            "Date": "Tuesday, August 12, 2025",
            "AESC Office Location": "Douai, Hauts-de-France, France"
        },
        "link": "https://jobs.aesc-group.com/en_US/careers/JobDetail/Lambres-lez-Douai-Nord-France-Engineer-MES/798"
    },
    {
        "title": "SAP Engineer – Modules MM/PP/SD/EWM",
        "description_html": null,
        "description_text": "General information\nJob Title\nSAP Engineer – Modules MM/PP/SD/EWM\nRef #\n20001466\nEmployment Type\nPermanent\nDepartment\nInformation Technology\nPosition level\nEngineer\nDate\nTuesday, August 12, 2025\nAESC Office Location\nDouai, Hauts-de-France, France\nDescription & Requirements\nJob Description\nContext and Mission\nAs part of strengthening our IT team and optimizing our business processes, we are looking for an experienced SAP Engineer, capable of designing, configuring, and managing projects related to the MM (Purchasing and Inventory Management), PP (Production Planning), SD (Sales and Distribution), and EWM (Extended Warehouse Management) modules. The SAP Engineer will play a key role in implementing SAP solutions, supporting users, and managing functional developments.\nMain Responsibilities\n· • Analyze business needs and write functional and technical specifications.\n· • Configure SAP MM/PP/SD/EWM modules according to business requirements.\n· • Participate in deployment, migration, or continuous improvement projects.\n· • Manage interfaces with various systems connected to SAP (MES, EDI, PLM, etc.).\n· • Provide level 2/3 support and incident resolution.\n· • Collaborate with business teams, technical teams, and external partners.\n· • Conduct unit and integration tests, and assist users during acceptance phases.\n· • Document implemented solutions and train key users.\nQualifications\nRequired Profile\n· • Higher education in computer science, engineering, or equivalent.\n· • Significant experience (minimum 5 years) with SAP, with expertise in MM, PP, SD, and EWM modules.\n· • Good understanding of industrial, logistics, and supply chain business processes.\n· • Ability to work in project mode, with rigor and autonomy.\n· • Excellent communication and analytical skills.\n· • Working language: English\nAdditional Assets\n· • Experience in an international matrix industrial environment.\n· • Knowledge of S/4HANA.\n· • SAP certification.\n· • Proficiency in project management tools (JIRA, MS Project, etc.).\n#LI-EO1\nGo back\nApply\nShare this job\nEmail\nFacebook\nX\nWeChat\nWhatsApp\nLinkedIn",
        "application_url": "https://jobs.aesc-group.com/en_US/careers/Login?jobId=799&recommendation=&source=&tags=&user=&formValues=",
        "": {},
        "metadata": {
            "Job Title": "SAP Engineer – Modules MM/PP/SD/EWM",
            "Ref #": "20001466",
            "Employment Type": "Permanent",
            "Department": "Information Technology",
            "Position level": "Engineer",
            "Date": "Tuesday, August 12, 2025",
            "AESC Office Location": "Douai, Hauts-de-France, France"
        },
        "link": "https://jobs.aesc-group.com/en_US/careers/JobDetail/Lambres-lez-Douai-Nord-France-SAP-Engineer-Modules-MM-PP-SD-EWM/799"
    },
    {
        "title": "SAP Engineer – FI CO Modules",
        "description_html": null,
        "description_text": "General information\nJob Title\nSAP Engineer – FI CO Modules\nRef #\n20001463\nEmployment Type\nPermanent\nDepartment\nInformation Technology\nPosition level\nExecutive\nDate\nWednesday, August 6, 2025\nAESC Office Location\nDouai, Hauts-de-France, France\nDescription & Requirements\nJob Description\nReporting Line:\nIT Director France\nContext and Mission\nAs part of strengthening our IT team and optimizing our business processes, we are looking for an experienced SAP Engineer capable of designing, configuring, and managing projects related to the FICO (Financial Accounting and Controlling) modules.The SAP Engineer will play a key role in implementing SAP solutions, supporting users, and managing functional developments.\nMain Responsibilities\n• Analyze business needs and write functional and technical specifications.\n• Configure SAP FICO modules according to business requirements.\n• Participate in deployment, migration, and continuous improvement projects.\n• Manage interfaces with systems connected to SAP (e.g., EDI, third-party financial systems).\n• Provide level 2/3 support and resolve incidents.\n• Collaborate with business teams, technical teams, and external partners.\n• Perform unit and integration testing, and support users during acceptance phases.\n• Document implemented solutions and train key users.\nProfile Required\n• Higher education in IT, engineering, or equivalent.\n• Minimum 5 years of significant experience with SAP, with expertise in FICO modules.\n• Good understanding of financial and controlling processes.\n• Ability to work on IFRS and Secondary Ledgers standards.\n• Ability to work in project mode with rigor and autonomy.\n• Excellent communication and analytical skills.\n• Working language: English\nAdditional Assets\n• Experience in an international industrial matrix environment.\n• Knowledge of S/4HANA.\n• SAP certification.\n• Proficiency in project management tools (JIRA, MS Project, etc.).\n#LI-EO1\nQualifications\nx\nGo back\nApply\nShare this job\nEmail\nFacebook\nX\nWeChat\nWhatsApp\nLinkedIn",
        "application_url": "https://jobs.aesc-group.com/en_US/careers/Login?jobId=793&recommendation=&source=&tags=&user=&formValues=",
        "": {},
        "metadata": {
            "Job Title": "SAP Engineer – FI CO Modules",
            "Ref #": "20001463",
            "Employment Type": "Permanent",
            "Department": "Information Technology",
            "Position level": "Executive",
            "Date": "Wednesday, August 6, 2025",
            "AESC Office Location": "Douai, Hauts-de-France, France"
        },
        "link": "https://jobs.aesc-group.com/en_US/careers/JobDetail/Lambres-lez-Douai-Hauts-de-France-France-Nord-France-SAP-Engineer-FI-CO-Modules/793"
    },
    {
        "title": "Team Leader Utilités",
        "description_html": null,
        "description_text": "General information\nJob Title\nTeam Leader Utilités\nRef #\n20001462\nEmployment Type\nPermanent\nDepartment\nManufacturing\nPosition level\nTechnician\nDate\nThursday, July 31, 2025\nAESC Office Location\nDouai, Hauts-de-France, France\nDescription & Requirements\nJob Description\n♻️ Prêt(e) à relever les défis d’une mobilité plus respectueuse de\nl’environnemen\nt ? ♻️🌍\nRejoignez AESC Douai et devenez un acteur clé dans le développement et la production de batteries lithium-ion haute performance.\nDans le cadre de son implantation en France, AESC recrute pour le site de\nLambres-lez-Do\nuai\nLe team leader de maintenance Facilities senior est responsable de l’animation d’une équipe de maintenance. Son équipe a la charge de la maintenance prévisionnelle, préventive et corrective des équipements de leur secteur et des bâtiments et d’en améliorer la disponibilité. Il prend en compte les contraintes de coûts, de qualité et de délais de l’entreprise. Il réalise ses activités en totale autonomie.\nAnimer l’équipe et planifier les activités sur les outils\n· Mettre en œuvre les indicateurs de suivi de l’équipe (MTBF ; MTTR ; Taux de réalisation des préventifs ; …) avec son superviseur et les piloter\n· Collecter les informations des pannes et de conduite sur les utilités et les bâtiments\n· Conduire et/ou accompagner l’analyse et la résolution des pannes sur les installations. Déterminer les solutions techniques et les conditions de remise en état des équipements et/ou de retour aux valeurs de consignes\n· Assurer le respect des opérations d’inspection, de préventif, de curatif sur les équipements avec respect strict des règles de sécurité et environnementales\n· Assurer le respect des attendus réglementaires concernant les équipements et les bâtiments rattachés à son département au travers d'activités préventives en priorité et curative le cas échéant\n· Planifier et encadrer des interventions de mise en conformité et d’amélioration\n· Suivre les coûts générés par son équipe\n· Piloter le passage des informations avec les interlocuteurs de son périmètre\n· Réaliser des comptes-rendus d’intervention et piloter la traçabilité pour l’historisation\n· Encadrer la bonne utilisation de la GMAO / EAM\n· Participer à et/ou dispenser des formations et des programmes de développement professionnel pour améliorer ses compétences, sa connaissance des équipements et celles de son équipe\n· Construire et diriger un plan de formation pour son équipe en accord avec son superviseur / service formation\n· Participer à la rédaction et la mise à jour des procédures, standards et modules de formation du département maintenance\n· Promouvoir l’amélioration continue et le perfectionnement des process de fabrication, de maintenance des équipements et de gestion de l’activité industrielle\n· Valider la qualité de l’intervention de son équipe avec les équipes de production pour la remise à disposition des équipements\n· Promouvoir la sécurité afin qu’elle soit toujours la priorité numéro une de la culture d’AESC ; promouvoir un environnement de travail sûr pour lui et l’ensemble des salariés en suivant tous les programmes et directives de l’entreprise\n· Appliquer tous les processus et procédures conformément aux directives de l’entreprise\nRequirements / Required skills\nBuilding Maintenance\nQualifications\nPneumatique/Hydraulique/Mécanique : Capacité à lire des schémas/plans, à comprendre les concepts de puissance des fluides/ la logique d’assemblage.\n· Maintenance électrique : capacité à lire des plans, à comprendre et dépanner les installations basses tension et à réaliser des travaux haute tension.\n· Automates programmables (PLC) : La connaissance et la capacité de dépanner, extraire, modifier et créer si nécessaire des programmes.\n· Maintenance du bâtiment : capacité à lire des plans, à comprendre et à conduire et dépanner des installations de nature CVC, chaufferie, distribution de fluides, …\n· Maîtrise des outils de résolution de problème\n· Être référent dans un ou plusieurs domaines techniques\n· Connaissance du process de son périmètre d’action\n· Capacité à utiliser correctement les outils de mesure appropriés\n· Maîtrise de la suite Office et des logiciels de bureautique de base\n· Capacité à utiliser efficacement les logiciels à disposition pour saisir des données et rechercher des pièces.\n· Capacité à comprendre une documentation technique en anglais\n· Capacité à remplacer son Superviseur de façon ponctuelle, sur demande du Manager\n· Capacité à supporter son Superviseur dans la préparation d’entretiens\nPostulez, notre équipe prendra le soin de vous recontacter pour vous présenter le poste et répondre à vos questions.\n#li-eo1\nGo back\nApply\nShare this job\nEmail\nFacebook\nX\nWeChat\nWhatsApp\nLinkedIn",
        "application_url": "https://jobs.aesc-group.com/en_US/careers/Login?jobId=791&recommendation=&source=&tags=&user=&formValues=",
        "": {},
        "metadata": {
            "Job Title": "Team Leader Utilités",
            "Ref #": "20001462",
            "Employment Type": "Permanent",
            "Department": "Manufacturing",
            "Position level": "Technician",
            "Date": "Thursday, July 31, 2025",
            "AESC Office Location": "Douai, Hauts-de-France, France"
        },
        "link": "https://jobs.aesc-group.com/en_US/careers/JobDetail/Nord-France-Team-Leader-Utilit-s/791"
    },
    {
        "title": "Spécialiste APS (AESC Production System) / CIP (Continuous Improvement Program)",
        "description_html": null,
        "description_text": "General information\nJob Title\nSpécialiste APS (AESC Production System) / CIP (Continuous Improvement Program)\nRef #\n20001461\nEmployment Type\nPermanent\nDepartment\nCorporate & Business Services\nPosition level\nSpecialist\nDate\nMonday, July 28, 2025\nAESC Office Location\nDouai, Hauts-de-France, France\nDescription & Requirements\nJob Description\nMissions générales / Objectif du poste\nEn tant que leader APS, travailler avec les équipes Production, Maintenance, Qualité, PE et l’équipe APS globale pour promouvoir les activités de standardisation et d’amélioration continue, et piloter les actions d’amélioration de la performance de production du site de Douai.\nDescription des activités\nGérer les indicateurs de performance de l’usine (BSC, PIW, et toute donnée nécessaire pour l’Obeya ou les réunions de direction).\nOrganiser la planification des activités de standardisation et d’amélioration continue via des audits internes sur le terrain (shopfloor).\nParticiper aux activités globales APS concernant la mise à jour et la validation des standards EPF, la mise en place de supports de formation, les projets usine digitale, l’introduction du CIP, etc., en communiquant en anglais.\nPromouvoir la culture 5S et superviser sa mise en œuvre efficace.\nResponsabilités hiérarchiques / Animation de projets\nCe poste est rattaché au spécialiste APS (équivalent responsable de production).\nOrganiser et animer les DMD (Daily Management Diagnosis) en tant qu’auditeur.\nOrganiser et animer les réunions d’équipe et piloter les projets d’amélioration continue.\nRelations de travail internes / externes\nINTERNE :\nTous les départements et responsables\nSuperviseurs Production, Maintenance, Qualité, Supply Chain, équipe IE\nÉquipe APS globale (États-Unis) et spécialistes APS des autres sites AESC (US, UK, CH, JP, etc.)\nEXTERNE :\nAuditeurs\nCompétences professionnelles spécifiques\nConnaissance générale d’un site de production\nGestion des indicateurs (KPI)\nGestion des compétences opérationnelles\nPlanification\nManagement d’équipe\nMaîtrise du Pack Office et des logiciels bureautiques de base\nAnglais technique\nSoft skills requises\nSens de la sécurité\nPédagogie\nEsprit d’analyse\nSens de l’organisation\nAttitude positive\nAisance relationnelle\nLeadership\nGestion du stress\nExigences du poste\nPlus de 10 ans d’expérience en management d’équipe\nDiplôme de type Bac +2\nExpérience de déplacements professionnels en France et à l’international (ponctuels)\nCapacité à respecter les obligations de confidentialité\nCapacité à travailler en horaires postés\n#LI-EO1\nQualifications\nGeneral missions / purpose\nAs an APS leader, work with Production, Maintenance, Quality Assurance, PE and Global APS team to promote standardization and continuous improvement activities and lead the improvement of production activities at the Douai plant.\nDescription of activities\nManage the plant performance indicators (BSC, PIW, and any required data release for Obeya and any senior management meeting materials.)\nOrganize standardization scheduling and continuous improvement activity through internal audit at the shop floor field.\nParticipate into Global APS activities for EPF standards update preview and validation, introduce training material, digital factory activity, CIP introduction etc. with communicating by English language.\nPromote the 5S culture and oversee its successful implementation\nHierarchical responsibility/project for animation\nThis position refers to the APS specialist (equivalent as production manager)\nOrganize and lead DMD (Daily management Diagnosis) as auditor\nOrganize and lead team meetings and manage continuous improvement projects.\nInternal/external working relationships\nINTERNAL\n:\nAll Department and management head members\nProduction, Maintenance, QA, SCM supervisors, IE team\nGlobal APS team (US) and APS specialist in the other AESC plant (US, UK, CH, JP etc.)\nEXTERNAL:\nAuditors\nSpecific professional knowledge\nGeneral production plant/factory knowledge\nKPI management\nOperation Skill management\nPlanning\nTeam management\nProficiency in the Office suite and basic office software\nTechnical English\nRequired soft skills\nEnsuring safety\n-\nDemonstrating pedagogy\n-\nAnalytical skills\n-\nOrganization\n-\nPositivity\n-\nInterpersonal skills\n-\nLeadership\n-\nStress management\nJob Requirements\n10+ years of experience in team management\n-\n2-year professional degree\n-\nDomestic and international business trip experience (irregular)\n-\nAbility to respect confidentiality obligations\n-\nAbility to work in a shift team\n#LI-EO1\nGo back\nApply\nShare this job\nEmail\nFacebook\nX\nWeChat\nWhatsApp\nLinkedIn",
        "application_url": "https://jobs.aesc-group.com/en_US/careers/Login?jobId=790&recommendation=&source=&tags=&user=&formValues=",
        "": {},
        "metadata": {
            "Job Title": "Spécialiste APS (AESC Production System) / CIP (Continuous Improvement Program)",
            "Ref #": "20001461",
            "Employment Type": "Permanent",
            "Department": "Corporate & Business Services",
            "Position level": "Specialist",
            "Date": "Monday, July 28, 2025",
            "AESC Office Location": "Douai, Hauts-de-France, France"
        },
        "link": "https://jobs.aesc-group.com/en_US/careers/JobDetail/Lambres-les-Douai-Nord-France-Sp-cialiste-APS-AESC-Production-System-CIP-Continuous-Improvement-Program/790"
    },
    {
        "title": "Technicien métrologue/Technicienne métrologue",
        "description_html": null,
        "description_text": "General information\nJob Title\nTechnicien métrologue/Technicienne métrologue\nRef #\n20001399\nEmployment Type\nPermanent\nDepartment\nQuality\nPosition level\nTechnician\nDate\nSunday, February 23, 2025\nAESC Office Location\nDouai, Hauts-de-France, France\nDescription & Requirements\nJob Description\n🌍♻️\nPrêt(e) à relever les défis d’une mobilité plus respectueuse de l’environnement ?\n♻️🌍\nRejoignez AESC et devenez un acteur clé dans le développement et la production de batteries lithium-ion haute performance !\nDans le cadre de notre implantation en France, AESC recrute un(e)\nTechnicien Métrologue (H/F)\npour le site de Douai, classé SEVESO seuil haut. Ce poste polyvalent vous permettra de mettre à profit vos connaissances tout en évoluant dans un environnement industriel automobile dynamique.\n🎯 Tâches essentielles et responsabilités :\nLa description suivante du travail à effectuer ne se veut pas exhaustive. Elle met plutôt l'accent sur les principales tâches qui doivent être accomplies :\nRéaliser les activités liées à la métrologie des appareils (interventions techniques : production et laboratoires) en respectant les règles d'hygiène et de sécurité, les délais et les procédures en vigueur.\nÊtre force de proposition auprès des ingénieurs process pour remonter les mises à jour de procédures.\nDéfinir les modes opératoires de vérification des appareils de mesure.\nApporter un soutien au Responsable Métrologie pour le service QHSE en suivant le registre de maintenance.\nContribuer à l'amélioration continue de l'usine.\nParticiper à des projets relatifs à la métrologie.\nÊtre moteur pour l'exécution des MSA (R&R) et capabilité (Cg et Cgk).\nRequirements / Required skills\nCapability Assessment\nQualifications\n💼\nSavoir-faire requis :\nFormation Bac +2/3 type Licence en Métrologie.\nPremière expérience réussie sur un poste similaire dans le domaine industriel, idéalement dans l’automobile.\nConnaissances solides en métrologie : étalonnage, vérification, incertitude de mesure, EMT, capabilité, etc.\nMaîtrise des normes IATF 16949, APQP, PPAP, MSA, SPC, PFMEA, AMDEC Process.\nMaîtrise du plan de contrôle et des méthodes de résolution de problèmes.\nCompétence dans le suivi des KPI et tableaux de bord.\nExpérience avec les outils informatiques comme SAP et connaissances des normes IATF/45001/14001/17025.\n?\nSavoir-être requis :\nAutonome, rigoureux et force de proposition.\nExcellent esprit d’analyse et communication.\nAisance dans le travail collaboratif.\n✅\nExigences du poste :\nPoste en travail posté 3*8.\nConnaissance en métrologie dimensionnelle, analytique et instrumentation.\n📩\nIntéressé(e) ?\nPostulez dès maintenant et participez à la construction d’un avenir plus propre et plus durable avec AESC ! 🌍🔋\n#LI-SD2\nGo back\nApply\nShare this job\nEmail\nFacebook\nX\nWeChat\nWhatsApp\nLinkedIn",
        "application_url": "https://jobs.aesc-group.com/en_US/careers/Login?jobId=308&recommendation=&source=&tags=&user=&formValues=",
        "": {},
        "metadata": {
            "Job Title": "Technicien métrologue/Technicienne métrologue",
            "Ref #": "20001399",
            "Employment Type": "Permanent",
            "Department": "Quality",
            "Position level": "Technician",
            "Date": "Sunday, February 23, 2025",
            "AESC Office Location": "Douai, Hauts-de-France, France"
        },
        "link": "https://jobs.aesc-group.com/en_US/careers/JobDetail/Lambres-lez-Douai-Hauts-de-France-France-Nord-France-Technicien-m-trologue-Technicienne-m-trologue/308"
    },
    {
        "title": "Responsable Comptabilité",
        "description_html": null,
        "description_text": "General information\nJob Title\nResponsable Comptabilité\nRef #\n20001400\nEmployment Type\nPermanent\nDepartment\nFinance\nPosition level\nManager\nDate\nSunday, February 23, 2025\nAESC Office Location\nDouai, Hauts-de-France, France\nDescription & Requirements\nJob Description\nRôles et responsabilités\n- Organiser et préparer les clôtures mensuelles/annuelles, en respectant des délais de reporting serrés.\n- Identifier et ajuster les différences entre IFRS and GAAP Français\n- Développer de nouveaux processus pour les nouveaux business scénarios\n- Constituer la réconciliation avec les intercompanies (matériel premier et les charges etc.)\n- Constituer la réconciliation des comptes avec subledger ( les fournisseurs, et les clients, les fix assets etc.)\n- Etablir les déclarations fiscales périodiques (TVA, cave, c3s, etc.) et travailler avec un cabinet externe pour la déclaration TP\n- Participer à la mise en œuvre de SAP (FICO, MM, BI) et apporter l’amélioration PEP processeurs\n- Préparer le rapport d'audit statutaire, l'annexe, le rapport de gestion, etc.\n- Préparer le rapport d'IFRS avec les analyses du Bilan et compte du résultat en détails\n- Dialoguer avec l'audit externe et interne pour les tests, la documentation et les processus.\n- Coordonner et suivre le processus d'injection de capital\n- Suivi du passif du contrat de prêt et de la comptabilité de couverture liée aux devises étrangères liées à ce contrat\n- Manager une équipe de 2-3 personnes\n---------------------------------------------------------------------------------\nRoles and responsibilities\n- Organize and prepare monthly/annual closings, meeting tight reporting deadlines.\n- Identify and adjust differences between IFRS and French GAAP.\n- Find solutions for new processes for new business scenarios.\n- Perform reconciliation with intercompany accounts (raw materials, expenses, etc.).\n- Reconcile accounts with subledgers (suppliers, customers, fixed assets, etc.).\n- Prepare periodic tax returns (VAT, cave, c3s, etc.) and work with an external firm for TP returns.\n- Participate in the implementation of SAP (FICO, MM, BI) and contribute to the improvement of PEP processors\n- Prepare the statutory audit report, notes to the financial statements, management report, etc.\n- Prepare the IFRS report with detailed analysis of the balance sheet and income statement.\n- Liaise with external and internal auditors for testing, documentation, and processes.\n- Coordinate and monitor the capital injection process.\n- Monitor the liabilities of the loan agreement and the hedge accounting related to foreign currencies linked to this agreement.\n- Manage a team of 2-3 people.\nQualifications\nExpérience et compétences\n- Licence en finance ou comptabilité. CMA/CPA/DSG/DSCG de préférence.\n- 5 à 10 ans d'expérience dans le domaine de la finance et de la comptabilité.\n- L'expérience de SAP est indispensable.\n- Une expérience dans le domaine de la fabrication et des sociétés multinationales est fortement souhaitée avec une expérience de costing\n- Capacité à développer de solides relations de partenariat et d'équipe dans un environnement multi-fonctionnel.\n- Compétences en matière de gestion du temps, d'organisation et de hiérarchisation des priorités.\n- Capacité à parler, lire et écrire couramment en anglais. Parler Chinois sera un plus.\n--------------------------------------------------------------------------\nExperience and skills\n- Bachelor's degree in finance or accounting. CMA/CPA/DSG/DSCG preferred.\n- 5 to 10 years of experience in finance and accounting.\n- SAP experience is essential.\n- Experience in manufacturing and multinational companies is highly desirable, with costing experience.\nGo back\nApply\nShare this job\nEmail\nFacebook\nX\nWeChat\nWhatsApp\nLinkedIn",
        "application_url": "https://jobs.aesc-group.com/en_US/careers/Login?jobId=309&recommendation=&source=&tags=&user=&formValues=",
        "": {},
        "metadata": {
            "Job Title": "Responsable Comptabilité",
            "Ref #": "20001400",
            "Employment Type": "Permanent",
            "Department": "Finance",
            "Position level": "Manager",
            "Date": "Sunday, February 23, 2025",
            "AESC Office Location": "Douai, Hauts-de-France, France"
        },
        "link": "https://jobs.aesc-group.com/en_US/careers/JobDetail/Lambres-lez-Douai-Hauts-de-France-France-France-Responsable-Comptabilit/309"
    },
    {
        "title": "Technicien de laboratoire",
        "description_html": null,
        "description_text": "General information\nJob Title\nTechnicien de laboratoire\nRef #\n20001402\nEmployment Type\nPermanent\nDepartment\nQuality\nPosition level\nTechnician\nDate\nSunday, February 23, 2025\nAESC Office Location\nDouai, Hauts-de-France, France\nDescription & Requirements\nJob Description\n🌍♻️ Prêt(e) à relever les défis d’une mobilité plus respectueuse de l’environnement ? ♻️🌍\nRejoignez AESC et devenez un acteur clé du développement et de la production de batteries lithium-ion haute performance !\nDans le cadre de notre implantation en France, AESC recrute un(e)\nTechnicien(ne) de laboratoire\npour le site de Douai, classé\nSEVESO seuil haut\n. Vous serez responsable de la réalisation des tests, essais et analyses, avec un focus sur le contrôle des matières, composants, semi-finis et produits finis. Vous interviendrez également dans la qualification des produits finis et ponctuellement dans l’analyse des retours clients et/ou des usines.\nNous vous proposons un poste polyvalent combinant chimie, mécanique et électricité, vous permettant de mettre à profit vos connaissances tout en développant de nouvelles compétences dans un environnement industriel automobile.\n🎯 Tâches essentielles et responsabilités\nLa description suivante du travail à effectuer ne se veut pas exhaustive. Elle met plutôt l'accent sur les principales tâches qui doivent être accomplies :\nRéaliser les analyses      en suivant les modes opératoires\nContrôler et assurer la      conformité des produits\nEffectuer la libération      des lots\nSaisir les données dans      l'ERP\nGérer et suivre les      non-conformités des produits\nPlanifier et réaliser      des prélèvements pour les contrôles d’environnement et fluides, ainsi que      des produits (matières premières, en cours de production et produits      finis)\nRéaliser et approuver      les résultats des analyses\nParticiper à la      vérification métrologique, à la maintenance, qualification et validation      des équipements/locaux\nContribuer aux      processus d’amélioration continue (5S, …)\nParticiper à la gestion      des réactifs et échantillons, ainsi qu’à la rédaction de la documentation      technique et sécurité (DUERP)\nIdentifier les risques      et proposer des actions pour limiter ces risques avec les fonctions      concernées\nQualifications\n💼 Savoir-faire requis :\nDe formation Bac+2      scientifiques (débutants acceptés)\nConnaissances en      mesures physiques, métallurgie, mécanique, voire mécatronique, idéalement      chimie de la batterie\nAutonome, force de      proposition, avec un bon esprit d’analyse et de synthèse\nBon relationnel et      capacité à collaborer efficacement dans un environnement automobile\n? Savoir-être requis :\nRigueur et précision\nEsprit d’équipe\nProactivité et capacité      à résoudre des problèmes\n✅ Exigences du poste :\nFormation\nBac+2      scientifiques\nConnaissance      des outils informatiques\n, notamment SAP\nDisponibilité pour      travailler en équipe\n3x8\n📩 Intéressé(e) ? Postulez dès maintenant et participez à la construction d’un avenir plus propre et plus durable avec AESC ! 🌍🔋\n#LI-SD2\nGo back\nApply\nShare this job\nEmail\nFacebook\nX\nWeChat\nWhatsApp\nLinkedIn",
        "application_url": "https://jobs.aesc-group.com/en_US/careers/Login?jobId=311&recommendation=&source=&tags=&user=&formValues=",
        "": {},
        "metadata": {
            "Job Title": "Technicien de laboratoire",
            "Ref #": "20001402",
            "Employment Type": "Permanent",
            "Department": "Quality",
            "Position level": "Technician",
            "Date": "Sunday, February 23, 2025",
            "AESC Office Location": "Douai, Hauts-de-France, France"
        },
        "link": "https://jobs.aesc-group.com/en_US/careers/JobDetail/Lambres-lez-Douai-Hauts-de-France-France-France-Technicien-de-laboratoire/311"
    },
    {
        "title": "Conducteur d'installations (H/F)",
        "description_html": null,
        "description_text": "General information\nJob Title\nConducteur d'installations (H/F)\nRef #\n242\nEmployment Type\nPermanent\nDepartment\nManufacturing\nPosition level\nTechnician\nDate\nTuesday, February 4, 2025\nAESC Office Location\nDouai, Hauts-de-France, France\nDescription & Requirements\nJob Description\n🌍♻️ Prêt(e) à relever les défis d’une mobilité plus respectueuse de l’environnement ? ♻️🌍\nRejoignez AESC et devenez un acteur clé dans le développement et la production de batteries lithium-ion haute performance !\nDans le cadre de son implantation en France, AESC recrute des\nConducteurs d’installation (H/F)\npour son site de\nLambres-lez-Douai\n. Vous serez en charge du pilotage des installations automatisées et de leur bon fonctionnement, sous la supervision du Team Leader Production.\n🎯\nTâches essentielles et responsabilités :\nLa description suivante du travail à effectuer ne se veut pas exhaustive. Elle met plutôt l’accent sur les principales tâches qui doivent être accomplies :\nAssurer les productions au quotidien et en temps réel sur votre périmètre, conformément à la fiche de poste\nConduire les équipements de production dans le respect des règles de sécurité et qualité, en environnement salle blanche « 0 poussière »\nGérer les dysfonctionnements et intervenir pour les résoudre rapidement\nParticiper à l’amélioration continue et proposer des perfectionnements pour optimiser la production\n💼\nSavoir-faire requis :\nExpérience confirmée dans le secteur industriel, notamment en production\nBonne maîtrise des outils et des équipements de production automatisés\nCompétences en gestion des dysfonctionnements et en amélioration continue\n?\nSavoir-être requis :\nAutonomie et capacité à travailler en équipe\nEsprit d’analyse et résolution de problèmes\nDisponibilité pour des horaires postés (3x8) ou le week-end\n✅\nExigences du poste :\nExpérience dans un environnement industriel\nPrêt à travailler dans des conditions strictes de sécurité et qualité\nDisponibilité pour des horaires postés ou le week-end\n#LI-EO1\nQualifications\n✅\nExigences du poste :\nExpérience dans un environnement industriel\nPrêt à travailler dans des conditions strictes de sécurité et qualité\nDisponibilité pour des horaires postés ou le week-end\nGo back\nApply\nShare this job\nEmail\nFacebook\nX\nWeChat\nWhatsApp\nLinkedIn",
        "application_url": "https://jobs.aesc-group.com/en_US/careers/Login?jobId=250&recommendation=&source=&tags=&user=&formValues=",
        "": {},
        "metadata": {
            "Job Title": "Conducteur d'installations (H/F)",
            "Ref #": "242",
            "Employment Type": "Permanent",
            "Department": "Manufacturing",
            "Position level": "Technician",
            "Date": "Tuesday, February 4, 2025",
            "AESC Office Location": "Douai, Hauts-de-France, France"
        },
        "link": "https://jobs.aesc-group.com/en_US/careers/JobDetail/LAMBRES-LEZ-DOUAI-France-Conducteur-d-installations-H-F/250"
    },
    {
        "title": "TECHNICIEN QUALITE MATIERES PREMIERES",
        "description_html": null,
        "description_text": "General information\nJob Title\nTECHNICIEN QUALITE MATIERES PREMIERES\nRef #\n235\nEmployment Type\nPermanent\nDepartment\nQuality\nPosition level\nTechnician\nDate\nWednesday, January 29, 2025\nAESC Office Location\nDouai, Hauts-de-France, France\nDescription & Requirements\nJob Description\nIntégré( e)  au département qualité, vous êtes notre prochain (e )  technicien(e ) qualité fournisseur !\nVous avez une expérience dans l'automobile chez un fournisseur de niveau 1 ?\nVenez travailler chez nous !\nMission :\nVous serez en charge de la vérification de la qualité des matières premières reçues à leur arrivée sur le site.\nAprès avoir procédé aux analyses, et en cas de non-conformité des matériaux, vous serez en charge de remonter ces dernières auprès du laboratoire et au SQE .\nCe que l'on vous demandera ?\nCette liste n'est pas exhaustive et peut évoluer.\nGérer et sécuriser la manipulation des produits non conformes.\nComprendre les PFMEA et les plans de contrôle.\nGénérer des rapports techniques et de gestion.\nEffectuer des inspections dans l'entrepôt en suivant les instructions de travail pertinentes.\nEffectuer des activités de validation.\nEffectuer des analyses XRAY.\nActiver des activités de confinement.\nAvoir une bonne connaissance     de la norme IATF16949:2016\nCompétences particulières recherchées :\n- Capacité à analyser, interpréter et présenter des données pour prendre des décisions fondées sur des faits.\n- Expérience de l'IATF16949\n- Expérience/compréhension des outils de base de l'IATF/TS (PPAP, APQP, MSA, FMEA, SPC).\n- Solides compétences en matière de communication écrite et orale - des rapports à tous les niveaux de l'entreprise et avec toutes les fonctions seront nécessaires.\n- Connaissance du logiciel SAP (souhaitable)\n- Bonnes compétences en informatique, y compris MS Word, Excel, Access et PowerPoint.\n- Capacité à travailler en équipe\n- Connaissance de l'enquête 8D.\n- Compréhension de l'étalonnage et de la MSA (souhaitable)\n- Savoir confiner des pièces suspectes\nQualifications requises :\nDe formation Bac+2 / 3 dans     un domaine scientifique\nAutonome\nCurieux\nForce de proposition\nUn bon esprit d’analyse\nEsprit de synthèse\nBon     relationnel qui vous permet de collaborer efficacement et de maitriser la     relation fournisseur (client dans un environnement automobile)\n#LI-SD2\nQualifications\nCompétences particulières recherchées :\n- Capacité àanalyser, interpréter et présenter des données pour prendre des décisionsfondées sur des faits.\n- Expérience del'IATF16949\n-Expérience/compréhension des outils de base de l'IATF/TS (PPAP, APQP, MSA,FMEA, SPC).\n- Solidescompétences en matière de communication écrite et orale - des rapports à tousles niveaux de l'entreprise et avec toutes les fonctions seront nécessaires.\n- Connaissance dulogiciel SAP (souhaitable)\n- Bonnes compétencesen informatique, y compris MS Word, Excel, Access et PowerPoint.\n- Capacité àtravailler en équipe\n- Connaissance del'enquête 8D.\n- Compréhension del'étalonnage et de la MSA (souhaitable)\n- Savoir confinerdes pièces suspectes\nQualifications requises :\nDe formation Bac+2 / 3 dans     un domaine scientifique\nAutonome\nCurieux\nForcede proposition\nUn bonesprit d’analyse\nEsprit de synthèse\nBon     relationnel qui vous permet de collaborer efficacement et de maitriser la     relation fournisseur (client dans un environnement automobile)\nGo back\nApply\nShare this job\nEmail\nFacebook\nX\nWeChat\nWhatsApp\nLinkedIn",
        "application_url": "https://jobs.aesc-group.com/en_US/careers/Login?jobId=243&recommendation=&source=&tags=&user=&formValues=",
        "": {},
        "metadata": {
            "Job Title": "TECHNICIEN QUALITE MATIERES PREMIERES",
            "Ref #": "235",
            "Employment Type": "Permanent",
            "Department": "Quality",
            "Position level": "Technician",
            "Date": "Wednesday, January 29, 2025",
            "AESC Office Location": "Douai, Hauts-de-France, France"
        },
        "link": "https://jobs.aesc-group.com/en_US/careers/JobDetail/Lambres-lez-Douai-Hauts-de-France-France-Nord-France-TECHNICIEN-QUALITE-MATIERES-PREMIERES/243"
    },
    {
        "title": "Technicien de Maintenance (H/F)",
        "description_html": null,
        "description_text": "General information\nJob Title\nTechnicien de Maintenance (H/F)\nRef #\n206\nEmployment Type\nPermanent\nDepartment\nOperations\nPosition level\nTechnician\nDate\nMonday, January 6, 2025\nAESC Office Location\nDouai, Hauts-de-France, France\nDescription & Requirements\nJob Description\n🌍♻️\nPrêt(e) à relever les défis d’une mobilité plus respectueuse de l’environnement ?\n♻️🌍\nRejoignez AESC Douai et devenez un acteur clé dans le développement et la production de batteries lithium-ion haute performance.\nDans le cadre de son implantation en France, AESC recrute pour le site de\nLambres-lez-Douai\n, des\nTechnicien(ne) de Maintenance\n.\nPlusieurs postes sont à pourvoir en fonction de vos compétences:\nMaintenance Opérationnelle\nTools & dies - usinage - pièces de l'usine\nUtilities - Infrastructure\nAutomaticien -\n?\nSavoir-être requis :\nEsprit d’équipe et capacité à travailler en horaires postés.\nProactivité, autonomie et rigueur.\nLe gout du challenge et l'envie de participer à la création d'une nouvelle industrie\n✅\nExigences du poste :\nMobilité nationale et/ou internationale ponctuelle.\nTravail en horaires 4*12 pour la maintenance ( 3 jours travaillés de 12h , 3 jours repos ) ET  3*8 pour les utilités\n💼\nSavoir-faire requis :\nConnaissances en maintenance industrielle et équipements automatisés.\nPostulez, notre équipe prendra le soin de vous recontacter pour vous présenter le poste et répondre à vos questions.\n#LI-EO1\nRequirements / Required skills\nEquipment Maintenance\nMaintenance & Repair\nPlant Maintenance\nPreventive Maintenance\nQualifications\n✅\nExigences du poste :\nMobilité nationale et/ou internationale ponctuelle.\nTravail en horaires de journée OU 2*8 jusqu’à mars 2025, puis en 3*8.\nGo back\nApply\nShare this job\nEmail\nFacebook\nX\nWeChat\nWhatsApp\nLinkedIn",
        "application_url": "https://jobs.aesc-group.com/en_US/careers/Login?jobId=212&recommendation=&source=&tags=&user=&formValues=",
        "": {},
        "metadata": {
            "Job Title": "Technicien de Maintenance (H/F)",
            "Ref #": "206",
            "Employment Type": "Permanent",
            "Department": "Operations",
            "Position level": "Technician",
            "Date": "Monday, January 6, 2025",
            "AESC Office Location": "Douai, Hauts-de-France, France"
        },
        "link": "https://jobs.aesc-group.com/en_US/careers/JobDetail/LAMBRES-LEZ-DOUAI-France-Technicien-de-Maintenance-H-F/212"
    }
]