[
    {
        "title": null,
        "description_html": null,
        "description_text": "ESRB traineeship – Economist profile\nESRB Secretariat\n13303\nGeneral Information\nType of contract\nTraineeship\nWho can apply?\nEU nationals eligible for our traineeship programme\nGrant\nThe trainee grant is €1,170 per month plus an accommodation allowance (see further information section)\nWorking time\nFull time\nPlace of work\nFrankfurt am Main, Germany\nClosing date\n17.02.2026\nYour team\nYou will be part of the Secretariat of the European Systemic Risk Board (ESRB). The ESRB is an independent EU body responsible for the macroprudential oversight of the EU financial system and the prevention and mitigation of systemic risk.\nThe ESRB brings together representatives from around 80 institutions, including central banks and supervisors, as well as independent experts. It collects and analyses information on a wide range of financial institutions and markets, monitors macro-financial developments, and issues warnings and recommendations to policymakers and supervisors. Further information is available on the ESRB’s\nwebsite\n.\nThe ESRB Secretariat is part of the European Central Bank (ECB) and provides analytical, statistical, logistical and administrative support to the ESRB. Our tasks include identifying and analysing systemic risks to the EU financial system, assessing and proposing macroprudential policies, preparing ESRB warnings and recommendations and monitoring their implementation, cooperating with supervisory and other macroprudential authorities, supporting ESRB working groups and preparing documents for meetings of the ESRB General Board and its substructures.\nIn your role as a trainee, you will contribute to the analytical work of the team to identify and assess systemic risks in the EU financial sector and to develop the policies to address such risks. You will provide input for the ESRB’s working groups and substructures. The content of your traineeship will depend on your skillset and the specific projects the Secretariat is involved in.\nThe ECB is an inclusive employer and we strive to reflect the diversity of the population we serve. We encourage you to apply irrespective of age, disability, ethnicity, gender, gender identity, race, religious beliefs, sexual orientation or other characteristics.\nYour role\nAs a trainee you will:\nsupport the analytical work of the ESRB Secretariat;\nanalyse developments in the EU financial system, using various datasets and sources of information;\ncontribute to the identification and analysis of financial stability risks related to the banking sector, non-bank financial intermediaries, financial market infrastructure and markets;\nsupport the development of a system-wide stress test of the EU financial system;\ncontribute to the assessment of macroprudential policies in the EU;\nparticipate in and contribute to the work of ESRB committees.\nThe traineeship offers you excellent opportunities to work on financial stability topics relating to the whole financial system. You will gain experience in financial stability analysis through regular use of data analysis tools and models and by contributing to meetings, presentations and key ESRB reports. You will be part of a multicultural team that strives for continuous innovation to make a positive impact on the lives of European citizens.\nQualifications, experience and skills\nEssential:\na bachelor’s degree or higher in economics, econometrics, banking, business administration, finance, statistics or another relevant field;\na keen interest in financial stability and macroprudential policy;\nproficiency in empirical analysis using statistical and data management packages (e.g. EViews, Excel VBA, MATLAB, Python, R, R Shiny, SAS, Stata, SQL and Tableau);\nan advanced knowledge of Microsoft Office, in particular Word, Excel and PowerPoint;\nan advanced (C1) command of English and an intermediate (B1) command of at least one other official language of the EU, according to the\nCommon European Framework of Reference for Languages\n.\nDesired:\nsound knowledge of one or more of the following areas: macroeconomics, monetary or prudential policies, financial markets, banks, financial stability, investment funds, financial supervision, central counterparties, insurance, pension funds or cybersecurity;\nexperience with financial market data sources (e.g. Bloomberg, LSEG and S&P Global Market Intelligence), official financial sector, economic and banking statistics (e.g. from the ECB, Eurostat and the Bank for International Settlements) and/or micro-level data (e.g. firm-level data);\nexperience in drafting for, and/or presenting a topic to, a wide audience.\nYou are curious and eager to learn, and want to further develop your ability to analyse complex information. You are keen to collaborate with others, pursue team goals and learn from other people’s diverse perspectives. You strive to know and anticipate stakeholder needs, and will signal any need for change and propose alternative solutions.\nYou are motivated to contribute to the ECB’s mission, to serve the citizens of the EU as a member of a public institution and to work with colleagues from all over Europe. You are keen to be part of our team and to use your skills and competencies to achieve the aims of this position.\nFurther information\nInitial traineeship of 6 months, with a possible extension to up to 12 months in total. The starting date will be between May and November 2026.\nOther details on the\nconditions applicable to traineeships\nat the ECB can be found on our website.\nFor additional information on this specific vacancy, you can speak with Frauke Skudelny on +49 69 1344 7092 between 09:00 and 11:00 on Tuesday, 10 February.\nApplication and selection process\nThe recruitment process for this position will include an online interview and a written exercise.\nFurther information on\nhow to apply\nis available on our website.\nIf you are not selected for this position but are still considered suitable, you will be placed on a reserve list for 12 months from the closing date for applications, from which you might be considered for other traineeship positions within the ECB.\nApply\nShare\nBack to search results",
        "application_url": "https://talent.ecb.europa.eu/careers/ApplicationMethods?jobId=13303",
        "metadata": {
            "Type of contract": "Traineeship",
            "Who can apply?": "EU nationals eligible for our traineeship programme",
            "Grant": "The trainee grant is €1,170 per month plus an accommodation allowance (see further information section)",
            "Working time": "Full time",
            "Place of work": "Frankfurt am Main, Germany",
            "Closing date": "17.02.2026",
            "Your team": "You will be part of the Secretariat of the European Systemic Risk Board (ESRB). The ESRB is an independent EU body responsible for the macroprudential oversight of the EU financial system and the prevention and mitigation of systemic risk.The ESRB brings together representatives from around 80 institutions, including central banks and supervisors, as well as independent experts. It collects and analyses information on a wide range of financial institutions and markets, monitors macro-financial developments, and issues warnings and recommendations to policymakers and supervisors. Further information is available on the ESRB’swebsite.The ESRB Secretariat is part of the European Central Bank (ECB) and provides analytical, statistical, logistical and administrative support to the ESRB. Our tasks include identifying and analysing systemic risks to the EU financial system, assessing and proposing macroprudential policies, preparing ESRB warnings and recommendations and monitoring their implementation, cooperating with supervisory and other macroprudential authorities, supporting ESRB working groups and preparing documents for meetings of the ESRB General Board and its substructures.In your role as a trainee, you will contribute to the analytical work of the team to identify and assess systemic risks in the EU financial sector and to develop the policies to address such risks. You will provide input for the ESRB’s working groups and substructures. The content of your traineeship will depend on your skillset and the specific projects the Secretariat is involved in.The ECB is an inclusive employer and we strive to reflect the diversity of the population we serve. We encourage you to apply irrespective of age, disability, ethnicity, gender, gender identity, race, religious beliefs, sexual orientation or other characteristics.",
            "Your role": "As a trainee you will:support the analytical work of the ESRB Secretariat;analyse developments in the EU financial system, using various datasets and sources of information;contribute to the identification and analysis of financial stability risks related to the banking sector, non-bank financial intermediaries, financial market infrastructure and markets;support the development of a system-wide stress test of the EU financial system;contribute to the assessment of macroprudential policies in the EU;participate in and contribute to the work of ESRB committees.The traineeship offers you excellent opportunities to work on financial stability topics relating to the whole financial system. You will gain experience in financial stability analysis through regular use of data analysis tools and models and by contributing to meetings, presentations and key ESRB reports. You will be part of a multicultural team that strives for continuous innovation to make a positive impact on the lives of European citizens.",
            "Qualifications, experience and skills": "Essential:a bachelor’s degree or higher in economics, econometrics, banking, business administration, finance, statistics or another relevant field;a keen interest in financial stability and macroprudential policy;proficiency in empirical analysis using statistical and data management packages (e.g. EViews, Excel VBA, MATLAB, Python, R, R Shiny, SAS, Stata, SQL and Tableau);an advanced knowledge of Microsoft Office, in particular Word, Excel and PowerPoint;an advanced (C1) command of English and an intermediate (B1) command of at least one other official language of the EU, according to theCommon European Framework of Reference for Languages.Desired:sound knowledge of one or more of the following areas: macroeconomics, monetary or prudential policies, financial markets, banks, financial stability, investment funds, financial supervision, central counterparties, insurance, pension funds or cybersecurity;experience with financial market data sources (e.g. Bloomberg, LSEG and S&P Global Market Intelligence), official financial sector, economic and banking statistics (e.g. from the ECB, Eurostat and the Bank for International Settlements) and/or micro-level data (e.g. firm-level data);experience in drafting for, and/or presenting a topic to, a wide audience.You are curious and eager to learn, and want to further develop your ability to analyse complex information. You are keen to collaborate with others, pursue team goals and learn from other people’s diverse perspectives. You strive to know and anticipate stakeholder needs, and will signal any need for change and propose alternative solutions.You are motivated to contribute to the ECB’s mission, to serve the citizens of the EU as a member of a public institution and to work with colleagues from all over Europe. You are keen to be part of our team and to use your skills and competencies to achieve the aims of this position.",
            "Further information": "Initial traineeship of 6 months, with a possible extension to up to 12 months in total. The starting date will be between May and November 2026.Other details on theconditions applicable to traineeshipsat the ECB can be found on our website.For additional information on this specific vacancy, you can speak with Frauke Skudelny on +49 69 1344 7092 between 09:00 and 11:00 on Tuesday, 10 February.",
            "Application and selection process": "The recruitment process for this position will include an online interview and a written exercise.Further information onhow to applyis available on our website.If you are not selected for this position but are still considered suitable, you will be placed on a reserve list for 12 months from the closing date for applications, from which you might be considered for other traineeship positions within the ECB."
        },
        "link": "https://talent.ecb.europa.eu/careers/JobDetail/ESRB-traineeship-Economist-profile/13303"
    },
    {
        "title": null,
        "description_html": null,
        "description_text": "Financial Stability Experts (ESCB/IO) – Macroprudential Policy\nAnalysis and Policy Advice\nMacroprudential Policy & Financial Stability\n13371\nGeneral Information\nType of contract\nShort-term contract, which may be extended to up to 36 months subject to individual performance and organisational needs\nContract end date\n30.09.2028\nWho can apply?\nEU nationals working for national central banks of the ESCB, international governmental organisations or other employers performing central banking or banking supervision tasks within the framework of the Eurosystem\nSalary\nF/G (bracket 1 - step 1) full time monthly net salary: €7,465 plus benefits, for further information see\nwhat we offer\n.\nRole specialisation\nFinancialStability&MacroprudentialPolicy\nWorking time\nFull time\nPlace of work\nFrankfurt am Main, Germany\nClosing date\n15.02.2026\nYour team\nThe Macroprudential Policy Division in the Directorate General Macroprudential Policy and Financial Stability is seeking applicants for two Financial Stability Expert positions. Our Directorate General provides analysis and policy advice on issues relating to macroprudential policy, financial stability, risk assessment, financial regulation and financial stability arrangements.\nIn your role as a Financial Stability Expert, you will be part of a team of around 30 members of staff responsible for analysing the current macroprudential policy framework and policy implementation while also performing innovative analytical work. You will work closely with colleagues from national macroprudential authorities, the European Systemic Risk Board, European banking supervision and other business areas of the ECB.\nThe ECB is an inclusive employer and we strive to reflect the diversity of the population we serve. We encourage you to apply irrespective of age, disability, ethnicity, gender, gender identity, race, religious beliefs, sexual orientation or other characteristics.\nYour role\nAs a Financial Stability Expert you will:\nanalyse the appropriateness of the existing macroprudential policy stance at country level and suggest an appropriate choice of existing macroprudential instruments and how they should be calibrated;\nassess the need for changes in the macroprudential toolkit, propose novel policy solutions and conduct supporting quantitative analyses, including ex ante impact assessments of different policy options;\ncoordinate and contribute to briefings, notes, presentations, speeches and reports for the ECB’s committees and decision-making bodies and for Eurosystem working groups;\nkeep abreast of theoretical and empirical developments in the field of macroprudential policy, for instance by attending workshops and conferences;\ndevelop and maintain networks with counterparts at national central banks (including by participating in country visits), supervisory authorities and European and international organisations (such as the European Systemic Risk Board, the European Commission and the International Monetary Fund);\nconduct analytical work related to the Division’s areas of interest.\nThe position offers you excellent opportunities to work in a stimulating environment, analysing macroprudential policies and thereby helping the ECB to fulfil its macroprudential mandate. You will be part of a multicultural team that strives for continuous innovation to make a positive impact on the lives of European citizens.\nQualifications, experience and skills\nEssential:\na master’s degree or equivalent in economics, finance or another relevant field (see\nHow you can join us\nfor details on degree equivalences);\nin addition to the above, a minimum of four years’ professional experience (other than as a trainee or intern) in the field of financial stability and macroprudential policy and analysis;\nsound knowledge of the European macroprudential policy framework;\nproven ability to conduct quantitative analyses of financial stability topics, including the calibration of macroprudential policies, and to assess the macroprudential policy stance;\nexperience of presenting your analysis in a clear and concise manner for use in reports, publications and policy discussions;\nability to work with software such as Stata, MATLAB, Python or R;\nan advanced (C1) command of English and an intermediate (B1) command of at least one other official language of the EU, according to the\nCommon European Framework of Reference for Languages\n.\nDesired:\na PhD in economics, finance or another relevant field.\nYou engage collaboratively with others. You pursue team goals and learn willingly from other people’s diverse perspectives. You signal any need for change by explaining it and proposing alternative solutions. You analyse complex information effectively and can evaluate different views to arrive at solutions. You know and anticipate stakeholder needs.\nYou are motivated to be part of our team and to develop and use your skills and competencies to achieve the aims of this position.\nYou are aware of your strengths and areas for development and know what motivates you to perform at your highest level.\nWorking modalities\nWe would be happy to discuss a part-time arrangement for this role.\nFurther information\nThe contracts offered will be short-term ESCB/IO, the appointment being for 24 months as of the exact starting date of the selected person, extendable to up to 36 months.\nCandidates must have a contract of employment with their home institution for a period of at least one year beyond the duration of the ECB contract being offered.\nFor additional information on this specific vacancy, you can speak to the hiring manager, Carsten Detken, on +49 175 22 96 923 between 16:00 and 17:00 on 5 February.\nApplication and selection process\nThe recruitment process for this position will be conducted remotely. It will include a presentation and an interview.\nIf you are not selected for this position but are still considered suitable, you will be placed on a reserve list (see step 4 of\nHow we hire\n), from which you might be considered for similar positions within the ECB.\nFind out\nhow to apply\nfor a position at the ECB.\nRead more about\nhow you can join us\n.\nApply\nShare\nBack to search results",
        "application_url": "https://talent.ecb.europa.eu/careers/ApplicationMethods?jobId=13371",
        "metadata": {
            "Type of contract": "Short-term contract, which may be extended to up to 36 months subject to individual performance and organisational needs",
            "Contract end date": "30.09.2028",
            "Who can apply?": "EU nationals working for national central banks of the ESCB, international governmental organisations or other employers performing central banking or banking supervision tasks within the framework of the Eurosystem",
            "Salary": "F/G (bracket 1 - step 1) full time monthly net salary: €7,465 plus benefits, for further information seewhat we offer.",
            "Role specialisation": "FinancialStability&MacroprudentialPolicy",
            "Working time": "Full time",
            "Place of work": "Frankfurt am Main, Germany",
            "Closing date": "15.02.2026",
            "Your team": "The Macroprudential Policy Division in the Directorate General Macroprudential Policy and Financial Stability is seeking applicants for two Financial Stability Expert positions. Our Directorate General provides analysis and policy advice on issues relating to macroprudential policy, financial stability, risk assessment, financial regulation and financial stability arrangements.In your role as a Financial Stability Expert, you will be part of a team of around 30 members of staff responsible for analysing the current macroprudential policy framework and policy implementation while also performing innovative analytical work. You will work closely with colleagues from national macroprudential authorities, the European Systemic Risk Board, European banking supervision and other business areas of the ECB.The ECB is an inclusive employer and we strive to reflect the diversity of the population we serve. We encourage you to apply irrespective of age, disability, ethnicity, gender, gender identity, race, religious beliefs, sexual orientation or other characteristics.",
            "Your role": "As a Financial Stability Expert you will:analyse the appropriateness of the existing macroprudential policy stance at country level and suggest an appropriate choice of existing macroprudential instruments and how they should be calibrated;assess the need for changes in the macroprudential toolkit, propose novel policy solutions and conduct supporting quantitative analyses, including ex ante impact assessments of different policy options;coordinate and contribute to briefings, notes, presentations, speeches and reports for the ECB’s committees and decision-making bodies and for Eurosystem working groups;keep abreast of theoretical and empirical developments in the field of macroprudential policy, for instance by attending workshops and conferences;develop and maintain networks with counterparts at national central banks (including by participating in country visits), supervisory authorities and European and international organisations (such as the European Systemic Risk Board, the European Commission and the International Monetary Fund);conduct analytical work related to the Division’s areas of interest.The position offers you excellent opportunities to work in a stimulating environment, analysing macroprudential policies and thereby helping the ECB to fulfil its macroprudential mandate. You will be part of a multicultural team that strives for continuous innovation to make a positive impact on the lives of European citizens.",
            "Qualifications, experience and skills": "Essential:a master’s degree or equivalent in economics, finance or another relevant field (seeHow you can join usfor details on degree equivalences);in addition to the above, a minimum of four years’ professional experience (other than as a trainee or intern) in the field of financial stability and macroprudential policy and analysis;sound knowledge of the European macroprudential policy framework;proven ability to conduct quantitative analyses of financial stability topics, including the calibration of macroprudential policies, and to assess the macroprudential policy stance;experience of presenting your analysis in a clear and concise manner for use in reports, publications and policy discussions;ability to work with software such as Stata, MATLAB, Python or R;an advanced (C1) command of English and an intermediate (B1) command of at least one other official language of the EU, according to theCommon European Framework of Reference for Languages.Desired:a PhD in economics, finance or another relevant field.You engage collaboratively with others. You pursue team goals and learn willingly from other people’s diverse perspectives. You signal any need for change by explaining it and proposing alternative solutions. You analyse complex information effectively and can evaluate different views to arrive at solutions. You know and anticipate stakeholder needs.You are motivated to be part of our team and to develop and use your skills and competencies to achieve the aims of this position.You are aware of your strengths and areas for development and know what motivates you to perform at your highest level.",
            "Working modalities": "We would be happy to discuss a part-time arrangement for this role.",
            "Further information": "The contracts offered will be short-term ESCB/IO, the appointment being for 24 months as of the exact starting date of the selected person, extendable to up to 36 months.Candidates must have a contract of employment with their home institution for a period of at least one year beyond the duration of the ECB contract being offered.For additional information on this specific vacancy, you can speak to the hiring manager, Carsten Detken, on +49 175 22 96 923 between 16:00 and 17:00 on 5 February.",
            "Application and selection process": "The recruitment process for this position will be conducted remotely. It will include a presentation and an interview.If you are not selected for this position but are still considered suitable, you will be placed on a reserve list (see step 4 ofHow we hire), from which you might be considered for similar positions within the ECB.Find outhow to applyfor a position at the ECB.Read more abouthow you can join us."
        },
        "link": "https://talent.ecb.europa.eu/careers/JobDetail/Financial-Stability-Experts-ESCB-IO-Macroprudential-Policy/13371"
    },
    {
        "title": null,
        "description_html": null,
        "description_text": "Graduate Programme 2026\nGraduate Programme\nEuropean Central Bank wide\n13093\nGeneral Information\nType of contract\nTwo-year fixed-term contract starting on 1 September. It may be extended for one additional year upon successful completion of the programme.\nWho can apply?\nEU nationals\nSalary\nE/F (bracket 1 - step 1) full time monthly net salary: €4,982 plus benefits, for further information see\nwhat we offer\n.\nWorking time\nFull time\nPlace of work\nFrankfurt am Main, Germany\nClosing date\n13.02.2026\nYour team\nWe are looking for 15 highly talented recent graduates with a postgraduate degree, and preferably a PhD,  to join the ECB’s Graduate Programme.\nApplicants’ profiles will vary in terms of age, background and interests and, if successful, you will discover intellectual challenges, varied opportunities and a people-centred working culture that gives you a voice and the chance to make an impact – for Europe.\nWe will give you two challenging one-year assignments in two different business areas, matched to our organisational needs and considering your fields of expertise and your interests – which you can indicate during the application process This gives you the opportunity to apply your knowledge in various ways.\nDuring the second year of the Graduate Programme, you will choose, together with business area managers, a topic for a paper that you will prepare and submit before the end of the second year. Your successful completion of the programme will be assessed by the Graduate Programme Committee on the basis of performance reviews and your project paper.\nThe ECB is an inclusive employer and we strive to reflect the diversity of the population we serve. We encourage you to apply irrespective of age, disability, ethnicity, gender, gender identity, race, religious beliefs, sexual orientation or other characteristics.\nYour role\nThe Graduate Programme offers you excellent development opportunities, valuable experience and an insight into the ECB’s tasks and working methods. It could be your starting point for an exciting career at the ECB, including in ECB Banking Supervision.\nWe will assign you an experienced colleague as a mentor to provide you with support, advice and guidance on participating successfully in the programme. Beyond learning on the job in different teams and tasks, you also have access to a broad range of learning opportunities, including in-house and external training opportunities.\nYou will be part of a multicultural team that strives for continuous innovation to make a positive impact on the lives of European citizens.\nQualifications, experience and skills\nEssential:\na master’s degree or PhD (or equivalent) completed between 1 February 2024 and 31 January 2026. Alternatively, if you are due to complete a PhD in 2026, your master’s degree can have been obtained before 1 February 2024. Candidates with a PhD, or who will obtain a PhD in 2026, will have an advantage;\nqualifications in one of the following fields: economics, business administration, finance, statistics, accounting, law, data science, political science, European studies, international relations, journalism and communications, environmental studies/sciences, psychology, sociology, human resources, languages, information technology, engineering, mathematics, chemistry, physics or facility management;\na clear interest in and understanding of European affairs, central banking, banking supervision and matters of relevance to ECB business areas;\nhands-on experience with artificial intelligence and/or digital analytics;\nan advanced (C1) command of English and an intermediate (B1) command of at least one other official language of the EU, according to the\nCommon European Framework of Reference for Languages.\nDesired:\nExperience in one or several of the following fields:\ndata management, statistical and econometric analysis and data visualisation;\nmedia relations, including monitoring and analysis, and web and social media production;\ngeneral application and system programming.\nYou engage collaboratively with others. You pursue team goals and learn willingly from other people’s diverse perspectives. You signal any need for change by explaining it and proposing alternative solutions. You analyse complex information effectively and can evaluate different views to arrive at solutions. You know and anticipate stakeholder needs.\nYou are motivated to contribute to the ECB’s mission, to serve the citizens of the EU as a member of a public institution and to work with colleagues from all over Europe.\nYou are motivated to be part of our team and to develop and use your skills and competencies to achieve the aims of this position.\nYou are aware of your strengths and areas for development and know what motivates you to perform at your highest level.\nWorking modalities\nThis is a two-year fixed-term contract from 1 September 2026 until 31 August 2028. While on the Graduate Programme and after completing the probationary period, Graduate Programme participants can apply for vacancies that are advertised both internally and externally.\nGraduate Programme participants may apply for their participation to be extended by one year until 31 August 2029 once they have completed 18 months in the programme.\nUpon completion of the two-year Graduate Programme, the position and salary of participants who have not been appointed to another position at the ECB will be upgraded to expert level (F/G band) for the period of the extension granted. Thereafter, business areas can also directly appoint successful graduates to available expert level (F/G band) positions without further recruitment.\nFurther information\nYou can find additional information on the Graduate Programme on our website (\nhttps://www.ecb.europa.eu/careers/what-we-offer/graduate/html/index.en.html\n).\nApplication and selection process\nThe recruitment process for this position will include a written exercise and a panel interview. The process is expected to run between March and May 2026.\nIf you are not selected for this position but are still considered suitable, you will be placed on a reserve list (see step 4 of\nHow we hire\n), from which you might be considered for similar positions within the ECB.\nFind out\nhow to apply\nfor a position at the ECB.\nRead more about\nhow you can join us\n.\nApply\nShare\nBack to search results",
        "application_url": "https://talent.ecb.europa.eu/careers/ApplicationMethods?jobId=13093",
        "metadata": {
            "Type of contract": "Two-year fixed-term contract starting on 1 September. It may be extended for one additional year upon successful completion of the programme.",
            "Who can apply?": "EU nationals",
            "Salary": "E/F (bracket 1 - step 1) full time monthly net salary: €4,982 plus benefits, for further information seewhat we offer.",
            "Working time": "Full time",
            "Place of work": "Frankfurt am Main, Germany",
            "Closing date": "13.02.2026",
            "Your team": "We are looking for 15 highly talented recent graduates with a postgraduate degree, and preferably a PhD,  to join the ECB’s Graduate Programme.Applicants’ profiles will vary in terms of age, background and interests and, if successful, you will discover intellectual challenges, varied opportunities and a people-centred working culture that gives you a voice and the chance to make an impact – for Europe.We will give you two challenging one-year assignments in two different business areas, matched to our organisational needs and considering your fields of expertise and your interests – which you can indicate during the application process This gives you the opportunity to apply your knowledge in various ways.During the second year of the Graduate Programme, you will choose, together with business area managers, a topic for a paper that you will prepare and submit before the end of the second year. Your successful completion of the programme will be assessed by the Graduate Programme Committee on the basis of performance reviews and your project paper.The ECB is an inclusive employer and we strive to reflect the diversity of the population we serve. We encourage you to apply irrespective of age, disability, ethnicity, gender, gender identity, race, religious beliefs, sexual orientation or other characteristics.",
            "Your role": "The Graduate Programme offers you excellent development opportunities, valuable experience and an insight into the ECB’s tasks and working methods. It could be your starting point for an exciting career at the ECB, including in ECB Banking Supervision.We will assign you an experienced colleague as a mentor to provide you with support, advice and guidance on participating successfully in the programme. Beyond learning on the job in different teams and tasks, you also have access to a broad range of learning opportunities, including in-house and external training opportunities.You will be part of a multicultural team that strives for continuous innovation to make a positive impact on the lives of European citizens.",
            "Qualifications, experience and skills": "Essential:a master’s degree or PhD (or equivalent) completed between 1 February 2024 and 31 January 2026. Alternatively, if you are due to complete a PhD in 2026, your master’s degree can have been obtained before 1 February 2024. Candidates with a PhD, or who will obtain a PhD in 2026, will have an advantage;qualifications in one of the following fields: economics, business administration, finance, statistics, accounting, law, data science, political science, European studies, international relations, journalism and communications, environmental studies/sciences, psychology, sociology, human resources, languages, information technology, engineering, mathematics, chemistry, physics or facility management;a clear interest in and understanding of European affairs, central banking, banking supervision and matters of relevance to ECB business areas;hands-on experience with artificial intelligence and/or digital analytics;an advanced (C1) command of English and an intermediate (B1) command of at least one other official language of the EU, according to theCommon European Framework of Reference for Languages.Desired:Experience in one or several of the following fields:data management, statistical and econometric analysis and data visualisation;media relations, including monitoring and analysis, and web and social media production;general application and system programming.You engage collaboratively with others. You pursue team goals and learn willingly from other people’s diverse perspectives. You signal any need for change by explaining it and proposing alternative solutions. You analyse complex information effectively and can evaluate different views to arrive at solutions. You know and anticipate stakeholder needs.You are motivated to contribute to the ECB’s mission, to serve the citizens of the EU as a member of a public institution and to work with colleagues from all over Europe.You are motivated to be part of our team and to develop and use your skills and competencies to achieve the aims of this position.You are aware of your strengths and areas for development and know what motivates you to perform at your highest level.",
            "Working modalities": "This is a two-year fixed-term contract from 1 September 2026 until 31 August 2028. While on the Graduate Programme and after completing the probationary period, Graduate Programme participants can apply for vacancies that are advertised both internally and externally.Graduate Programme participants may apply for their participation to be extended by one year until 31 August 2029 once they have completed 18 months in the programme.Upon completion of the two-year Graduate Programme, the position and salary of participants who have not been appointed to another position at the ECB will be upgraded to expert level (F/G band) for the period of the extension granted. Thereafter, business areas can also directly appoint successful graduates to available expert level (F/G band) positions without further recruitment.",
            "Further information": "You can find additional information on the Graduate Programme on our website (https://www.ecb.europa.eu/careers/what-we-offer/graduate/html/index.en.html).",
            "Application and selection process": "The recruitment process for this position will include a written exercise and a panel interview. The process is expected to run between March and May 2026.If you are not selected for this position but are still considered suitable, you will be placed on a reserve list (see step 4 ofHow we hire), from which you might be considered for similar positions within the ECB.Find outhow to applyfor a position at the ECB.Read more abouthow you can join us."
        },
        "link": "https://talent.ecb.europa.eu/careers/JobDetail/Graduate-Programme-2026/13093"
    },
    {
        "title": null,
        "description_html": null,
        "description_text": "Language Services Process Administrator (ESCB/IO)\nCommunication\nCommunications\n13278\nGeneral Information\nType of contract\nShort-term contract, which may be extended to up to 36 months subject to individual performance and organisational needs\nContract end date\n30.04.2027\nWho can apply?\nEU nationals working for national central banks of the ESCB, international governmental organisations or other employers performing central banking or banking supervision tasks within the framework of the Eurosystem\nSalary\nD (bracket 1 - step 1) full time monthly net salary: €5,526 plus benefits, for further information see\nwhat we offer\n.\nRole specialisation\nLanguage Technology\nWorking time\nFull time\nPlace of work\nFrankfurt am Main, Germany\nClosing date\n13.02.2026\nYour team\nYou will be part of the Language Services Division in the Directorate General Communications. We provide translation, editing, proofreading and terminology services in all EU languages to support the ECB’s communication activities and help the institution comply with its reporting obligations. We also offer advice on linguistic matters.\nIn your role as a Language Services Administrator, you will be part of the Workflow and Vendor Management team of around 16 members of staff responsible for providing support to editors, translators and their managers. The team is part of the Language Support and Innovation Section, which focuses on driving operational excellence across the Language Services Division and staying on top of the fast-moving field of language technology. You will also work closely with others in our Directorate General as part of cross-divisional teams handling strategic communication projects or urgent tasks.\nThe ECB is an inclusive employer and we strive to reflect the diversity of the population we serve. We encourage you to apply irrespective of age, disability, ethnicity, gender, gender identity, race, religious beliefs, sexual orientation or other characteristics.\nYour role\nAs a Language Services Administrator you will:\nprocess and coordinate incoming language services requests, liaising with requesters, in-house linguists and other stakeholders;\ncoordinate work allocation;\nlead and manage editing and translation projects, including high-profile multilingual publications and campaigns involving multiple parties and tight deadlines;\ncreate Studio projects/analyses and use internal tools to support language services workflows;\nco-manage a busy shared mailbox, prioritising requests and coordinating tasks effectively within the team;\nevaluate and optimise workflows and processes;\nhelp to onboard and advise newcomers to the Division;\nbuild and maintain effective working relationships with stakeholders within and outside the Section, acting as a trusted point of contact for process-related matters.\nThe position offers you excellent opportunities to gain insights into the work of a language services division in an EU institution and use state-of-the-art language technology. You will be part of a multicultural team that strives for continuous innovation to make a positive impact on the lives of European citizens.\nQualifications, experience and skills\nEssential:\na bachelor’s degree or equivalent in modern languages, translation, business, public administration or another relevant field (see How you can join us for details on degree equivalences);\nin addition to the above, a minimum of three years’ professional experience in process, operations or administrative coordination;\nproven experience in leading end-to-end processes involving multiple stakeholders (e.g. experts, support teams and management), ensuring established procedures and timelines are followed and acting as a central point of contact for process-related queries;\nclear and effective written and verbal communication skills;\nstrong service and stakeholder orientation;\nstrong attention to detail and accuracy, as well as excellent organisational skills;\nthe ability to work autonomously while collaborating effectively within a team and across functions;\nan excellent knowledge of the MS Office package;\nan advanced (C1) command of English and an intermediate (B1) command of at least one other official language of the EU, according to the Common European Framework of Reference for Languages.\nDesired:\nexperience in a language services, translation, content production or other knowledge-intensive operational environment;\nfamiliarity with workflow and/or translation management systems (e.g. Trados Studio).\nYou are recognised as someone who supports others proactively. You work constantly to improve your own output and you learn willingly from other people’s diverse perspectives. You signal any need for change by explaining it and proposing alternative solutions. Your strong capacity for analytical thinking enables you to work with incomplete information and you deliver in line with stakeholder needs.\nYou are motivated to contribute to the ECB’s mission, to serve the citizens of the EU as a member of a public institution and to work with colleagues from all over Europe.\nYou are motivated to be part of our team and to develop and use your skills and competencies to achieve the aims of this position.\nWorking modalities\nTo enable the Division to maintain its business continuity capability, you will occasionally be expected to perform work during non-standard working hours and work at the ECB’s standby sites.\nFurther information\nThe contract offered will be short-term ESCB/IO, the appointment being for 12 months as of the exact starting date of the selected person, extendable to up to 36 months. Candidates must have a contract of employment with their home institution for a period of at least one year beyond the duration of the ECB contract being offered.\nFor additional information on this specific vacancy, you can speak to the hiring manager, Tom Sanders, on +49 (0)69 1344 8852 between 10:00 and 11:00 on Tuesday, 27 January.\nApplication and selection process\nThe recruitment process for this position will be conducted remotely. It will include an interview.\nIf you are not selected for this position but are still considered suitable, you will be placed on a reserve list (see step 4 of\nHow we hire\n), from which you might be considered for similar positions within the ECB.\nFind out\nhow to apply\nfor a position at the ECB.\nRead more about\nhow you can join us\n.\nApply\nShare\nBack to search results",
        "application_url": "https://talent.ecb.europa.eu/careers/ApplicationMethods?jobId=13278",
        "metadata": {
            "Type of contract": "Short-term contract, which may be extended to up to 36 months subject to individual performance and organisational needs",
            "Contract end date": "30.04.2027",
            "Who can apply?": "EU nationals working for national central banks of the ESCB, international governmental organisations or other employers performing central banking or banking supervision tasks within the framework of the Eurosystem",
            "Salary": "D (bracket 1 - step 1) full time monthly net salary: €5,526 plus benefits, for further information seewhat we offer.",
            "Role specialisation": "Language Technology",
            "Working time": "Full time",
            "Place of work": "Frankfurt am Main, Germany",
            "Closing date": "13.02.2026",
            "Your team": "You will be part of the Language Services Division in the Directorate General Communications. We provide translation, editing, proofreading and terminology services in all EU languages to support the ECB’s communication activities and help the institution comply with its reporting obligations. We also offer advice on linguistic matters.In your role as a Language Services Administrator, you will be part of the Workflow and Vendor Management team of around 16 members of staff responsible for providing support to editors, translators and their managers. The team is part of the Language Support and Innovation Section, which focuses on driving operational excellence across the Language Services Division and staying on top of the fast-moving field of language technology. You will also work closely with others in our Directorate General as part of cross-divisional teams handling strategic communication projects or urgent tasks.The ECB is an inclusive employer and we strive to reflect the diversity of the population we serve. We encourage you to apply irrespective of age, disability, ethnicity, gender, gender identity, race, religious beliefs, sexual orientation or other characteristics.",
            "Your role": "As a Language Services Administrator you will:process and coordinate incoming language services requests, liaising with requesters, in-house linguists and other stakeholders;coordinate work allocation;lead and manage editing and translation projects, including high-profile multilingual publications and campaigns involving multiple parties and tight deadlines;create Studio projects/analyses and use internal tools to support language services workflows;co-manage a busy shared mailbox, prioritising requests and coordinating tasks effectively within the team;evaluate and optimise workflows and processes;help to onboard and advise newcomers to the Division;build and maintain effective working relationships with stakeholders within and outside the Section, acting as a trusted point of contact for process-related matters.The position offers you excellent opportunities to gain insights into the work of a language services division in an EU institution and use state-of-the-art language technology. You will be part of a multicultural team that strives for continuous innovation to make a positive impact on the lives of European citizens.",
            "Qualifications, experience and skills": "Essential:a bachelor’s degree or equivalent in modern languages, translation, business, public administration or another relevant field (see How you can join us for details on degree equivalences);in addition to the above, a minimum of three years’ professional experience in process, operations or administrative coordination;proven experience in leading end-to-end processes involving multiple stakeholders (e.g. experts, support teams and management), ensuring established procedures and timelines are followed and acting as a central point of contact for process-related queries;clear and effective written and verbal communication skills;strong service and stakeholder orientation;strong attention to detail and accuracy, as well as excellent organisational skills;the ability to work autonomously while collaborating effectively within a team and across functions;an excellent knowledge of the MS Office package;an advanced (C1) command of English and an intermediate (B1) command of at least one other official language of the EU, according to the Common European Framework of Reference for Languages.Desired:experience in a language services, translation, content production or other knowledge-intensive operational environment;familiarity with workflow and/or translation management systems (e.g. Trados Studio).You are recognised as someone who supports others proactively. You work constantly to improve your own output and you learn willingly from other people’s diverse perspectives. You signal any need for change by explaining it and proposing alternative solutions. Your strong capacity for analytical thinking enables you to work with incomplete information and you deliver in line with stakeholder needs.You are motivated to contribute to the ECB’s mission, to serve the citizens of the EU as a member of a public institution and to work with colleagues from all over Europe.You are motivated to be part of our team and to develop and use your skills and competencies to achieve the aims of this position.",
            "Working modalities": "To enable the Division to maintain its business continuity capability, you will occasionally be expected to perform work during non-standard working hours and work at the ECB’s standby sites.",
            "Further information": "The contract offered will be short-term ESCB/IO, the appointment being for 12 months as of the exact starting date of the selected person, extendable to up to 36 months. Candidates must have a contract of employment with their home institution for a period of at least one year beyond the duration of the ECB contract being offered.For additional information on this specific vacancy, you can speak to the hiring manager, Tom Sanders, on +49 (0)69 1344 8852 between 10:00 and 11:00 on Tuesday, 27 January.",
            "Application and selection process": "The recruitment process for this position will be conducted remotely. It will include an interview.If you are not selected for this position but are still considered suitable, you will be placed on a reserve list (see step 4 ofHow we hire), from which you might be considered for similar positions within the ECB.Find outhow to applyfor a position at the ECB.Read more abouthow you can join us."
        },
        "link": "https://talent.ecb.europa.eu/careers/JobDetail/Language-Services-Process-Administrator-ESCB-IO/13278"
    },
    {
        "title": null,
        "description_html": null,
        "description_text": "PhD traineeship in Directorate General Economics\nEconomics\n13233\nGeneral Information\nType of contract\nPhD traineeship\nWho can apply?\nEU nationals eligible for our traineeship programme\nGrant\nThe trainee grant is €2,120 per month plus an accommodation allowance (see further information section)\nWorking time\nFull time\nPlace of work\nFrankfurt am Main, Germany\nClosing date\n05.02.2026\nYour team\nYou will be part of the Fiscal Policies Division in the Directorate General Economics. Our Division includes around 25 experts who are responsible for assessing the national fiscal policies of EU Member States and the euro area fiscal stance, providing fiscal forecasts and conducting analysis on a variety of topics, such as the fiscal response to the energy crisis and high inflation, the effects of fiscal policy on the macroeconomy, public debt dynamics, fiscal policy and climate change, and the interplay between monetary policy and fiscal policies. The Division is also responsible for analysing issues related to the reform of the EU fiscal framework.\nThe ECB is an inclusive employer and we strive to reflect the diversity of the population we serve. We encourage you to apply irrespective of age, disability, ethnicity, gender, gender identity, race, religious beliefs, sexual orientation or other characteristics.\nYour role\nAs a PhD trainee you will:\nconduct empirical analyses using state-of-the-art economic and econometric models;\ncontribute to the enhancement of analytical, econometric and forecasting tools under the supervision of ECB experts (you may also have the opportunity to submit resulting papers for publication in the ECB’s Working Paper Series and academic journals).\nMore specifically, you will work on one of the following projects:\nexploring the role of artificial intelligence, e.g. methodologies based on machine learning, deep learning and neural networks applied to large datasets, in (i) constructing “sentiment indicators” for fiscal policy, (ii) forecasting fiscal variables (government revenues, expenditures and deficits), and (iii) debt sustainability analysis;\nexploring the impact of fiscal policies on the macroeconomy, including the macroeconomic effects of defence spending, based on both empirical and theoretical models in different phases of the business cycle (which may include contributing to the construction of heterogeneous agent New Keynesian models);\nassessing the role of national and aggregate euro area fiscal policies in climate change mitigation to evaluate debt sustainability risks and explore the trade-off between debt sustainability and the stabilisation function of fiscal policies;\nassessing the recent reform of EU fiscal rules as well as options for the provision of common public goods in the euro area and the EU, risk-sharing mechanisms, the interplay between fiscal rules and market discipline, and the implications of the introduction of a “safe asset” for the euro area;\ndeveloping time-series models for forecasting fiscal variables, including models which combine data sampled at different frequencies, evaluating the impact of revisions in fiscal data and differences between real-time and revised data, and assessing the determinants of forecasting errors of international institutions;\nexploring optimal conditions for the interaction between monetary and fiscal policies when the assumption of perfectly functioning financial markets is abandoned.\nThis traineeship offers you excellent opportunities to build on your skills and track record as an economist. You will be part of a multicultural team that strives for continuous innovation to make a positive impact on the lives of European citizens.\nQualifications, experience and skills\nEssential:\na master’s degree and at least two years of PhD studies in economics, finance, statistics, data science, engineering or a related field;\na sound understanding of and theoretical background in macroeconomics and the economic and institutional context in which the ECB fulfils its mandate, including the role of fiscal policies in the euro area;\nprogramming skills in quantitative software such as MATLAB, Stata, Python or R;\na good knowledge of the MS Office package;\nan advanced (C1) command of English and an intermediate (B1) command of at least one other official language of the EU, according to the\nCommon European Framework of Reference for Languages\n.\nDesired:\nexperience in applying structural vector autoregressions (VARs), panel VARs, global VARs, Bayesian VARs, non-linear VARs (time-varying parameters, Markov switching) and co-integration analysis;\nexperience of factor models and state space/unobserved component models;\nexperience in applying macroeconomic models, e.g. dynamic stochastic general equilibrium models, backward-looking or agent-based models and overlapping generation models, using DYNARE or coding your own procedures;\na publication record that covers issues falling within the Division’s field of responsibility.\nYou are curious and eager to learn, and want to further develop your ability to analyse complex information. You are keen to collaborate with others, pursue team goals and learn from other people’s diverse perspectives. You strive to know and anticipate stakeholder needs, and will signal any need for change and propose alternative solutions.\nYou are motivated to contribute to the ECB’s mission, to serve the citizens of the EU as a member of a public institution and to work with colleagues from all over Europe. You are keen to be part of our team and to use your skills and competencies to achieve the aims of this position.\nFurther information\nInitial PhD traineeship of between three and six months, with a possible extension to up to 12 months in total.\nOther details on the\nconditions applicable to traineeships\nat the ECB can be found on our website.\nFor additional information on this specific vacancy, you can speak to Jacopo Cimadomo on +49 (0)69 1344 8421.\nApplication and selection process\nThe recruitment process for this position will include an online interview.\nFurther information on\nhow to apply\nis available on our website.\nIf you are not selected for this position but are still considered suitable, you will be placed on a reserve list for 12 months from the closing date for applications, from which you might be considered for other traineeship positions within the ECB.\nApply\nShare\nBack to search results",
        "application_url": "https://talent.ecb.europa.eu/careers/ApplicationMethods?jobId=13233",
        "metadata": {
            "Type of contract": "PhD traineeship",
            "Who can apply?": "EU nationals eligible for our traineeship programme",
            "Grant": "The trainee grant is €2,120 per month plus an accommodation allowance (see further information section)",
            "Working time": "Full time",
            "Place of work": "Frankfurt am Main, Germany",
            "Closing date": "05.02.2026",
            "Your team": "You will be part of the Fiscal Policies Division in the Directorate General Economics. Our Division includes around 25 experts who are responsible for assessing the national fiscal policies of EU Member States and the euro area fiscal stance, providing fiscal forecasts and conducting analysis on a variety of topics, such as the fiscal response to the energy crisis and high inflation, the effects of fiscal policy on the macroeconomy, public debt dynamics, fiscal policy and climate change, and the interplay between monetary policy and fiscal policies. The Division is also responsible for analysing issues related to the reform of the EU fiscal framework.The ECB is an inclusive employer and we strive to reflect the diversity of the population we serve. We encourage you to apply irrespective of age, disability, ethnicity, gender, gender identity, race, religious beliefs, sexual orientation or other characteristics.",
            "Your role": "As a PhD trainee you will:conduct empirical analyses using state-of-the-art economic and econometric models;contribute to the enhancement of analytical, econometric and forecasting tools under the supervision of ECB experts (you may also have the opportunity to submit resulting papers for publication in the ECB’s Working Paper Series and academic journals).More specifically, you will work on one of the following projects:exploring the role of artificial intelligence, e.g. methodologies based on machine learning, deep learning and neural networks applied to large datasets, in (i) constructing “sentiment indicators” for fiscal policy, (ii) forecasting fiscal variables (government revenues, expenditures and deficits), and (iii) debt sustainability analysis;exploring the impact of fiscal policies on the macroeconomy, including the macroeconomic effects of defence spending, based on both empirical and theoretical models in different phases of the business cycle (which may include contributing to the construction of heterogeneous agent New Keynesian models);assessing the role of national and aggregate euro area fiscal policies in climate change mitigation to evaluate debt sustainability risks and explore the trade-off between debt sustainability and the stabilisation function of fiscal policies;assessing the recent reform of EU fiscal rules as well as options for the provision of common public goods in the euro area and the EU, risk-sharing mechanisms, the interplay between fiscal rules and market discipline, and the implications of the introduction of a “safe asset” for the euro area;developing time-series models for forecasting fiscal variables, including models which combine data sampled at different frequencies, evaluating the impact of revisions in fiscal data and differences between real-time and revised data, and assessing the determinants of forecasting errors of international institutions;exploring optimal conditions for the interaction between monetary and fiscal policies when the assumption of perfectly functioning financial markets is abandoned.This traineeship offers you excellent opportunities to build on your skills and track record as an economist. You will be part of a multicultural team that strives for continuous innovation to make a positive impact on the lives of European citizens.",
            "Qualifications, experience and skills": "Essential:a master’s degree and at least two years of PhD studies in economics, finance, statistics, data science, engineering or a related field;a sound understanding of and theoretical background in macroeconomics and the economic and institutional context in which the ECB fulfils its mandate, including the role of fiscal policies in the euro area;programming skills in quantitative software such as MATLAB, Stata, Python or R;a good knowledge of the MS Office package;an advanced (C1) command of English and an intermediate (B1) command of at least one other official language of the EU, according to theCommon European Framework of Reference for Languages.Desired:experience in applying structural vector autoregressions (VARs), panel VARs, global VARs, Bayesian VARs, non-linear VARs (time-varying parameters, Markov switching) and co-integration analysis;experience of factor models and state space/unobserved component models;experience in applying macroeconomic models, e.g. dynamic stochastic general equilibrium models, backward-looking or agent-based models and overlapping generation models, using DYNARE or coding your own procedures;a publication record that covers issues falling within the Division’s field of responsibility.You are curious and eager to learn, and want to further develop your ability to analyse complex information. You are keen to collaborate with others, pursue team goals and learn from other people’s diverse perspectives. You strive to know and anticipate stakeholder needs, and will signal any need for change and propose alternative solutions.You are motivated to contribute to the ECB’s mission, to serve the citizens of the EU as a member of a public institution and to work with colleagues from all over Europe. You are keen to be part of our team and to use your skills and competencies to achieve the aims of this position.",
            "Further information": "Initial PhD traineeship of between three and six months, with a possible extension to up to 12 months in total.Other details on theconditions applicable to traineeshipsat the ECB can be found on our website.For additional information on this specific vacancy, you can speak to Jacopo Cimadomo on +49 (0)69 1344 8421.",
            "Application and selection process": "The recruitment process for this position will include an online interview.Further information onhow to applyis available on our website.If you are not selected for this position but are still considered suitable, you will be placed on a reserve list for 12 months from the closing date for applications, from which you might be considered for other traineeship positions within the ECB."
        },
        "link": "https://talent.ecb.europa.eu/careers/JobDetail/PhD-traineeship-in-Directorate-General-Economics/13233"
    },
    {
        "title": null,
        "description_html": null,
        "description_text": "Press Οfficer - Digital Euro\nCommunication\nCommunications\n13038\nGeneral Information\nType of contract\nFixed-term contract, which may be extended subject to individual performance and organisational needs\nWho can apply?\nEU nationals\nSalary\nF/G (bracket 1 - step 1) full time monthly net salary: €5,876 plus benefits, for further information see\nwhat we offer\n.\nWorking time\nFull time\nOn-call?\nYes\nPlace of work\nFrankfurt am Main, Germany\nClosing date\n19.02.2026\nYour team\nYou will be part of the Newsroom Division in the Directorate General Communications. Our Directorate is responsible for communicating the official views of the ECB, the Eurosystem, ECB Banking Supervision and the European System of Central Banks. We aim to build trust in the ECB by improving public understanding of its work. We develop and implement internal and external communications strategies and policies via traditional media relations, social media and public affairs.\nIn your role as Press Officer for the Digital Euro, you will communicate about the digital euro project as part of a team of about 40 media and communications professionals. Your team has regular contact with members of the ECB’s Executive Board and Supervisory Board and their respective offices, as well as counterparts across other areas of the ECB, to support the institution’s communications activities and make them more accessible to a broader audience.\nThe ECB is an inclusive employer and we strive to reflect the diversity of the population we serve. We encourage you to apply irrespective of age, disability, ethnicity, gender, gender identity, race, religious beliefs, sexual orientation or other characteristics\nYour role\nAs a Press Officer for Digital Euro you will:\nact as a key contact point for external communications on the digital euro, ensuring proactive and reactive media engagement, crafting proactive messages and narratives, and keeping media representatives informed about the latest developments;\ndevelop and maintain strong relationships with specialised media outlets as well as the broader media and non-traditional channels that can help reach diverse audiences;\ndevelop and lead communications initiatives and packages for the digital euro and potentially for other key topics, ensuring high-quality visibility and impact;\norganise media activities, such as interviews and press briefings, drafting press releases and media statements, responding to media enquiries and designing digital communication and internal communication formats;\nmonitor media, evaluate analytics and assess communications impact, identify trends and sentiment, detect emerging misinformation and disinformation and assess its potential impact, while proposing improvements or adaptations to messaging and activities;\nmanage sensitive topics and demonstrate strong judgement when advising on communication approach including risks, timing and messaging;\ncoordinate interinstitutional media seminars and interactions with national central banks, ensuring a consistent Eurosystem narrative and smooth information flow;\nact as contact point for ECB stakeholders and perform standard press officer tasks, such as on-call duties and press conference tasks.\nThe position offers you an excellent opportunity to demonstrate strong communication and strategic thinking skills as you help make the ECB and the digital euro project better understood. You will be part of a multicultural team that strives for continuous innovation to make a positive impact on the lives of European citizens.\nQualifications, experience and skills\nEssential:\na master’s degree or equivalent in communications, journalism, economics, political science or another relevant field (see\nHow you can join us\nfor details on degree equivalences);\nin addition to the above, minimum of four years’ professional experience in the field of communications, public relations or international relations;\ndemonstrable knowledge of the digital euro project;\na minimum of two years’ professional experience in working at, or with, specialised payments media or retail/consumer press;\nproven experience of stakeholder management, making complex financial topics accessible to diverse audiences and strong judgement on sensitive topics;\nmastery-level (C1) command of English and intermediate (B1) command of at least one other official language of the EU, according to the\nCommon European Framework of Reference for Languages.\nDesired:\nexperience in addressing directly specific target audiences with innovative channels (apps, surveys, testimonials, fairs, events etc.);\nexperience in integrating paid marketing campaigns or media partnerships with social media and traditional media activities.\nYou engage collaboratively with others. You pursue team goals and learn willingly from other people’s diverse perspectives. You signal any need for change by explaining it and proposing alternative solutions. You analyse complex information effectively and can evaluate different views to arrive at solutions. You know and anticipate stakeholder needs.\nYou are motivated to contribute to the ECB’s mission, to serve the citizens of the EU as a member of a public institution and to work with colleagues from all over Europe.\nYou are motivated to be part of our team and to develop and use your skills and competencies to achieve the aims of this position.\nWorking modalities\nTo enable the Division to maintain its business continuity capability, you will occasionally be expected to perform work during non-standard working hours and at the ECB’s standby sites.\nFurther information\nTemporary appointments may be extended or made permanent subject to organisational needs and budgetary constraints. This may result in a staff member with a non-convertible fixed-term contract being offered a convertible contract in accordance with the ECB Conditions of Employment.\nThe contract offered will be fixed-term, the appointment being till 31 March 2028.\nFor additional information on this specific vacancy, you can speak to William Lelieveldt, lead press officer on +49 170 227 9090 or Eszter Miltényi-Torstensson, lead press officer on +49 171 769 5305 on Tuesday, 10 February between 12:00 and 13:00\nApplication and selection process\nThe recruitment process for this position will be conducted remotely. It will include a written exercise, a presentation and an interview.\nIf you are not selected for this position but are still considered suitable, you will be placed on a reserve list (see step 4 of\nHow we hire\n), from which you might be considered for similar positions within the ECB.\nFind out\nhow to apply\nfor a position at the ECB.\nRead more about\nhow you can join us\n.\nApply\nShare\nBack to search results",
        "application_url": "https://talent.ecb.europa.eu/careers/ApplicationMethods?jobId=13038",
        "metadata": {
            "Type of contract": "Fixed-term contract, which may be extended subject to individual performance and organisational needs",
            "Who can apply?": "EU nationals",
            "Salary": "F/G (bracket 1 - step 1) full time monthly net salary: €5,876 plus benefits, for further information seewhat we offer.",
            "Working time": "Full time",
            "On-call?": "Yes",
            "Place of work": "Frankfurt am Main, Germany",
            "Closing date": "19.02.2026",
            "Your team": "You will be part of the Newsroom Division in the Directorate General Communications. Our Directorate is responsible for communicating the official views of the ECB, the Eurosystem, ECB Banking Supervision and the European System of Central Banks. We aim to build trust in the ECB by improving public understanding of its work. We develop and implement internal and external communications strategies and policies via traditional media relations, social media and public affairs.In your role as Press Officer for the Digital Euro, you will communicate about the digital euro project as part of a team of about 40 media and communications professionals. Your team has regular contact with members of the ECB’s Executive Board and Supervisory Board and their respective offices, as well as counterparts across other areas of the ECB, to support the institution’s communications activities and make them more accessible to a broader audience.The ECB is an inclusive employer and we strive to reflect the diversity of the population we serve. We encourage you to apply irrespective of age, disability, ethnicity, gender, gender identity, race, religious beliefs, sexual orientation or other characteristics",
            "Your role": "As a Press Officer for Digital Euro you will:act as a key contact point for external communications on the digital euro, ensuring proactive and reactive media engagement, crafting proactive messages and narratives, and keeping media representatives informed about the latest developments;develop and maintain strong relationships with specialised media outlets as well as the broader media and non-traditional channels that can help reach diverse audiences;develop and lead communications initiatives and packages for the digital euro and potentially for other key topics, ensuring high-quality visibility and impact;organise media activities, such as interviews and press briefings, drafting press releases and media statements, responding to media enquiries and designing digital communication and internal communication formats;monitor media, evaluate analytics and assess communications impact, identify trends and sentiment, detect emerging misinformation and disinformation and assess its potential impact, while proposing improvements or adaptations to messaging and activities;manage sensitive topics and demonstrate strong judgement when advising on communication approach including risks, timing and messaging;coordinate interinstitutional media seminars and interactions with national central banks, ensuring a consistent Eurosystem narrative and smooth information flow;act as contact point for ECB stakeholders and perform standard press officer tasks, such as on-call duties and press conference tasks.The position offers you an excellent opportunity to demonstrate strong communication and strategic thinking skills as you help make the ECB and the digital euro project better understood. You will be part of a multicultural team that strives for continuous innovation to make a positive impact on the lives of European citizens.",
            "Qualifications, experience and skills": "Essential:a master’s degree or equivalent in communications, journalism, economics, political science or another relevant field (seeHow you can join usfor details on degree equivalences);in addition to the above, minimum of four years’ professional experience in the field of communications, public relations or international relations;demonstrable knowledge of the digital euro project;a minimum of two years’ professional experience in working at, or with, specialised payments media or retail/consumer press;proven experience of stakeholder management, making complex financial topics accessible to diverse audiences and strong judgement on sensitive topics;mastery-level (C1) command of English and intermediate (B1) command of at least one other official language of the EU, according to theCommon European Framework of Reference for Languages.Desired:experience in addressing directly specific target audiences with innovative channels (apps, surveys, testimonials, fairs, events etc.);experience in integrating paid marketing campaigns or media partnerships with social media and traditional media activities.You engage collaboratively with others. You pursue team goals and learn willingly from other people’s diverse perspectives. You signal any need for change by explaining it and proposing alternative solutions. You analyse complex information effectively and can evaluate different views to arrive at solutions. You know and anticipate stakeholder needs.You are motivated to contribute to the ECB’s mission, to serve the citizens of the EU as a member of a public institution and to work with colleagues from all over Europe.You are motivated to be part of our team and to develop and use your skills and competencies to achieve the aims of this position.",
            "Working modalities": "To enable the Division to maintain its business continuity capability, you will occasionally be expected to perform work during non-standard working hours and at the ECB’s standby sites.",
            "Further information": "Temporary appointments may be extended or made permanent subject to organisational needs and budgetary constraints. This may result in a staff member with a non-convertible fixed-term contract being offered a convertible contract in accordance with the ECB Conditions of Employment.The contract offered will be fixed-term, the appointment being till 31 March 2028.For additional information on this specific vacancy, you can speak to William Lelieveldt, lead press officer on +49 170 227 9090 or Eszter Miltényi-Torstensson, lead press officer on +49 171 769 5305 on Tuesday, 10 February between 12:00 and 13:00",
            "Application and selection process": "The recruitment process for this position will be conducted remotely. It will include a written exercise, a presentation and an interview.If you are not selected for this position but are still considered suitable, you will be placed on a reserve list (see step 4 ofHow we hire), from which you might be considered for similar positions within the ECB.Find outhow to applyfor a position at the ECB.Read more abouthow you can join us."
        },
        "link": "https://talent.ecb.europa.eu/careers/JobDetail/Press-fficer-Digital-Euro/13038"
    },
    {
        "title": null,
        "description_html": null,
        "description_text": "Trainee Irish Translator\nCommunications\n13245\nGeneral Information\nType of contract\nTraineeship\nWho can apply?\nEU nationals eligible for our traineeship programme\nGrant\nThe trainee grant is €1,170 per month plus an accommodation allowance (see further information section)\nWorking time\nFull time\nPlace of work\nFrankfurt am Main, Germany\nClosing date\n11.02.2026\nYour team\nYou will be part of the Language Services Division in the Directorate General Communications. We provide translation, editing, proofreading and terminology services in all EU languages, as well as offering advice on linguistic matters. Our work covers a wide range of texts for both expert audiences and the general public and includes multilingual content for our website aimed at making the ECB’s work accessible to non-expert readers.\nAs a trainee Irish Translator, you will join one of the Division’s multilingual sections, working closely with other translators and editors, language technologists/terminologists and our administrative team, as well as experts from across the ECB. You will also work closely with others in our Directorate General as part of cross-divisional teams handling strategic communication projects or urgent tasks.\nThe ECB is an inclusive employer and we strive to reflect the diversity of the population we serve. We encourage you to apply irrespective of age, disability, ethnicity, gender, gender identity, race, religious beliefs, sexual orientation or other characteristics.\nYour role\nAs a trainee Irish Translator you will:\ntranslate (non-legal) texts from English into Irish;\nrevise and proofread texts in Irish;\nhelp to identify, extract and compile terminology, particularly in the fields of economics and finance;\ncontribute to the Irish team’s other responsibilities, such as maintaining translation memories and providing linguistic advice.\nThe traineeship offers you excellent opportunities to use state-of-the-art language technology tools in your daily work and to gain insight into language services in an EU institution. You will be part of a multicultural team that strives for continuous innovation to make a positive impact on the lives of European citizens.\nQualifications, experience and skills\nEssential:\na bachelor’s degree or higher in modern languages or translation;\na mastery-level (C2) command of Irish and an advanced (C1) command of English, according to the\nCommon European Framework of Reference for Languages\n.\nDesired:\na master’s degree (completed or in the final stages of completion) in modern languages or translation;\nfamiliarity with computer-assisted translation tools;\nexperience of translating English texts into Irish;\nan intermediate (B1) command of another official EU language;\nan interest in financial and economic affairs.\nYou are curious and eager to learn, and want to further develop your ability to analyse complex information. You are keen to collaborate with others, pursue team goals and learn from other people’s diverse perspectives. You strive to know and anticipate stakeholder needs, and will signal any need for change and propose alternative solutions.\nYou are motivated to contribute to the ECB’s mission, to serve the citizens of the EU as a member of a public institution and to work with colleagues from all over Europe. You are keen to be part of our team and to use your skills and competencies to achieve the aims of this position.\nFurther information\nInitial traineeship of between 3 and 6 months, with a possible extension to up to 12 months in total.\nOther details on the\nconditions applicable to traineeships\nat the ECB can be found on our website.\nApplicants who have completed university courses on translation from English into Irish are encouraged to provide a list of these courses, together with the grades achieved, and/or a letter of recommendation from a relevant supervisor or faculty member. These documents should be in Irish or English.\nApplication and selection process\nThe recruitment process for this position will include a remote written exercise in the pre-selection phase and – if you are invited to participate in the subsequent selection phase – an online interview.\nFurther information on\nhow to apply\nis available on our website.\nIf you are not selected for this position but are still considered suitable, you will be placed on a reserve list for 12 months from the closing date for applications, from which you might be considered for other traineeship positions within the ECB.\nApply\nShare\nBack to search results",
        "application_url": "https://talent.ecb.europa.eu/careers/ApplicationMethods?jobId=13245",
        "metadata": {
            "Type of contract": "Traineeship",
            "Who can apply?": "EU nationals eligible for our traineeship programme",
            "Grant": "The trainee grant is €1,170 per month plus an accommodation allowance (see further information section)",
            "Working time": "Full time",
            "Place of work": "Frankfurt am Main, Germany",
            "Closing date": "11.02.2026",
            "Your team": "You will be part of the Language Services Division in the Directorate General Communications. We provide translation, editing, proofreading and terminology services in all EU languages, as well as offering advice on linguistic matters. Our work covers a wide range of texts for both expert audiences and the general public and includes multilingual content for our website aimed at making the ECB’s work accessible to non-expert readers.As a trainee Irish Translator, you will join one of the Division’s multilingual sections, working closely with other translators and editors, language technologists/terminologists and our administrative team, as well as experts from across the ECB. You will also work closely with others in our Directorate General as part of cross-divisional teams handling strategic communication projects or urgent tasks.The ECB is an inclusive employer and we strive to reflect the diversity of the population we serve. We encourage you to apply irrespective of age, disability, ethnicity, gender, gender identity, race, religious beliefs, sexual orientation or other characteristics.",
            "Your role": "As a trainee Irish Translator you will:translate (non-legal) texts from English into Irish;revise and proofread texts in Irish;help to identify, extract and compile terminology, particularly in the fields of economics and finance;contribute to the Irish team’s other responsibilities, such as maintaining translation memories and providing linguistic advice.The traineeship offers you excellent opportunities to use state-of-the-art language technology tools in your daily work and to gain insight into language services in an EU institution. You will be part of a multicultural team that strives for continuous innovation to make a positive impact on the lives of European citizens.",
            "Qualifications, experience and skills": "Essential:a bachelor’s degree or higher in modern languages or translation;a mastery-level (C2) command of Irish and an advanced (C1) command of English, according to theCommon European Framework of Reference for Languages.Desired:a master’s degree (completed or in the final stages of completion) in modern languages or translation;familiarity with computer-assisted translation tools;experience of translating English texts into Irish;an intermediate (B1) command of another official EU language;an interest in financial and economic affairs.You are curious and eager to learn, and want to further develop your ability to analyse complex information. You are keen to collaborate with others, pursue team goals and learn from other people’s diverse perspectives. You strive to know and anticipate stakeholder needs, and will signal any need for change and propose alternative solutions.You are motivated to contribute to the ECB’s mission, to serve the citizens of the EU as a member of a public institution and to work with colleagues from all over Europe. You are keen to be part of our team and to use your skills and competencies to achieve the aims of this position.",
            "Further information": "Initial traineeship of between 3 and 6 months, with a possible extension to up to 12 months in total.Other details on theconditions applicable to traineeshipsat the ECB can be found on our website.Applicants who have completed university courses on translation from English into Irish are encouraged to provide a list of these courses, together with the grades achieved, and/or a letter of recommendation from a relevant supervisor or faculty member. These documents should be in Irish or English.",
            "Application and selection process": "The recruitment process for this position will include a remote written exercise in the pre-selection phase and – if you are invited to participate in the subsequent selection phase – an online interview.Further information onhow to applyis available on our website.If you are not selected for this position but are still considered suitable, you will be placed on a reserve list for 12 months from the closing date for applications, from which you might be considered for other traineeship positions within the ECB."
        },
        "link": "https://talent.ecb.europa.eu/careers/JobDetail/Trainee-Irish-Translator/13245"
    },
    {
        "title": null,
        "description_html": null,
        "description_text": "Traineeship in Human Resources Operations – myHR team\nHuman Resources\n13356\nGeneral Information\nType of contract\nTraineeship\nWho can apply?\nEU nationals eligible for our traineeship programme\nGrant\nThe trainee grant is €1,170 per month plus an accommodation allowance (see further information section)\nWorking time\nFull time\nPlace of work\nFrankfurt am Main, Germany\nClosing date\n17.02.2026\nYour team\nYou will be part of the Employee Services Division in the Directorate General Human Resources. The Division provides integration, health and well-being services and processes salaries, rewards, allowances and pensions. Besides assisting more than 4,000 employees throughout their ECB careers and beyond, we help develop and implement human resources (HR) systems at the ECB and deliver state-of-the-art HR analytics. We constantly review our processes, streamlining them and making them more customer-centric.\nIn your role as a trainee in the myHR team, you will be part of the team responsible for first-line customer support for, and operations around, compensation and benefits, as well as first-line customer support for learning and development. You will work independently on several benefits-related processes, provide customer services to ECB staff, work closely with other team members and gain insights into the different core operations of an HR department.\nThe ECB is an inclusive employer and we strive to reflect the diversity of the population we serve. We encourage you to apply irrespective of age, disability, ethnicity, gender, gender identity, race, religious beliefs, sexual orientation or other characteristics.\nYour role\nAs a trainee in the myHR team you will:\nbe responsible for a subset of benefit-related processes;\nanswer staff members’ questions on benefits and on learning and development-related topics;\nsupport the analytical work of the team such as data reporting, analysis, quality checks and visualisation;\nhelp to streamline, improve and digitalise human resources practices and business processes related to compensation and benefits;\nhave the chance to participate in project work, depending on your interests and qualifications.\nThe traineeship offers you excellent opportunities to gain experience working in HR, particularly in daily operations using SAP Human Capital Management (HCM) and the service management solution SMAX.\nYou will be part of a multicultural team that strives for continuous innovation to make a positive impact on the lives of European citizens.\nQualifications, experience and skills\nEssential:\na bachelor’s degree or higher in human resources management, business administration, employment and/or industrial relations, social or organisational psychology, accounting, business information systems, business analytics or another relevant discipline;\nan eye for detail and an interest in administering processes and delivering consistent and reliable quality;\ngreat customer service skills;\nexcellent analytical skills;\na good knowledge of the MS Office package;\nan advanced (C1) command of English and an intermediate (B1) command of at least one other official language of the EU, according to the\nCommon European Framework of Reference for Languages\n.\nDesired:\na qualification in human resources;\na good knowledge of data analysis, reporting and visualisation.\nYou are curious and eager to learn, and want to further develop your ability to analyse complex information. You are keen to collaborate with others, pursue team goals and learn from other people’s diverse perspectives. You strive to know and anticipate stakeholder needs, and will signal any need for change and propose alternative solutions.\nYou are motivated to contribute to the ECB’s mission, to serve the citizens of the EU as a member of a public institution and to work with colleagues from all over Europe. You are keen to be part of our team and to use your skills and competencies to achieve the aims of this position.\nFurther information\nInitial traineeship of six months, with a possible extension to up to 12 months in total.\nOther details on the\nconditions applicable to traineeships\nat the ECB can be found on our website.\nApplication and selection process\nThe recruitment process for this position will include an online interview. During this interview the candidate will be given time to perform a short task in writing.\nFurther information on\nhow to apply\nis available on our website.\nIf you are not selected for this position but are still considered suitable, you will be placed on a reserve list for 12 months from the closing date for applications, from which you might be considered for other traineeship positions within the ECB.\nApply\nShare\nBack to search results",
        "application_url": "https://talent.ecb.europa.eu/careers/ApplicationMethods?jobId=13356",
        "metadata": {
            "Type of contract": "Traineeship",
            "Who can apply?": "EU nationals eligible for our traineeship programme",
            "Grant": "The trainee grant is €1,170 per month plus an accommodation allowance (see further information section)",
            "Working time": "Full time",
            "Place of work": "Frankfurt am Main, Germany",
            "Closing date": "17.02.2026",
            "Your team": "You will be part of the Employee Services Division in the Directorate General Human Resources. The Division provides integration, health and well-being services and processes salaries, rewards, allowances and pensions. Besides assisting more than 4,000 employees throughout their ECB careers and beyond, we help develop and implement human resources (HR) systems at the ECB and deliver state-of-the-art HR analytics. We constantly review our processes, streamlining them and making them more customer-centric.In your role as a trainee in the myHR team, you will be part of the team responsible for first-line customer support for, and operations around, compensation and benefits, as well as first-line customer support for learning and development. You will work independently on several benefits-related processes, provide customer services to ECB staff, work closely with other team members and gain insights into the different core operations of an HR department.The ECB is an inclusive employer and we strive to reflect the diversity of the population we serve. We encourage you to apply irrespective of age, disability, ethnicity, gender, gender identity, race, religious beliefs, sexual orientation or other characteristics.",
            "Your role": "As a trainee in the myHR team you will:be responsible for a subset of benefit-related processes;answer staff members’ questions on benefits and on learning and development-related topics;support the analytical work of the team such as data reporting, analysis, quality checks and visualisation;help to streamline, improve and digitalise human resources practices and business processes related to compensation and benefits;have the chance to participate in project work, depending on your interests and qualifications.The traineeship offers you excellent opportunities to gain experience working in HR, particularly in daily operations using SAP Human Capital Management (HCM) and the service management solution SMAX.You will be part of a multicultural team that strives for continuous innovation to make a positive impact on the lives of European citizens.",
            "Qualifications, experience and skills": "Essential:a bachelor’s degree or higher in human resources management, business administration, employment and/or industrial relations, social or organisational psychology, accounting, business information systems, business analytics or another relevant discipline;an eye for detail and an interest in administering processes and delivering consistent and reliable quality;great customer service skills;excellent analytical skills;a good knowledge of the MS Office package;an advanced (C1) command of English and an intermediate (B1) command of at least one other official language of the EU, according to theCommon European Framework of Reference for Languages.Desired:a qualification in human resources;a good knowledge of data analysis, reporting and visualisation.You are curious and eager to learn, and want to further develop your ability to analyse complex information. You are keen to collaborate with others, pursue team goals and learn from other people’s diverse perspectives. You strive to know and anticipate stakeholder needs, and will signal any need for change and propose alternative solutions.You are motivated to contribute to the ECB’s mission, to serve the citizens of the EU as a member of a public institution and to work with colleagues from all over Europe. You are keen to be part of our team and to use your skills and competencies to achieve the aims of this position.",
            "Further information": "Initial traineeship of six months, with a possible extension to up to 12 months in total.Other details on theconditions applicable to traineeshipsat the ECB can be found on our website.",
            "Application and selection process": "The recruitment process for this position will include an online interview. During this interview the candidate will be given time to perform a short task in writing.Further information onhow to applyis available on our website.If you are not selected for this position but are still considered suitable, you will be placed on a reserve list for 12 months from the closing date for applications, from which you might be considered for other traineeship positions within the ECB."
        },
        "link": "https://talent.ecb.europa.eu/careers/JobDetail/Traineeship-in-Human-Resources-Operations-myHR-team/13356"
    },
    {
        "title": null,
        "description_html": null,
        "description_text": "Traineeship in the Business Cycle Analysis Division\nEconomics\n13265\nGeneral Information\nType of contract\nTraineeship\nWho can apply?\nEU nationals eligible for our traineeship programme\nGrant\nThe trainee grant is €1,170 per month plus an accommodation allowance (see further information section)\nWorking time\nFull time\nPlace of work\nFrankfurt am Main, Germany\nClosing date\n11.02.2026\nYour team\nYou will be part of the Business Cycle Analysis Division in the Directorate General Economics. Our Directorate General assesses and forecasts economic developments and provides policy advice on topical economic issues relevant to the euro area economy. Our analysis is published in the ECB’s Economic Bulletin, Occasional Paper Series and Working Paper Series and The ECB Blog.\nThe Business Cycle Analysis Division analyses and forecasts real macroeconomic developments in the largest euro area countries and the euro area as a whole. This involves monitoring business cycles, analysing the main domestic demand components, and developing innovative economic and forecasting tools using state-of-the-art AI techniques, including machine learning, text mining and big data processing. The Division also conducts two major ECB surveys, the\nConsumer Expectations Survey (CES)\nand\nCorporate Telephone Survey (CTS)\n, which play an important role in gaining deeper insights into the behaviour and dynamics of euro area households and firms.\nThe current analytical work of the Division relates to:\nunderstanding the implications monetary policy transmission, supply and demand conditions and uncertainty have for business cycle dynamics, as well as for households’ and firms’ spending, investment and saving decisions;\ndeveloping nowcasting and short-term forecasting tools for economic activity, using state-of-the-art AI techniques;\ninvestigating the heterogeneity of households and firms in driving aggregate economic fluctuations, the impact of recent crises on the behaviour of households and firms, and the varying effects of monetary and fiscal policies;\nimproving forecasting for the euro area and the largest euro area economies, including scenario analysis.\nIn your role as a trainee, you will be part of either the Data Support team or the CES team, both of which have a key function in the Division. The Data Support team is heavily involved in the policy process, including the production of high-quality charts and other inputs to the Division’s regular analysis, as well as the preparation of presentations for Executive Board members and the Directorate General’s senior management. The team is also responsible for maintaining and enhancing the Division’s data infrastructure and tools. The CES team is responsible for the smooth functioning and continuous improvement of the Consumer Expectations Survey, including the regular production of key indicators and publications, and questionnaire design and development. A large part of the team’s work involves maintaining and enhancing the Division’s data infrastructure, visualisation tools and documentation. The team also regularly provides policy-relevant insights on the saving and consumption behaviour of euro area consumers by analysing CES microdata.\nThe ECB is an inclusive employer, and we strive to reflect the diversity of the population we serve. We encourage you to apply irrespective of age, disability, ethnicity, gender, gender identity, race, religious beliefs, sexual orientation or other characteristics.\nYour role\nAs a trainee you will:\nsupport the Division with policy-relevant assignments, working closely with other members of your team and the Division’s economists;\nprepare tables and charts for internal and external reports, and presentations for Executive Board members and the Directorate General’s senior management in collaboration with other business areas;\nmaintain and enhance the Division’s data infrastructure, including processing, consolidating and transforming datasets, maintaining and developing databases and visualisation tools and assisting in automating and adapting regular work processes;\ncontribute to the formulation of policy advice to support policymakers and the Division’s broader economic assessments, using data analytics and statistical and econometric tools;\ncontribute to the improvement of analytical, econometric and forecasting tools.\nThe traineeship offers you excellent opportunities to develop your quantitative skills, contribute to analytical tasks and work with experienced economists on topical economic issues. It also provides you with a unique opportunity to gain insights into economic analysis and policy decision-making in a central bank. You will be part of a multicultural team that strives for continuous innovation to make a positive impact on the lives of European citizens.\nQualifications, experience and skills\nEssential:\na bachelor’s degree or higher in economics, statistics, data science or another relevant field;\npractical experience of working with databases, including data quality validation, and preparing charts and tables for reports and presentations;\npractical experience of working with statistical/econometric software such as Stata, Python, R, EViews and/or MATLAB;\nan interest in supporting policy advice through applied economic analysis;\na good knowledge of the MS Office package, particularly Excel and PowerPoint;\nan advanced (C1) command of English and an intermediate (B1) command of at least one other official language of the EU, according to the\nCommon European Framework of Reference for Languages\n.\nDesired:\na master’s degree in economics, statistics, data science or another relevant field;\na broad knowledge of macroeconomics;\na solid background in econometrics (in particular time series econometrics, the econometrics of panel data and microeconometrics) or statistics;\nexperience in working with relational databases, using SQL and/or other big data analytics tools;\nexperience in using and/or developing visualisation tools, such as R Shiny, Shiny for Python and/or Plotly/Dash;\nknowledge of, or experience in, data science (for example text analysis, machine learning or other advanced machine learning techniques);\na good understanding of economic issues related to the household and corporate sectors, the business cycle and the current macroeconomic climate.\nYou are curious and eager to learn, and want to further develop your ability to analyse complex information. You are keen to collaborate with others, pursue team goals and learn from other people’s diverse perspectives. You strive to know and anticipate stakeholder needs, and will signal any need for change and propose alternative solutions.\nYou are motivated to contribute to the ECB’s mission, to serve the citizens of the EU as a member of a public institution and to work with colleagues from all over Europe. You are keen to be part of our team and to use your skills and competencies to achieve the aims of this position.\nFurther information\nInitial traineeship of between 3 and 6 months, with a possible extension to up to 12 months in total. The starting dates will be from May 2026.\nOther details on the\nconditions applicable to traineeships\nat the ECB can be found on our website.\nApplication and selection process\nThe recruitment process for this position will include an online interview.\nFurther information on\nhow to apply\nis available on our website.\nIf you are not selected for this position but are still considered suitable, you will be placed on a reserve list for 12 months from the closing date for applications, from which you might be considered for other traineeship positions within the ECB.\nApply\nShare\nBack to search results",
        "application_url": "https://talent.ecb.europa.eu/careers/ApplicationMethods?jobId=13265",
        "metadata": {
            "Type of contract": "Traineeship",
            "Who can apply?": "EU nationals eligible for our traineeship programme",
            "Grant": "The trainee grant is €1,170 per month plus an accommodation allowance (see further information section)",
            "Working time": "Full time",
            "Place of work": "Frankfurt am Main, Germany",
            "Closing date": "11.02.2026",
            "Your team": "You will be part of the Business Cycle Analysis Division in the Directorate General Economics. Our Directorate General assesses and forecasts economic developments and provides policy advice on topical economic issues relevant to the euro area economy. Our analysis is published in the ECB’s Economic Bulletin, Occasional Paper Series and Working Paper Series and The ECB Blog.The Business Cycle Analysis Division analyses and forecasts real macroeconomic developments in the largest euro area countries and the euro area as a whole. This involves monitoring business cycles, analysing the main domestic demand components, and developing innovative economic and forecasting tools using state-of-the-art AI techniques, including machine learning, text mining and big data processing. The Division also conducts two major ECB surveys, theConsumer Expectations Survey (CES)andCorporate Telephone Survey (CTS), which play an important role in gaining deeper insights into the behaviour and dynamics of euro area households and firms.The current analytical work of the Division relates to:understanding the implications monetary policy transmission, supply and demand conditions and uncertainty have for business cycle dynamics, as well as for households’ and firms’ spending, investment and saving decisions;developing nowcasting and short-term forecasting tools for economic activity, using state-of-the-art AI techniques;investigating the heterogeneity of households and firms in driving aggregate economic fluctuations, the impact of recent crises on the behaviour of households and firms, and the varying effects of monetary and fiscal policies;improving forecasting for the euro area and the largest euro area economies, including scenario analysis.In your role as a trainee, you will be part of either the Data Support team or the CES team, both of which have a key function in the Division. The Data Support team is heavily involved in the policy process, including the production of high-quality charts and other inputs to the Division’s regular analysis, as well as the preparation of presentations for Executive Board members and the Directorate General’s senior management. The team is also responsible for maintaining and enhancing the Division’s data infrastructure and tools. The CES team is responsible for the smooth functioning and continuous improvement of the Consumer Expectations Survey, including the regular production of key indicators and publications, and questionnaire design and development. A large part of the team’s work involves maintaining and enhancing the Division’s data infrastructure, visualisation tools and documentation. The team also regularly provides policy-relevant insights on the saving and consumption behaviour of euro area consumers by analysing CES microdata.The ECB is an inclusive employer, and we strive to reflect the diversity of the population we serve. We encourage you to apply irrespective of age, disability, ethnicity, gender, gender identity, race, religious beliefs, sexual orientation or other characteristics.",
            "Your role": "As a trainee you will:support the Division with policy-relevant assignments, working closely with other members of your team and the Division’s economists;prepare tables and charts for internal and external reports, and presentations for Executive Board members and the Directorate General’s senior management in collaboration with other business areas;maintain and enhance the Division’s data infrastructure, including processing, consolidating and transforming datasets, maintaining and developing databases and visualisation tools and assisting in automating and adapting regular work processes;contribute to the formulation of policy advice to support policymakers and the Division’s broader economic assessments, using data analytics and statistical and econometric tools;contribute to the improvement of analytical, econometric and forecasting tools.The traineeship offers you excellent opportunities to develop your quantitative skills, contribute to analytical tasks and work with experienced economists on topical economic issues. It also provides you with a unique opportunity to gain insights into economic analysis and policy decision-making in a central bank. You will be part of a multicultural team that strives for continuous innovation to make a positive impact on the lives of European citizens.",
            "Qualifications, experience and skills": "Essential:a bachelor’s degree or higher in economics, statistics, data science or another relevant field;practical experience of working with databases, including data quality validation, and preparing charts and tables for reports and presentations;practical experience of working with statistical/econometric software such as Stata, Python, R, EViews and/or MATLAB;an interest in supporting policy advice through applied economic analysis;a good knowledge of the MS Office package, particularly Excel and PowerPoint;an advanced (C1) command of English and an intermediate (B1) command of at least one other official language of the EU, according to theCommon European Framework of Reference for Languages.Desired:a master’s degree in economics, statistics, data science or another relevant field;a broad knowledge of macroeconomics;a solid background in econometrics (in particular time series econometrics, the econometrics of panel data and microeconometrics) or statistics;experience in working with relational databases, using SQL and/or other big data analytics tools;experience in using and/or developing visualisation tools, such as R Shiny, Shiny for Python and/or Plotly/Dash;knowledge of, or experience in, data science (for example text analysis, machine learning or other advanced machine learning techniques);a good understanding of economic issues related to the household and corporate sectors, the business cycle and the current macroeconomic climate.You are curious and eager to learn, and want to further develop your ability to analyse complex information. You are keen to collaborate with others, pursue team goals and learn from other people’s diverse perspectives. You strive to know and anticipate stakeholder needs, and will signal any need for change and propose alternative solutions.You are motivated to contribute to the ECB’s mission, to serve the citizens of the EU as a member of a public institution and to work with colleagues from all over Europe. You are keen to be part of our team and to use your skills and competencies to achieve the aims of this position.",
            "Further information": "Initial traineeship of between 3 and 6 months, with a possible extension to up to 12 months in total. The starting dates will be from May 2026.Other details on theconditions applicable to traineeshipsat the ECB can be found on our website.",
            "Application and selection process": "The recruitment process for this position will include an online interview.Further information onhow to applyis available on our website.If you are not selected for this position but are still considered suitable, you will be placed on a reserve list for 12 months from the closing date for applications, from which you might be considered for other traineeship positions within the ECB."
        },
        "link": "https://talent.ecb.europa.eu/careers/JobDetail/Traineeship-in-the-Business-Cycle-Analysis-Division/13265"
    },
    {
        "title": null,
        "description_html": null,
        "description_text": "Traineeship in the Directorate General Economics – Supply Side, Labour and Surveillance Division\nEconomics\n13260\nGeneral Information\nType of contract\nTraineeship\nWho can apply?\nEU nationals eligible for our traineeship programme\nGrant\nThe trainee grant is €1,170 per month plus an accommodation allowance (see further information section)\nWorking time\nFull time\nPlace of work\nFrankfurt am Main, Germany\nClosing date\n20.02.2026\nYour team\nYou will be part of the Supply Side, Labour and Surveillance Division in the Directorate General Economics. Our Division comprises around 30 staff carrying out analytical work which focuses on labour market developments, longer-term productivity trends and other factors driving economic growth and potential output in the euro area, such as innovation, digitalisation, artificial intelligence and policy responses to climate change. The team also conducts country surveillance and cross-country studies, contributes to the Eurosystem macroeconomic projections and looks into economic issues relating to EU governance and policies. We also contribute to ECB publications such as the Economic Bulletin, Annual Report, Working Paper Series and Occasional Paper Series.\nIn your role as a trainee, you will be part of the Division’s Data Centre, which is made up of five trainees and headed by a research analyst. The Data Centre closely collaborates with economists across the Supply Side, Labour and Surveillance Division, supporting and contributing to divisional notes, briefings and publications. This can include producing charts and graphs on labour market and supply-side developments, helping with country monitoring and forecasting, building and maintaining datasets, drafting data commentaries and contributing to analytical projects in collaboration with the Division’s economists.\nThe ECB is an inclusive employer and we strive to reflect the diversity of the population we serve. We encourage you to apply irrespective of age, disability, ethnicity, gender, gender identity, race, religious beliefs, sexual orientation or other characteristics.\nYour role\nAs a trainee you will:\nhelp the team process data and produce charts and graphs;\nparticipate in developing a database infrastructure using both aggregate macro time series data and microdata;\ncontribute to quantitative analysis for economic and policy assessments;\nhelp maintain analytical, econometric and forecasting tools;\ncontribute to the Economic Bulletin and other regular internal and external publications produced by the Directorate General Economics, in collaboration with other business areas within the ECB.\nThe traineeship offers you excellent opportunities to work closely with the Division’s economists and research analysts and to contribute to analytical and policy-related tasks. You will work alongside other trainees and will be assigned a supervisor. You will also be expected to complete tasks on your own initiative and to work independently. You will be part of a multicultural team that strives for continuous innovation to make a positive impact on the lives of European citizens.\nQualifications, experience and skills\nEssential:\na bachelor’s degree or higher in economics, finance, statistics, data science or another relevant field;\na sound understanding of macroeconomics, with a particular focus on labour markets and economic growth;\nexperience with one or more of the following types of economic data: macroeconomic data, firm-level data, high-frequency data, panel data, survey data, other microdata or large datasets (i.e. big data);\na sound understanding of econometrics, including either time series models or applied microeconomics;\nproficiency in econometrics software packages such as MATLAB or Stata;\na good knowledge of the MS Office package;\nan advanced (C1) command of English and an intermediate (B1) command of at least one other official language of the EU, according to the\nCommon European Framework of Reference for Languages\n.\nDesired:\na master’s degree in economics, finance, statistics, data science or another relevant field (completed or close to completion);\nknowledge of programming languages such as R or Python;\nexperience with VBA in Excel and SQL database management;\nknowledge of, or experience in, data science and artificial intelligence (e.g. machine learning techniques, text analysis, large language models and APIs);\nexposure to version control tools such as Git.\nYou are curious and eager to learn, and want to further develop your ability to analyse complex information. You are keen to collaborate with others, pursue team goals and learn from other people’s diverse perspectives. You strive to know and anticipate stakeholder needs, and will signal any need for change and propose alternative solutions.\nYou are motivated to contribute to the ECB’s mission, to serve the citizens of the EU as a member of a public institution and to work with colleagues from all over Europe. You are keen to be part of our team and to use your skills and competencies to achieve the aims of this position.\nFurther information\nInitial traineeship of 6 months, with a possible extension to up to 12 months in total.\nOther details on the\nconditions applicable to traineeships\nat the ECB can be found on our website.\nFor additional information on this specific vacancy, you can speak to Daphne Momferatou on +49 (0)69 1344 5758 between 15:00 and 16:00 on Monday, 9 February.\nApplication and selection process\nThe recruitment process for this position will include an online interview.\nFurther information on\nhow to apply\nis available on our website.\nIf you are not selected for this position but are still considered suitable, you will be placed on a reserve list for 12 months from the closing date for applications, from which you might be considered for other traineeship positions within the ECB.\nApply\nShare\nBack to search results",
        "application_url": "https://talent.ecb.europa.eu/careers/ApplicationMethods?jobId=13260",
        "metadata": {
            "Type of contract": "Traineeship",
            "Who can apply?": "EU nationals eligible for our traineeship programme",
            "Grant": "The trainee grant is €1,170 per month plus an accommodation allowance (see further information section)",
            "Working time": "Full time",
            "Place of work": "Frankfurt am Main, Germany",
            "Closing date": "20.02.2026",
            "Your team": "You will be part of the Supply Side, Labour and Surveillance Division in the Directorate General Economics. Our Division comprises around 30 staff carrying out analytical work which focuses on labour market developments, longer-term productivity trends and other factors driving economic growth and potential output in the euro area, such as innovation, digitalisation, artificial intelligence and policy responses to climate change. The team also conducts country surveillance and cross-country studies, contributes to the Eurosystem macroeconomic projections and looks into economic issues relating to EU governance and policies. We also contribute to ECB publications such as the Economic Bulletin, Annual Report, Working Paper Series and Occasional Paper Series.In your role as a trainee, you will be part of the Division’s Data Centre, which is made up of five trainees and headed by a research analyst. The Data Centre closely collaborates with economists across the Supply Side, Labour and Surveillance Division, supporting and contributing to divisional notes, briefings and publications. This can include producing charts and graphs on labour market and supply-side developments, helping with country monitoring and forecasting, building and maintaining datasets, drafting data commentaries and contributing to analytical projects in collaboration with the Division’s economists.The ECB is an inclusive employer and we strive to reflect the diversity of the population we serve. We encourage you to apply irrespective of age, disability, ethnicity, gender, gender identity, race, religious beliefs, sexual orientation or other characteristics.",
            "Your role": "As a trainee you will:help the team process data and produce charts and graphs;participate in developing a database infrastructure using both aggregate macro time series data and microdata;contribute to quantitative analysis for economic and policy assessments;help maintain analytical, econometric and forecasting tools;contribute to the Economic Bulletin and other regular internal and external publications produced by the Directorate General Economics, in collaboration with other business areas within the ECB.The traineeship offers you excellent opportunities to work closely with the Division’s economists and research analysts and to contribute to analytical and policy-related tasks. You will work alongside other trainees and will be assigned a supervisor. You will also be expected to complete tasks on your own initiative and to work independently. You will be part of a multicultural team that strives for continuous innovation to make a positive impact on the lives of European citizens.",
            "Qualifications, experience and skills": "Essential:a bachelor’s degree or higher in economics, finance, statistics, data science or another relevant field;a sound understanding of macroeconomics, with a particular focus on labour markets and economic growth;experience with one or more of the following types of economic data: macroeconomic data, firm-level data, high-frequency data, panel data, survey data, other microdata or large datasets (i.e. big data);a sound understanding of econometrics, including either time series models or applied microeconomics;proficiency in econometrics software packages such as MATLAB or Stata;a good knowledge of the MS Office package;an advanced (C1) command of English and an intermediate (B1) command of at least one other official language of the EU, according to theCommon European Framework of Reference for Languages.Desired:a master’s degree in economics, finance, statistics, data science or another relevant field (completed or close to completion);knowledge of programming languages such as R or Python;experience with VBA in Excel and SQL database management;knowledge of, or experience in, data science and artificial intelligence (e.g. machine learning techniques, text analysis, large language models and APIs);exposure to version control tools such as Git.You are curious and eager to learn, and want to further develop your ability to analyse complex information. You are keen to collaborate with others, pursue team goals and learn from other people’s diverse perspectives. You strive to know and anticipate stakeholder needs, and will signal any need for change and propose alternative solutions.You are motivated to contribute to the ECB’s mission, to serve the citizens of the EU as a member of a public institution and to work with colleagues from all over Europe. You are keen to be part of our team and to use your skills and competencies to achieve the aims of this position.",
            "Further information": "Initial traineeship of 6 months, with a possible extension to up to 12 months in total.Other details on theconditions applicable to traineeshipsat the ECB can be found on our website.For additional information on this specific vacancy, you can speak to Daphne Momferatou on +49 (0)69 1344 5758 between 15:00 and 16:00 on Monday, 9 February.",
            "Application and selection process": "The recruitment process for this position will include an online interview.Further information onhow to applyis available on our website.If you are not selected for this position but are still considered suitable, you will be placed on a reserve list for 12 months from the closing date for applications, from which you might be considered for other traineeship positions within the ECB."
        },
        "link": "https://talent.ecb.europa.eu/careers/JobDetail/Traineeship-in-the-Directorate-General-Economics-Supply-Side-Labour-and-Surveillance-Division/13260"
    },
    {
        "title": null,
        "description_html": null,
        "description_text": "Traineeship in the Directorate Risk Management\nRisk Management\n13307\nGeneral Information\nType of contract\nTraineeship\nWho can apply?\nEU nationals eligible for our traineeship programme\nGrant\nThe trainee grant is €1,170 per month plus an accommodation allowance (see further information section)\nWorking time\nFull time\nPlace of work\nFrankfurt am Main, Germany\nClosing date\n16.02.2026\nYour team\nYou will be part of the Directorate Risk Management, a dynamic team of professionals developing and maintaining the financial risk management frameworks that govern the Eurosystem’s monetary policy operations and the ECB’s investment operations. Moreover, the Directorate supports the ECB in achieving operational resilience by implementing sound non-financial risk, business continuity and critical incident management practices.\nYou will be working in one of the Directorate’s two divisions that cover financial risk management issues:\nFinancial Risk Analysis monitors the compliance of monetary policy and investment operations with their respective risk management frameworks. It also models, analyses and reports on financial risks.\nFinancial Risk Strategy designs and maintains the risk management frameworks and policies governing Eurosystem credit operations and non-standard monetary policy measures.\nYou will also work closely with colleagues from different teams within the Directorate and from other ECB business areas, in particular the Directorate General Market Operations and the Directorate General Information Systems.\nThe ECB is an inclusive employer and we strive to reflect the diversity of the population we serve. We encourage you to apply irrespective of age, disability, ethnicity, gender, gender identity, race, religious beliefs, sexual orientation or other characteristics.\nYour role\nAs a trainee in the Financial Risk Analysis Division you will:\nlearn about the different risk management frameworks that govern the ECB’s asset purchase programmes and the management of the ECB’s foreign reserves and investment portfolios;\ncontribute to daily, weekly and monthly monitoring and reporting tasks;\ncollect and process data used in our regular financial risk management tasks;\nparticipate in projects and conduct ad hoc analyses to further improve financial risk management processes.\nAs a trainee in the Financial Risk Strategy Division you will:\nlearn about the risk management policies and frameworks governing the Eurosystem’s credit operations and non-standard monetary policy measures, including eligibility requirements, valuations and haircuts;\ncontribute to a range of tasks related to assessing and mitigating credit risk, market risk and climate change and nature-related risk in the Eurosystem’s credit operations;\nperform regular monitoring and reporting tasks and ad hoc analyses to further improve financial risk frameworks;\ncollect and process data used in our regular financial risk management tasks;\ncontribute to presentations and documentation for Eurosystem committee and working group meetings.\nThis traineeship offers you a unique opportunity to learn more about financial risk management at the ECB and how the Eurosystem functions. You will gain hands-on experience of the IT applications, databases and risk methodologies used to analyse credit risk, market risk and other types of risk (e.g. climate change risk) related to assets and issuers of financial instruments as well as the Eurosystem’s counterparties. You will be part of a multicultural team that strives for continuous innovation to make a positive impact on the lives of European citizens.\nQualifications, experience and skills\na bachelor’s degree or higher in finance, economics, business administration, law, STEM subjects (science, technology, engineering or mathematics), computer science or another relevant field;\na keen interest in financial risk management and monetary policy;\nthe ability to process, analyse and interpret data;\nfamiliarity with at least one data processing tool, e.g. Python, MATLAB, SQL, Stata, R, Java, C, Ruby, VBA or Tableau;\na good knowledge of the Microsoft Office package;\nan advanced (C1) command of English and an intermediate (B1) command of at least one other official language of the EU, according to the\nCommon European Framework of Reference for Languages\n.\nYou are curious and eager to learn, and want to further develop your ability to analyse complex information. You are keen to collaborate with others, pursue team goals and learn from other people’s diverse perspectives. You strive to know and anticipate stakeholder needs, and will signal any need for change and propose alternative solutions.\nYou are motivated to contribute to the ECB’s mission, to serve the citizens of the EU as a member of a public institution and to work with colleagues from all over Europe. You are keen to be part of our team and to use your skills and competencies to achieve the aims of this position.\nFurther information\nInitial traineeship of six months, with a possible extension to up to 12 months in total. Different starting dates are possible from 1 July 2026.\nOther details on the\nconditions applicable to traineeships\nat the ECB can be found on our website.\nApplication and selection process\nThe recruitment process for this position will include a remote written exercise in the pre-selection phase and – if you are invited to participate in the subsequent selection phase – an online interview.\nFurther information on\nhow to apply\nis available on our website.\nIf you are not selected for this position but are still considered suitable, you will be placed on a reserve list for 12 months from the closing date for applications, from which you might be considered for other traineeship positions within the ECB.\nApply\nShare\nBack to search results",
        "application_url": "https://talent.ecb.europa.eu/careers/ApplicationMethods?jobId=13307",
        "metadata": {
            "Type of contract": "Traineeship",
            "Who can apply?": "EU nationals eligible for our traineeship programme",
            "Grant": "The trainee grant is €1,170 per month plus an accommodation allowance (see further information section)",
            "Working time": "Full time",
            "Place of work": "Frankfurt am Main, Germany",
            "Closing date": "16.02.2026",
            "Your team": "You will be part of the Directorate Risk Management, a dynamic team of professionals developing and maintaining the financial risk management frameworks that govern the Eurosystem’s monetary policy operations and the ECB’s investment operations. Moreover, the Directorate supports the ECB in achieving operational resilience by implementing sound non-financial risk, business continuity and critical incident management practices.You will be working in one of the Directorate’s two divisions that cover financial risk management issues:Financial Risk Analysis monitors the compliance of monetary policy and investment operations with their respective risk management frameworks. It also models, analyses and reports on financial risks.Financial Risk Strategy designs and maintains the risk management frameworks and policies governing Eurosystem credit operations and non-standard monetary policy measures.You will also work closely with colleagues from different teams within the Directorate and from other ECB business areas, in particular the Directorate General Market Operations and the Directorate General Information Systems.The ECB is an inclusive employer and we strive to reflect the diversity of the population we serve. We encourage you to apply irrespective of age, disability, ethnicity, gender, gender identity, race, religious beliefs, sexual orientation or other characteristics.",
            "Your role": "As a trainee in the Financial Risk Analysis Division you will:learn about the different risk management frameworks that govern the ECB’s asset purchase programmes and the management of the ECB’s foreign reserves and investment portfolios;contribute to daily, weekly and monthly monitoring and reporting tasks;collect and process data used in our regular financial risk management tasks;participate in projects and conduct ad hoc analyses to further improve financial risk management processes.As a trainee in the Financial Risk Strategy Division you will:learn about the risk management policies and frameworks governing the Eurosystem’s credit operations and non-standard monetary policy measures, including eligibility requirements, valuations and haircuts;contribute to a range of tasks related to assessing and mitigating credit risk, market risk and climate change and nature-related risk in the Eurosystem’s credit operations;perform regular monitoring and reporting tasks and ad hoc analyses to further improve financial risk frameworks;collect and process data used in our regular financial risk management tasks;contribute to presentations and documentation for Eurosystem committee and working group meetings.This traineeship offers you a unique opportunity to learn more about financial risk management at the ECB and how the Eurosystem functions. You will gain hands-on experience of the IT applications, databases and risk methodologies used to analyse credit risk, market risk and other types of risk (e.g. climate change risk) related to assets and issuers of financial instruments as well as the Eurosystem’s counterparties. You will be part of a multicultural team that strives for continuous innovation to make a positive impact on the lives of European citizens.",
            "Qualifications, experience and skills": "a bachelor’s degree or higher in finance, economics, business administration, law, STEM subjects (science, technology, engineering or mathematics), computer science or another relevant field;a keen interest in financial risk management and monetary policy;the ability to process, analyse and interpret data;familiarity with at least one data processing tool, e.g. Python, MATLAB, SQL, Stata, R, Java, C, Ruby, VBA or Tableau;a good knowledge of the Microsoft Office package;an advanced (C1) command of English and an intermediate (B1) command of at least one other official language of the EU, according to theCommon European Framework of Reference for Languages.You are curious and eager to learn, and want to further develop your ability to analyse complex information. You are keen to collaborate with others, pursue team goals and learn from other people’s diverse perspectives. You strive to know and anticipate stakeholder needs, and will signal any need for change and propose alternative solutions.You are motivated to contribute to the ECB’s mission, to serve the citizens of the EU as a member of a public institution and to work with colleagues from all over Europe. You are keen to be part of our team and to use your skills and competencies to achieve the aims of this position.",
            "Further information": "Initial traineeship of six months, with a possible extension to up to 12 months in total. Different starting dates are possible from 1 July 2026.Other details on theconditions applicable to traineeshipsat the ECB can be found on our website.",
            "Application and selection process": "The recruitment process for this position will include a remote written exercise in the pre-selection phase and – if you are invited to participate in the subsequent selection phase – an online interview.Further information onhow to applyis available on our website.If you are not selected for this position but are still considered suitable, you will be placed on a reserve list for 12 months from the closing date for applications, from which you might be considered for other traineeship positions within the ECB."
        },
        "link": "https://talent.ecb.europa.eu/careers/JobDetail/Traineeship-in-the-Directorate-Risk-Management/13307"
    },
    {
        "title": null,
        "description_html": null,
        "description_text": "Traineeship in the EU Institutions and Fora Division – DG International and European Relations\nInternational & European Relations\n13327\nGeneral Information\nType of contract\nTraineeship\nWho can apply?\nEU nationals eligible for our traineeship programme\nGrant\nThe trainee grant is €1,170 per month plus an accommodation allowance (see further information section)\nWorking time\nFull time\nPlace of work\nFrankfurt am Main, Germany\nClosing date\n17.02.2026\nYour team\nYou will be part of the EU Institutions and Fora Division in the Directorate General International and European Relations. Our Directorate General has 120 staff preparing policy positions for the ECB, the Eurosystem and the European System of Central Banks on European and global issues.\nThe EU Institutions and Fora Division has approximately 20 staff responsible for preparing the ECB’s policy positions and conducting analytical work on EU institutional and policy issues, often in close coordination with other ECB business areas. The division is committed to providing ECB decision-makers with high-quality policy assessments and positions backed by qualitative and quantitative research. We work on policy dossiers linked to deepening the Economic and Monetary Union. This includes strengthening its economic governance framework and completing the banking and capital markets unions. We also address other EU policy priorities relevant to the ECB’s tasks, including climate change and digital transition. In addition, we act as the primary ECB contact vis-à-vis other EU institutions. We coordinate activities related to the accountability of the ECB for central banking and supervisory tasks, which involves close interactions with the European Parliament. Lastly, we coordinate the ECB’s preparations for meetings of the European Council, the Eurogroup and the ECOFIN, including their preparatory bodies.\nThe ECB is an inclusive employer and we strive to reflect the diversity of the population we serve. We encourage you to apply irrespective of age, disability, ethnicity, gender, gender identity, race, religious beliefs, sexual orientation or other characteristics.\nYour role\nAs a trainee you will:\nsupport the team in the identification and analysis of issues relating to EU integration and governance, the ECB’s accountability and the EU’s internal and external policies;\ncontribute to the development of ECB’s policy positions on the issues mentioned above, underpinned by economic arguments and/or analytical evidence;\ncarry out research and analytical work and contribute to publications on topics related to the Division’s work, including by assisting with data collection and analysis;\nprepare briefing notes for senior ECB staff and decision-making bodies on issues falling within the Division’s remit;\nmonitor and analyse the activities of other EU institutions, including the Council of the EU, the European Commission and the European Parliament.\nThis traineeship offers you excellent opportunities to work at the forefront of policymaking in high-level EU fora and to deepen your understanding of EU policies and interinstitutional relations. It also allows you to develop your technical and policy skills by working with large datasets and state-of-the-art analytical tools to support the development of ECB policy stances, often in collaboration with other ECB business areas. You will work under the guidance of an experienced mentor in a team of highly qualified experts at the crossroads of political economics, international finance and macroeconomics. You will be part of a multicultural team that strives for continuous innovation to make a positive impact on the lives of European citizens.\nQualifications, experience and skills\nEssential:\na bachelor’s degree or higher in economics, econometrics, finance, political science, European studies or another relevant field;\na sound understanding of the set-up and functioning of EU institutions as well as a good knowledge of the functioning of Economic and Monetary Union;\na sound understanding of macroeconomics and/or finance, as demonstrated by completion of relevant courses and/or a relevant publication record;\na sound knowledge of the MS Office package, especially Excel;\nexperience with basic analytical tasks, such as developing descriptive statistics and collecting and managing data;\nan advanced (C1) command of English and an intermediate (B1) command of at least one other official language of the EU, according to the\nCommon European Framework of Reference for Languages\n.\nDesired:\nexperience using statistical/econometric software packages and/or data visualisation software (e.g. Stata, R, Python, Tableau, and/or MATLAB);\nexperience conducting qualitative and/or quantitative research, especially if applied to policy-relevant topics.\nYou are curious and eager to learn, and want to further develop your ability to analyse complex information. You are keen to collaborate with others, pursue team goals and learn from other people’s diverse perspectives. You strive to know and anticipate stakeholder needs, and will signal any need for change and propose alternative solutions.\nYou are motivated to contribute to the ECB’s mission, to serve the citizens of the EU as a member of a public institution and to work with colleagues from all over Europe. You are keen to be part of our team and to use your skills and competencies to achieve the aims of this position.\nFurther information\nInitial traineeship of 6 months, with a possible extension to up to 12 months in total. The start date will be September 2026.\nOther details on the\nconditions applicable to traineeships\nat the ECB can be found on our website.\nApplication and selection process\nThe recruitment process for this position will include a remote written exercise in the pre-selection phase and – if you are invited to participate in the subsequent selection phase – an online interview.\nFurther information on\nhow to apply\nis available on our website.\nIf you are not selected for this position but are still considered suitable, you will be placed on a reserve list for 12 months from the closing date for applications, from which you might be considered for other traineeship positions within the ECB.\nApply\nShare\nBack to search results",
        "application_url": "https://talent.ecb.europa.eu/careers/ApplicationMethods?jobId=13327",
        "metadata": {
            "Type of contract": "Traineeship",
            "Who can apply?": "EU nationals eligible for our traineeship programme",
            "Grant": "The trainee grant is €1,170 per month plus an accommodation allowance (see further information section)",
            "Working time": "Full time",
            "Place of work": "Frankfurt am Main, Germany",
            "Closing date": "17.02.2026",
            "Your team": "You will be part of the EU Institutions and Fora Division in the Directorate General International and European Relations. Our Directorate General has 120 staff preparing policy positions for the ECB, the Eurosystem and the European System of Central Banks on European and global issues.The EU Institutions and Fora Division has approximately 20 staff responsible for preparing the ECB’s policy positions and conducting analytical work on EU institutional and policy issues, often in close coordination with other ECB business areas. The division is committed to providing ECB decision-makers with high-quality policy assessments and positions backed by qualitative and quantitative research. We work on policy dossiers linked to deepening the Economic and Monetary Union. This includes strengthening its economic governance framework and completing the banking and capital markets unions. We also address other EU policy priorities relevant to the ECB’s tasks, including climate change and digital transition. In addition, we act as the primary ECB contact vis-à-vis other EU institutions. We coordinate activities related to the accountability of the ECB for central banking and supervisory tasks, which involves close interactions with the European Parliament. Lastly, we coordinate the ECB’s preparations for meetings of the European Council, the Eurogroup and the ECOFIN, including their preparatory bodies.The ECB is an inclusive employer and we strive to reflect the diversity of the population we serve. We encourage you to apply irrespective of age, disability, ethnicity, gender, gender identity, race, religious beliefs, sexual orientation or other characteristics.",
            "Your role": "As a trainee you will:support the team in the identification and analysis of issues relating to EU integration and governance, the ECB’s accountability and the EU’s internal and external policies;contribute to the development of ECB’s policy positions on the issues mentioned above, underpinned by economic arguments and/or analytical evidence;carry out research and analytical work and contribute to publications on topics related to the Division’s work, including by assisting with data collection and analysis;prepare briefing notes for senior ECB staff and decision-making bodies on issues falling within the Division’s remit;monitor and analyse the activities of other EU institutions, including the Council of the EU, the European Commission and the European Parliament.This traineeship offers you excellent opportunities to work at the forefront of policymaking in high-level EU fora and to deepen your understanding of EU policies and interinstitutional relations. It also allows you to develop your technical and policy skills by working with large datasets and state-of-the-art analytical tools to support the development of ECB policy stances, often in collaboration with other ECB business areas. You will work under the guidance of an experienced mentor in a team of highly qualified experts at the crossroads of political economics, international finance and macroeconomics. You will be part of a multicultural team that strives for continuous innovation to make a positive impact on the lives of European citizens.",
            "Qualifications, experience and skills": "Essential:a bachelor’s degree or higher in economics, econometrics, finance, political science, European studies or another relevant field;a sound understanding of the set-up and functioning of EU institutions as well as a good knowledge of the functioning of Economic and Monetary Union;a sound understanding of macroeconomics and/or finance, as demonstrated by completion of relevant courses and/or a relevant publication record;a sound knowledge of the MS Office package, especially Excel;experience with basic analytical tasks, such as developing descriptive statistics and collecting and managing data;an advanced (C1) command of English and an intermediate (B1) command of at least one other official language of the EU, according to theCommon European Framework of Reference for Languages.Desired:experience using statistical/econometric software packages and/or data visualisation software (e.g. Stata, R, Python, Tableau, and/or MATLAB);experience conducting qualitative and/or quantitative research, especially if applied to policy-relevant topics.You are curious and eager to learn, and want to further develop your ability to analyse complex information. You are keen to collaborate with others, pursue team goals and learn from other people’s diverse perspectives. You strive to know and anticipate stakeholder needs, and will signal any need for change and propose alternative solutions.You are motivated to contribute to the ECB’s mission, to serve the citizens of the EU as a member of a public institution and to work with colleagues from all over Europe. You are keen to be part of our team and to use your skills and competencies to achieve the aims of this position.",
            "Further information": "Initial traineeship of 6 months, with a possible extension to up to 12 months in total. The start date will be September 2026.Other details on theconditions applicable to traineeshipsat the ECB can be found on our website.",
            "Application and selection process": "The recruitment process for this position will include a remote written exercise in the pre-selection phase and – if you are invited to participate in the subsequent selection phase – an online interview.Further information onhow to applyis available on our website.If you are not selected for this position but are still considered suitable, you will be placed on a reserve list for 12 months from the closing date for applications, from which you might be considered for other traineeship positions within the ECB."
        },
        "link": "https://talent.ecb.europa.eu/careers/JobDetail/Traineeship-in-the-EU-Institutions-and-Fora-Division-DG-International-and-European-Relations/13327"
    },
    {
        "title": null,
        "description_html": null,
        "description_text": "Traineeship in the Information Governance Division – Library Services\nSecretariat\n12902\nGeneral Information\nType of contract\nTraineeship\nWho can apply?\nEU nationals eligible for our traineeship programme\nGrant\nThe trainee grant is €1,170 per month plus an accommodation allowance (see further information section)\nWorking time\nFull time\nPlace of work\nFrankfurt am Main, Germany\nClosing date\n02.02.2026\nYour team\nYou will be part of the Information Governance Division in the Directorate General Secretariat. Our Division has around 50 staff members providing the policy framework, services and tools to ensure ECB staff can access and make full use of internal and external knowledge and information.\nThe Library Services team is dedicated to meeting the evolving information needs of ECB staff. We provide support, advanced services and tools that simplify the retrieval, access and use of information. As part of the Information Governance Division, we are also involved in developing services that strengthen the ECB’s knowledge management and collaboration capabilities.\nIn your role as a trainee in Library Services, you will join a dynamic and service-oriented team responsible for:\nproviding knowledge and information management services to support the work of the ECB, including managing our first-level enquiry desk;\nhelping the ECB’s experts find and retrieve information from print and online resources, including specialised databases;\nsupporting the organisation of events, workshops and meetings in the Library;\ncontributing to the maintenance of the Library’s areas;\nexplaining and promoting tools and techniques that can help ECB staff retrieve and use information;\nhelping develop and maintain tailored newsletters and alerts on topics that are relevant to the ECB.\nThe ECB is an inclusive employer and we strive to reflect the diversity of the population we serve. We encourage you to apply irrespective of age, disability, ethnicity, gender, gender identity, race, religious beliefs, sexual orientation or other characteristics.\nYour role\nAs a trainee in Library Services you will:\nprovide reference and research support to library users by helping them find and access information in accordance with the Library’s policy framework;\nsupport library users in borrowing and returning materials, including the processing of renewals and hold requests;\nhelp catalogue and classify information in the ECB library management system;\nkeep the Library’s areas tidy and well organised, for example by shelving books and updating signage;\nparticipate in the sharing of knowledge within the ECB, for example by creating and maintaining subject-specific guides, developing existing awareness services or supporting various initiatives;\ncontribute to the development and implementation of innovative library services and projects, such as testing new AI tools or improving library processes and systems.\nThe traineeship offers you excellent opportunities to gain experience in providing information services in an institutional environment, gain insight into the activities of a central bank and help shape the future of information and knowledge management at the ECB. You will be part of a multicultural team that strives for continuous innovation to make a positive impact on the lives of European citizens.\nQualifications, experience and skills\nEssential:\na bachelor’s degree or higher in information management or library sciences, or in another relevant field such as information technology or knowledge management; or a degree in another field and a postgraduate diploma, master’s degree or higher, or enrolment in a postgraduate course in one of these subjects;\na sound understanding of digital library tools and platforms, such as library management systems, electronic databases and digital repositories;\nan ability to locate, evaluate and use information from both print and digital sources;\nexperience in supporting library or other customers, including addressing enquiries and providing guidance;\na good knowledge of the MS Office package;\nan advanced (C1) command of English and an intermediate (B1) command of at least one other official language of the EU, according to the\nCommon European Framework of Reference for Languages\n.\nDesired:\nexperience in organising events, including venue set-up and real-time troubleshooting;\nan ability to troubleshoot in relation to library resources, user access and technology.\nYou are curious and eager to learn, and want to further develop your ability to analyse complex information. You are keen to collaborate with others, pursue team goals and learn from other people’s diverse perspectives. You strive to know and anticipate stakeholder needs, and will signal any need for change and propose alternative solutions.\nYou are motivated to contribute to the ECB’s mission, to serve the citizens of the EU as a member of a public institution and to work with colleagues from all over Europe. You are keen to be part of our team and to use your skills and competencies to achieve the aims of this position.\nFurther information\nInitial traineeship of six months, with a possible extension to up to 12 months in total.\nOther details on the\nconditions applicable to traineeships\nat the ECB can be found on our website.\nApplication and selection process\nThe recruitment process for this position will include an online interview and a remote written exercise.\nFurther information on\nhow to apply\nis available on our website.\nIf you are not selected for this position but are still considered suitable, you will be placed on a reserve list for 12 months from the closing date for applications, from which you might be considered for other traineeship positions within the ECB.\nApply\nShare\nBack to search results",
        "application_url": "https://talent.ecb.europa.eu/careers/ApplicationMethods?jobId=12902",
        "metadata": {
            "Type of contract": "Traineeship",
            "Who can apply?": "EU nationals eligible for our traineeship programme",
            "Grant": "The trainee grant is €1,170 per month plus an accommodation allowance (see further information section)",
            "Working time": "Full time",
            "Place of work": "Frankfurt am Main, Germany",
            "Closing date": "02.02.2026",
            "Your team": "You will be part of the Information Governance Division in the Directorate General Secretariat. Our Division has around 50 staff members providing the policy framework, services and tools to ensure ECB staff can access and make full use of internal and external knowledge and information.The Library Services team is dedicated to meeting the evolving information needs of ECB staff. We provide support, advanced services and tools that simplify the retrieval, access and use of information. As part of the Information Governance Division, we are also involved in developing services that strengthen the ECB’s knowledge management and collaboration capabilities.In your role as a trainee in Library Services, you will join a dynamic and service-oriented team responsible for:providing knowledge and information management services to support the work of the ECB, including managing our first-level enquiry desk;helping the ECB’s experts find and retrieve information from print and online resources, including specialised databases;supporting the organisation of events, workshops and meetings in the Library;contributing to the maintenance of the Library’s areas;explaining and promoting tools and techniques that can help ECB staff retrieve and use information;helping develop and maintain tailored newsletters and alerts on topics that are relevant to the ECB.The ECB is an inclusive employer and we strive to reflect the diversity of the population we serve. We encourage you to apply irrespective of age, disability, ethnicity, gender, gender identity, race, religious beliefs, sexual orientation or other characteristics.",
            "Your role": "As a trainee in Library Services you will:provide reference and research support to library users by helping them find and access information in accordance with the Library’s policy framework;support library users in borrowing and returning materials, including the processing of renewals and hold requests;help catalogue and classify information in the ECB library management system;keep the Library’s areas tidy and well organised, for example by shelving books and updating signage;participate in the sharing of knowledge within the ECB, for example by creating and maintaining subject-specific guides, developing existing awareness services or supporting various initiatives;contribute to the development and implementation of innovative library services and projects, such as testing new AI tools or improving library processes and systems.The traineeship offers you excellent opportunities to gain experience in providing information services in an institutional environment, gain insight into the activities of a central bank and help shape the future of information and knowledge management at the ECB. You will be part of a multicultural team that strives for continuous innovation to make a positive impact on the lives of European citizens.",
            "Qualifications, experience and skills": "Essential:a bachelor’s degree or higher in information management or library sciences, or in another relevant field such as information technology or knowledge management; or a degree in another field and a postgraduate diploma, master’s degree or higher, or enrolment in a postgraduate course in one of these subjects;a sound understanding of digital library tools and platforms, such as library management systems, electronic databases and digital repositories;an ability to locate, evaluate and use information from both print and digital sources;experience in supporting library or other customers, including addressing enquiries and providing guidance;a good knowledge of the MS Office package;an advanced (C1) command of English and an intermediate (B1) command of at least one other official language of the EU, according to theCommon European Framework of Reference for Languages.Desired:experience in organising events, including venue set-up and real-time troubleshooting;an ability to troubleshoot in relation to library resources, user access and technology.You are curious and eager to learn, and want to further develop your ability to analyse complex information. You are keen to collaborate with others, pursue team goals and learn from other people’s diverse perspectives. You strive to know and anticipate stakeholder needs, and will signal any need for change and propose alternative solutions.You are motivated to contribute to the ECB’s mission, to serve the citizens of the EU as a member of a public institution and to work with colleagues from all over Europe. You are keen to be part of our team and to use your skills and competencies to achieve the aims of this position.",
            "Further information": "Initial traineeship of six months, with a possible extension to up to 12 months in total.Other details on theconditions applicable to traineeshipsat the ECB can be found on our website.",
            "Application and selection process": "The recruitment process for this position will include an online interview and a remote written exercise.Further information onhow to applyis available on our website.If you are not selected for this position but are still considered suitable, you will be placed on a reserve list for 12 months from the closing date for applications, from which you might be considered for other traineeship positions within the ECB."
        },
        "link": "https://talent.ecb.europa.eu/careers/JobDetail/Traineeship-in-the-Information-Governance-Division-Library-Services/12902"
    }
]