[
    {
        "title": "",
        "description_html": null,
        "description_text": "Job Title\nQuality Engineer\nRef #\n58699\nDate posted\nThursday, January 29, 2026\nCountry\nUnited Kingdom\nLocation\nSheffield\nBusiness area\nSheffield\nDepartment\nSheffield\nPosition level\nH - Qualified\nWorking time\nFull Time\nContract type\nFixed Term Contract\nDuration\n48 Months\nWorking pattern\n7:30am - 4:30pm Monday to Friday\nWhat to Expect\nQuality Engineer\nPermanent\nWhen our founder Bruce McLaren passed away at the age of 32 he left behind a legacy that has shaped who we are today. We have an unrivalled heritage which has its roots in racing; but McLaren Automotive is now creating a story of its own and we want you to be a part of it.\nAn exciting opportunity has arisen for a driven individual to join our Quality team as a Quality Engineer within McLaren Composite Technology Centre in Sheffield.\nPurpose of the role:\nIn this capacity, your role and responsibilities will include, but not limited to the following:\n§\nQuality Engineer responsible for composite projects & component delivery at the Sheffield facility\n§\nCreation and maintenance of quality systems and documentation to support new and on-going activities\n§\nCreation and leadership of validation frameworks & activities for new products and processes with cross-functional teams\n§\nProvide dedicated Quality Engineering support for allocated project / area through product lifecycle\n§\nDevelop Quality metrics, drive implementation and report results to the Leadership team\n§\nSupport the team in Root Cause Analysis (RCA) using a Practical Problem-Solving approach\n§\nLead the application of Quality tools (such as PFMEA, SPC and MSA) in the allocated area\n§\nLiaise with Supplier Quality for incoming material issues\n§\nSupport the development of measurement techniques for new products\nWhat You'll Do\nPrincipal accountabilities:\n§\nSupport all aspects of Quality for the assigned areas of responsibility\n§\nApply analytical skills and judgement to generate solutions to technical challenges\n§\nDeliver all aspects of Quality Engineering activities in line with targets, KPIs and milestones\n§\nResponsible for generating and leading validation activities from project inception to completed, fully matured & approved production part approval process documentation (PPAP)\n§\nSupport the containment of Quality Concern Reports (QCR) within 24 hours\n§\nSupport the resolution of Quality concerns using a structured approach to problem solving (PPS , 8D or similar)\n§\nBuild effective cross functional relationships and contribute to achieving a high-performance team environment\nWhat You'll Bring\nKnowledge, skills & experience:\n§\nStrong knowledge & demonstrable experience with Quality Engineering skills, including PFMEA, SPC, MSA, Root Cause Analysis and auditing to established quality standards\n§\nExperience of compiling PPAP documentation & associated validation activities is essential\n§\nExperience of composite production is highly desirable\n§\nExperience in automotive manufacturing is advantageous\n§\nKnowledge of Automotive quality systems is advantageous\n§\nExperience of niche vehicle (low volume) programmes desirable\n§\nExperience of manufacturing using fabrics desirable\n§\nExcellent communication and I.T. skills including Microsoft Office Suite (Excel, PowerPoint & Word)\n§\nExperience of Minitab software is desirable\n§\nExperience of Polyworks, Dataloop, Modus, Trios and SAP desirable but not required\nPersonal Attributes:\n§\nPassionate, enthusiastic and committed, with a can-do attitude\n§\nEffective communication and inter-personal skills\n§\nSelf-driven individual, who can work autonomously and as part of a team\n§\nSelf-directed/manged and motivated towards achieving goals\n§\nExcellent planning and organisations skills\n§\nAbility to build effective relationships and network locally, within the business\n§\nMake complex issues clear and transparent\n§\nAbility to effectively influence, negotiate and use conflict resolution skills\n§\nValid Passport and Driving License\n§\nRight to work in the UK\n§\nFlexible approach to working\nWhat We'll Do for You\nWe recognise that we can only achieve our vision with the dedication and collaboration of our world class employees.  It is our aim to become the employer of choice within the global automotive industry.\nAt McLaren Automotive we are constantly looking to improve. To become the employer of choice we are always looking to develop our employee offerings. We currently offer a range of benefits to employees at all levels of the business including Private Healthcare, Contributory Pension Scheme, Life Assurance and Personal Lease Car Scheme. We also offer a range of discounts with our partner organisations.\nWho Are We?\nNo restraints. No limitations. We don’t simply push boundaries. We completely rethink them. McLaren Automotive exists to create breath-taking performance road cars.\nIt takes a community to do what we do. A diverse group of people with many areas of expertise, united by their passion to deliver visionary products and set new benchmarks.\nMcLaren Automotive commits to equal opportunity for all. Diversity, Equality and Inclusion is at the heart of our impact, it drives our innovation and enables us to truly create something special. Join us on our journey.\n< Back to job list\nApply\nShare this job:\nShare\nLinkedIn\nFacebook\nEmail",
        "application_url": "https://mclarencareers.mclaren.com/careers/Login?jobId=58828",
        "": {},
        "metadata": {
            "Job Title": "Quality Engineer",
            "Ref #": "58699",
            "Date posted": "Thursday, January 29, 2026",
            "Country": "United Kingdom",
            "Location": "Sheffield",
            "Business area": "Sheffield",
            "Department": "Sheffield",
            "Position level": "H - Qualified",
            "Working time": "Full Time",
            "Contract type": "Fixed Term Contract",
            "Duration": "48 Months",
            "Working pattern": "7:30am - 4:30pm Monday to Friday"
        },
        "link": "https://mclarencareers.mclaren.com/careers/JobDetail/Quality-Engineer/58828"
    },
    {
        "title": "",
        "description_html": null,
        "description_text": "Job Title\nQuality Technician\nRef #\n58700\nDate posted\nThursday, January 29, 2026\nCountry\nUnited Kingdom\nLocation\nSheffield\nBusiness area\nSheffield\nDepartment\nSheffield\nPosition level\nJ - Technician / Administrator\nWorking time\nFull Time\nContract type\nFixed Term Contract\nDuration\n48 Months\nWorking pattern\nBlue Shift 40 hours\nWhat to Expect\nPurpose of the role:\nIn this capacity, your role and responsibilities will include, but not limited to, the following:\n§\nSupport all aspects of Quality operations at McLaren Composites Technology Centre\n§\nWork closely with production and engineering teams to ensure quality concerns are contained\n§\nConduct product and process audits to ensure adherence to internal quality management system\nWhat You'll Do\nPrincipal accountabilities:\n§\nConduct product and process audits across both shifts and product lines\n§\nQuality concern resolution via completion of line sweeps and controlling the hold/quarantine status of products\n§\nParticipate in quality concern resolution practical problem-solving process (PPS) with engineering and production teams\n§\nDisposition non-conformances within the MCTC Manufacturing Execution System\n§\nMonitor and resolve issues on Quality equipment such as CMM, Scanning arms and Lab equipment\n§\nUtilisation of quality tools to support new product introduction and existing manufacturing programmes\n§\nConduct product validation checks\n§\nSupport non-standard material and product condition investigations\nWhat You'll Bring\nKnowledge, skills & experience:\n§\nExperience of working in a manufacturing environment is essential\n§\nExperience of working with composites manufacturing processes and in a quality role is advantageous\n§\nUnderstanding of automotive processes (APQP & PPAP) is advantageous but not essential\n§\nAwareness of appropriate health and safety standards is essential\n§\nPC literate with ability to process data in Microsoft excel\n§\nKnowledge of Automotive quality systems is advantageous\n§\nExperience of niche vehicle (low volume) programmes desirable\nPersonal Attributes:\n§\nPassionate, enthusiastic and committed, with a can-do attitude\n§\nEffective communication and inter-personal skills\n§\nA keen eye for detail and customer focus is required\n§\nSelf-driven individual, who can also work within a team\n§\nSelf-directed/managed and motivated towards achieving goals\n§\nComfortable to challenge peers\n§\nValid Passport and Driving License\n§\nRight to work in the UK\n§\nGood IT skills\n§\nFlexible approach to working\nWhat We'll Do for You\nWe recognise that we can only achieve our vision with the dedication and collaboration of our world class employees.  It is our aim to become the employer of choice within the global automotive industry.\nAt McLaren Automotive we are constantly looking to improve. To become the employer of choice we are always looking to develop our employee offerings. We currently offer a range of benefits to employees at all levels of the business including Private Healthcare, Contributory Pension Scheme, Life Assurance and Personal Lease Car Scheme. We also offer a range of discounts with our partner organisations.\nWho Are We?\nNo restraints. No limitations. We don’t simply push boundaries. We completely rethink them. McLaren Automotive exists to create breath-taking performance road cars.\nIt takes a community to do what we do. A diverse group of people with many areas of expertise, united by their passion to deliver visionary products and set new benchmarks.\nMcLaren Automotive commits to equal opportunity for all. Diversity, Equality and Inclusion is at the heart of our impact, it drives our innovation and enables us to truly create something special. Join us on our journey.\n< Back to job list\nApply\nShare this job:\nShare\nLinkedIn\nFacebook\nEmail",
        "application_url": "https://mclarencareers.mclaren.com/careers/Login?jobId=58829",
        "": {},
        "metadata": {
            "Job Title": "Quality Technician",
            "Ref #": "58700",
            "Date posted": "Thursday, January 29, 2026",
            "Country": "United Kingdom",
            "Location": "Sheffield",
            "Business area": "Sheffield",
            "Department": "Sheffield",
            "Position level": "J - Technician / Administrator",
            "Working time": "Full Time",
            "Contract type": "Fixed Term Contract",
            "Duration": "48 Months",
            "Working pattern": "Blue Shift 40 hours"
        },
        "link": "https://mclarencareers.mclaren.com/careers/JobDetail/Quality-Technician/58829"
    },
    {
        "title": "",
        "description_html": null,
        "description_text": "Job Title\nTechnical Lead\nRef #\n58702\nDate posted\nThursday, January 29, 2026\nCountry\nUnited Kingdom\nLocation\nSheffield\nBusiness area\nSheffield\nDepartment\nSheffield\nPosition level\nI - Qualifying / Team Leader\nWorking time\nFull Time\nContract type\nFixed Term Contract\nDuration\n48 Months\nWorking pattern\n8:30am - 5:30pm Monday to Friday\nWhat to Expect\nThis is a hands-on technical lead role in a fast-paced composite manufacturing environment. You’ll be at the sharp end of delivering new parts into composite production, working directly with design, manufacturing, and quality to turn concepts into robust, repeatable processes. The role is varied, and dynamic expect a mix of problem-solving on the shop floor, process development, and driving continuous improvement. This is a role for someone who thrives on ownership, pace, and seeing real parts come off the line.\nWhat You'll Do\nLead the introduction of new composite parts into pre-preg production from first build through to stable serial manufacture.\nOwn process definition, including layup methods, tooling concepts, cure cycles, trimming, and inspection routes.\nBe hands-on in resolving day-to-day production issues, driving root cause analysis and permanent corrective actions.\nWork closely with design engineering to ensure parts are producible at rate and to specification.\nSet and maintain high standards for quality, safety, and efficiency on the shop floor.\nDrive continuous improvement in cycle time, scrap reduction, and right-first-time performance.\nSupport capacity increases and production scale-up activities as required.\nWhat You'll Bring\nStrong practical experience in pre-preg carbon fibre manufacture within a production environment.\nProven ability to lead by example on the shop floor and take ownership of technical challenges.\nA self-starter mindset with a strong bias for action and delivery.\nDeep understanding of composite processes, tooling, cure cycles, and quality requirements.\nConfidence working across engineering, manufacturing, and quality teams.\nClear, practical communication skills and the ability to make sound technical decisions under pressure.\nA passion for building high-quality composite parts and getting things done.\nWhat We'll Do for You\nx\nWho Are We?\nNo restraints. No limitations. We don’t simply push boundaries. We completely rethink them. McLaren Automotive exists to create breath-taking performance road cars.\nIt takes a community to do what we do. A diverse group of people with many areas of expertise, united by their passion to deliver visionary products and set new benchmarks.\nMcLaren Automotive commits to equal opportunity for all. Diversity, Equality and Inclusion is at the heart of our impact, it drives our innovation and enables us to truly create something special. Join us on our journey.\n< Back to job list\nApply\nShare this job:\nShare\nLinkedIn\nFacebook\nEmail",
        "application_url": "https://mclarencareers.mclaren.com/careers/Login?jobId=58831",
        "": {},
        "metadata": {
            "Job Title": "Technical Lead",
            "Ref #": "58702",
            "Date posted": "Thursday, January 29, 2026",
            "Country": "United Kingdom",
            "Location": "Sheffield",
            "Business area": "Sheffield",
            "Department": "Sheffield",
            "Position level": "I - Qualifying / Team Leader",
            "Working time": "Full Time",
            "Contract type": "Fixed Term Contract",
            "Duration": "48 Months",
            "Working pattern": "8:30am - 5:30pm Monday to Friday"
        },
        "link": "https://mclarencareers.mclaren.com/careers/JobDetail/Technical-Lead/58831"
    },
    {
        "title": "",
        "description_html": null,
        "description_text": "Job Title\nSenior Tooling Engineer\nRef #\n58703\nDate posted\nThursday, January 29, 2026\nCountry\nUnited Kingdom\nLocation\nSheffield\nBusiness area\nSheffield\nDepartment\nSheffield\nPosition level\nG - Qualified Senior\nWorking time\nFull Time\nContract type\nFixed Term Contract\nDuration\n48 Months\nWorking pattern\n8:30am - 5:30pm Monday to Friday\nWhat to Expect\nAs a Senior Tooling Engineer, you will lead a newly created composites tooling department within a fast-paced automotive manufacturing environment. You will be responsible not only for guiding a team of tooling engineers and technicians, but also for establishing the processes, standards, and workflows that will integrate this new function into the existing business. You will act as the technical authority for composite tooling, ensuring high levels of quality, manufacturability, and operational efficiency. Expect to collaborate closely with design, production, quality, and programme teams to deliver innovative tooling solutions that support advanced composite components and high-volume automotive production.\nWhat You'll Do\nBuild and lead a new composite tooling department, defining its structure, processes, and best practices.\nDevelop and implement tooling workflows, documentation standards, and procedures to integrate the department seamlessly into the wider business.\nLead and mentor a team in the design and manufacture of composite tooling, fixtures, jigs, and associated equipment.\nOversee the full tooling lifecycle—from concept development and detailed design to validation, commissioning, and continuous improvement.\nProduce and review tooling design deliverables including 3D models, drawings, BOMs, and technical specifications.\nProvide expert Design for Manufacture (DFM) feedback to ensure composite component designs support efficient and repeatable production.\nDefine tooling materials, processes, and construction methods suitable for composite manufacturing technologies (e.g., autoclave, resin infusion, press moulding).\nCollaborate with cross-functional teams to resolve manufacturability issues and optimise tooling performance.\nLead tooling trials, inspections, and root-cause analyses, implementing corrective actions as required.\nEnsure compliance with internal standards, safety regulations, and industry best practices.\nManage tooling budgets, schedules, and supplier relationships.\nDrive continuous improvement initiatives focused on tooling reliability, efficiency, cycle time, ergonomics, and accuracy.\nWhat You'll Bring\nExtensive experience in composite tooling engineering within automotive, motorsport, aerospace, or a similar high-performance environment.\nProven leadership experience, ideally including setting up or scaling a new department, team, or function.\nStrong understanding of composite materials, lay-up techniques, curing processes, and manufacturing technologies.\nHigh proficiency with CAD tools (e.g., CATIA, Siemens NX, SolidWorks) and familiarity with PLM/PDM systems.\nDemonstrated ability to provide DFM guidance and develop robust, production-ready tooling solutions.\nStrong analytical and problem-solving skills, including experience with root-cause analysis and continuous improvement.\nExcellent communication, influencing, and stakeholder management skills, especially when integrating new processes across an established organisation.\nAbility to manage multiple projects concurrently in a fast-moving manufacturing environment.\nA proactive mindset with a commitment to safety, quality, and operational excellence.\nWhat We'll Do for You\nTBC\nWho Are We?\nNo restraints. No limitations. We don’t simply push boundaries. We completely rethink them. McLaren Automotive exists to create breath-taking performance road cars.\nIt takes a community to do what we do. A diverse group of people with many areas of expertise, united by their passion to deliver visionary products and set new benchmarks.\nMcLaren Automotive commits to equal opportunity for all. Diversity, Equality and Inclusion is at the heart of our impact, it drives our innovation and enables us to truly create something special. Join us on our journey.\n< Back to job list\nApply\nShare this job:\nShare\nLinkedIn\nFacebook\nEmail",
        "application_url": "https://mclarencareers.mclaren.com/careers/Login?jobId=58832",
        "": {},
        "metadata": {
            "Job Title": "Senior Tooling Engineer",
            "Ref #": "58703",
            "Date posted": "Thursday, January 29, 2026",
            "Country": "United Kingdom",
            "Location": "Sheffield",
            "Business area": "Sheffield",
            "Department": "Sheffield",
            "Position level": "G - Qualified Senior",
            "Working time": "Full Time",
            "Contract type": "Fixed Term Contract",
            "Duration": "48 Months",
            "Working pattern": "8:30am - 5:30pm Monday to Friday"
        },
        "link": "https://mclarencareers.mclaren.com/careers/JobDetail/Senior-Tooling-Engineer/58832"
    },
    {
        "title": "",
        "description_html": null,
        "description_text": "Job Title\nTooling Designer\nRef #\n58705\nDate posted\nThursday, January 29, 2026\nCountry\nUnited Kingdom\nLocation\nSheffield\nBusiness area\nSheffield\nDepartment\nSheffield\nPosition level\nH - Qualified\nWorking time\nFull Time\nContract type\nFixed Term Contract\nDuration\n48 Months\nWorking pattern\n8:30am - 5:30pm Monday to Friday\nWhat to Expect\nAs a Composites Tooling Designer, you will play a key role in developing high-quality tooling for composite components used in an advanced automotive production environment. You will work closely with engineering, manufacturing, and quality teams to create robust tooling solutions that support efficient, repeatable, and high-volume composite manufacturing. You can expect to work in a fast-paced environment where precision, attention to detail, and strong problem-solving skills are essential. This is a hands-on design role with opportunities to influence part manufacturability and drive improvements in tooling performance and production processes.\nWhat You'll Do\nDesign composite tooling, fixtures, jigs, moulds, and assembly aids to support production of composite components.\nCreate detailed 3D CAD models, 2D drawings, and supporting documentation following internal standards and manufacturing best practices.\nWork with engineering teams to review product designs and provide Design for Manufacture (DFM) feedback to ensure efficient tooling and production processes.\nSupport prototype and production tooling development from concept through to release.\nCollaborate with manufacturing, production engineering, and tooling technicians to refine tooling designs and address build or process challenges.\nAssist in tooling trials, fit checks, and validation activities, making design adjustments as needed.\nSelect appropriate materials and construction methods for moulds, patterns, and fixtures based on component requirements, durability, and production volumes.\nManage design changes, revisions, and configuration control through PLM/PDM systems.\nEnsure that tooling designs comply with safety, ergonomic, and quality standards.\nContribute to continuous improvement initiatives focused on tooling reliability, accuracy, and cycle-time reduction.\nWhat You'll Bring\nExperience in composite tooling design within automotive, motorsport, aerospace, or a similar manufacturing industry.\nStrong proficiency in CAD software (e.g., CATIA, Siemens NX, SolidWorks) with the ability to produce detailed and accurate models and drawings.\nUnderstanding of composite materials, lay-up methods, curing processes, and relevant manufacturing technologies.\nKnowledge of tooling materials, construction techniques, and manufacturing processes such as machining, pattern making, and mould fabrication.\nAbility to interpret engineering drawings, GD&T, and technical specifications.\nStrong problem-solving skills and the ability to provide practical, production-focused design solutions.\nEffective communication and collaboration skills when working with cross-functional teams.\nHigh attention to detail, strong organisational skills, and the ability to manage multiple design tasks simultaneously.\nA proactive, solution-driven mindset with a commitment to quality and continuous improvement.\nWhat We'll Do for You\nTBC\nWho Are We?\nNo restraints. No limitations. We don’t simply push boundaries. We completely rethink them. McLaren Automotive exists to create breath-taking performance road cars.\nIt takes a community to do what we do. A diverse group of people with many areas of expertise, united by their passion to deliver visionary products and set new benchmarks.\nMcLaren Automotive commits to equal opportunity for all. Diversity, Equality and Inclusion is at the heart of our impact, it drives our innovation and enables us to truly create something special. Join us on our journey.\n< Back to job list\nApply\nShare this job:\nShare\nLinkedIn\nFacebook\nEmail",
        "application_url": "https://mclarencareers.mclaren.com/careers/Login?jobId=58834",
        "": {},
        "metadata": {
            "Job Title": "Tooling Designer",
            "Ref #": "58705",
            "Date posted": "Thursday, January 29, 2026",
            "Country": "United Kingdom",
            "Location": "Sheffield",
            "Business area": "Sheffield",
            "Department": "Sheffield",
            "Position level": "H - Qualified",
            "Working time": "Full Time",
            "Contract type": "Fixed Term Contract",
            "Duration": "48 Months",
            "Working pattern": "8:30am - 5:30pm Monday to Friday"
        },
        "link": "https://mclarencareers.mclaren.com/careers/JobDetail/Tooling-Designer/58834"
    },
    {
        "title": "",
        "description_html": null,
        "description_text": "Job Title\nProduction Group Leader\nRef #\n58750\nDate posted\nThursday, January 22, 2026\nCountry\nUnited Kingdom\nLocation\nSheffield\nBusiness area\nSheffield\nDepartment\nSheffield\nPosition level\n5\nWorking time\nFull Time\nContract type\nFixed Term Contract\nDuration\n48 Months\nWorking pattern\nSheffield Senna\nSalary\nN/A\nWhat to Expect\nThe role of the Group Leader is to co-ordinate the\nday to day\nactivities of a multi-functional team, reporting into the Production Manager. The role is also responsible for the control of holiday and absence management, Health & Safety, cost & quality control as well as productivity improvement, via your responsible Team Leaders and production resource.\nAchieving the daily/annual volume throughput.\nConsistently delivering robust time study outputs (cycle times) for all production machines & processes.\nContinue\ndevelopment and training for all team members to ensure the team continues to grow.\nC\nontrol all Health & Safety requirements for all equipment\n/ Processes\nand team members on shift, this will include completion of Risk Assessments\n.\nMonitoring & reporting against consumable expenditure, driving down reduction.\nControl and reporting against scrap costs, driving down reduction.\nExecution of Lean Methodology i.e. 5S, Kaizens, Continuous Improvement\nUnderstand &\ndemonstrate\na broad knowledge of the build process to provide training &\nassist\nwhen issues arise.\nProvide cover for absence within your team and have a flexible approach to working hours as the business demands.\nTrain & mentor Team Leaders and Team Members to achieve the\nvery best\nin working practices and processes.\nMaintain Team Member versatility charts and ensure cross training & skills development.\nPrepare for production by checking resource, equipment, tools, parts availability, consumables\non a daily basis\n.\nTake part in problem solving activities –\nassist\nin analysis & resolution of problems, define & determine\nappropriate actions\n.\nEnsure safe working practices are adhered to and that all Team Members are using the correct\nPPE\n.\nAdhering to GL STD work daily / weekly / bi-weekly\nTrack all near misses and accidents to solve any unsafe procedures. Report as\nrequired\n.\nWhen required conduct performance reviews for areas of your team who require improvement, considering training, regular reviews etc.\nWhen necessary, conduct disciplinary investigations or disciplinary meetings with the\nassistance\nof HR.\nMaintain and endorse McLaren values and culture (housekeeping, appearance etc).\nLead by example, influence all team members and ensure they are fully motivated.\nWhat You'll Bring\nAbility to sustain and develop team working and team-based problem solving\nHigh level\nof numerical and analytical ability\nPossess the ability to lead and motivate a team of people to succeed by utilising\nappropriate   interpersonal\nstyles including leading by example, setting\nobjectives\nand defining responsibilities to give a clear sense of direction\nAbility to build effective relationships with work colleagues\nAbility to sustain and develop team working and team-based problem solving\nAbility to achieve results by setting\nhigh standards\nand committing to clear objectives\nAdaptable to change and varying situations\nAbility to show resilience and a flexible approach\nExcellent communication skills\nStrong analytical and problem-solving skills and able to\nestablish\nlogical practical solutions\nStrong people and performance management skills\nComputer literate with good numerical skills\nFull understanding of customer expectations and deliverables with an awareness of the impact of failure/cost of\npoor quality\nWhat We'll Do for You\nWe offer a wide – ranging benefits package, which includes:\nStructured career development framework\n25 days’ holiday, plus bank holiday. Annual buy & sell up to five days\nEnhanced company pension scheme\nDiscretionary annual bonus award\nPrivate medical insurance and health cash plan\nLife assurance benefit\nAbility to apply for a sabbatical of up to one year after only two years’ service\nBenefits you can adapt to your lifestyle, such as discounted shopping\nGenerous parental leave policies\nA range of wellbeing initiatives, such as employee assistance programme and free financial & mortgage advice\nWho Are We?\nNo restraints. No limitations. We don’t simply push boundaries. We completely rethink them. McLaren Automotive exists to create breath-taking performance road cars.\nIt takes a community to do what we do. A diverse group of people with many areas of expertise, united by their passion to deliver visionary products and set new benchmarks.\nMcLaren Automotive commits to equal opportunity for all. Diversity, Equality and Inclusion is at the heart of our impact, it drives our innovation and enables us to truly create something special. Join us on our journey.\n< Back to job list\nApply\nShare this job:\nShare\nLinkedIn\nFacebook\nEmail",
        "application_url": "https://mclarencareers.mclaren.com/careers/Login?jobId=58884",
        "": {},
        "metadata": {
            "Job Title": "Production Group Leader",
            "Ref #": "58750",
            "Date posted": "Thursday, January 22, 2026",
            "Country": "United Kingdom",
            "Location": "Sheffield",
            "Business area": "Sheffield",
            "Department": "Sheffield",
            "Position level": "5",
            "Working time": "Full Time",
            "Contract type": "Fixed Term Contract",
            "Duration": "48 Months",
            "Working pattern": "Sheffield Senna",
            "Salary": "N/A"
        },
        "link": "https://mclarencareers.mclaren.com/careers/JobDetail/Group-Leader/58884"
    },
    {
        "title": "",
        "description_html": null,
        "description_text": "Job Title\nTechnician - Idiada Workshop\nRef #\n58731\nDate posted\nTuesday, January 20, 2026\nCountry\nSpain\nLocation\nIdiada\nBusiness area\nR&D\nDepartment\nTest & Development\nPosition level\n6 - Support​ (L-13)\nWorking time\nFull Time\nContract type\nPermanent\nWorking pattern\n8:30am - 5:30pm Monday to Friday\nSalary\n.\nWhat to Expect\nAn opportunity exists within the Development group for an experienced Vehicle Development Technician to assemble, modify, prepare, and operate multi-project test and development vehicles and rigs at both the Idiada Proving Ground in Spain and at test locations.\nRole Dimensions:\nUnsocial hours working is to be expected, including shift pattern and weekend working, will be required as part of this role as well as regular off site testing duties.\nWhat You'll Do\n•\tWorking on Hybrid vehicles on different build phases is required, showing the highest standards of safety, and working methods all the time.\n•\tBuild of multi-project concept/mule/prototype/production level vehicles and simulation rigs to the highest standards, using specified processes where applicable.\n•\tMaintenance and updating of such vehicles and rigs to support the development programmes.\n•\tPreparation and operation of such vehicles and rigs for test and development activities at multiple locations, including industry proving grounds and racing circuits.\n•\tTwo-way interaction with design and engineering staff to establish and achieve requirements, specifications, and targets.\n•\tInterpretation of engineering drawings and instrumentation schedules to ensure safe and accurate builds, modifications, and updates.\n•\tMaintenance, presentation of the workshop and equipment to meet the standards set by McLaren.\n•\tSubject to the appropriate level of internal driving standard being achieved, the candidate may be required to drive high-value, high-performance cars in the workshop, road, and testing environments.\n•\tAny other reasonable request from line management might be required.\nDue to the changing nature of the business, your role will inevitably vary, develop, and evolve over time. The Company reserve the right at any time during your employment to require you to undertake duties which fall within your capabilities, in accordance with the applicable employment law.\nWhat You'll Bring\nKnowledge, skills & experience:\n•\tExtensive experience in motorsport/prototype/low volume/high performance complete vehicle builds, covering the manufacture, assembly and operating of such vehicles.\n•\tSome welding, machining and fabrication skills are preferred.\n•\tUnderstanding of current automotive electrical and electronic systems to enable fault finding and repair would be advantageous.\n•\tExperience on diagnostic platforms.\n•\tClean driving licence & passport.\n•\tIT literate in various packages e.g., Microsoft Office suite, Virtual Car.\n•\tEligible to live and work in Spain.\nPersonal Attributes / Competencies\n•\tExcellent communication skills.\n•\tFlexible approach to working hours, and weekend working when required.\n•\tWillingness to travel, working for periods away from the McLaren facility at Idiada.\n•\tSelf-motivated.\n•\tAbility to work confidently alone or as part of a team.\n•\tConscientious.\n•\tQuality driven.\n•\tExcellent attention to detail.\n•\tNo restrictions to living and working in Spain.\nWhat We'll Do for You\n- Full list of employee benefits\n- Working in a high perfromance team with pinnacle of perfromnace vehicles, teams, and facilities.\nWho Are We?\nNo restraints. No limitations. We don’t simply push boundaries. We completely rethink them. McLaren Automotive exists to create breath-taking performance road cars.\nIt takes a community to do what we do. A diverse group of people with many areas of expertise, united by their passion to deliver visionary products and set new benchmarks.\nMcLaren Automotive commits to equal opportunity for all. Diversity, Equality and Inclusion is at the heart of our impact, it drives our innovation and enables us to truly create something special. Join us on our journey.\n< Back to job list\nApply\nShare this job:\nShare\nLinkedIn\nFacebook\nEmail",
        "application_url": "https://mclarencareers.mclaren.com/careers/Login?jobId=58860",
        "": {},
        "metadata": {
            "Job Title": "Technician - Idiada Workshop",
            "Ref #": "58731",
            "Date posted": "Tuesday, January 20, 2026",
            "Country": "Spain",
            "Location": "Idiada",
            "Business area": "R&D",
            "Department": "Test & Development",
            "Position level": "6 - Support​ (L-13)",
            "Working time": "Full Time",
            "Contract type": "Permanent",
            "Working pattern": "8:30am - 5:30pm Monday to Friday",
            "Salary": "."
        },
        "link": "https://mclarencareers.mclaren.com/careers/JobDetail/Technician-Idiada-Workshop/58860"
    },
    {
        "title": "",
        "description_html": null,
        "description_text": "Job Title\nTechnician - Idiada Workshop\nRef #\n58733\nDate posted\nTuesday, January 20, 2026\nCountry\nSpain\nLocation\nIdiada\nBusiness area\nR&D\nDepartment\nTest & Development\nPosition level\n6 - Support​ (L-13)\nWorking time\nFull Time\nContract type\nPermanent\nWorking pattern\n8:30am - 5:30pm Monday to Friday\nSalary\n.\nWhat to Expect\nAn opportunity exists within the Development group for an experienced Vehicle Development Technician to assemble, modify, prepare, and operate multi-project test and development vehicles and rigs at both the Idiada Proving Ground in Spain and at test locations.\nRole Dimensions:\nUnsocial hours working is to be expected, including shift pattern and weekend working, will be required as part of this role as well as regular off site testing duties.\nWhat You'll Do\n•\tWorking on Hybrid vehicles on different build phases is required, showing the highest standards of safety, and working methods all the time.\n•\tBuild of multi-project concept/mule/prototype/production level vehicles and simulation rigs to the highest standards, using specified processes where applicable.\n•\tMaintenance and updating of such vehicles and rigs to support the development programmes.\n•\tPreparation and operation of such vehicles and rigs for test and development activities at multiple locations, including industry proving grounds and racing circuits.\n•\tTwo-way interaction with design and engineering staff to establish and achieve requirements, specifications, and targets.\n•\tInterpretation of engineering drawings and instrumentation schedules to ensure safe and accurate builds, modifications, and updates.\n•\tMaintenance, presentation of the workshop and equipment to meet the standards set by McLaren.\n•\tSubject to the appropriate level of internal driving standard being achieved, the candidate may be required to drive high-value, high-performance cars in the workshop, road, and testing environments.\n•\tAny other reasonable request from line management might be required.\nDue to the changing nature of the business, your role will inevitably vary, develop, and evolve over time. The Company reserve the right at any time during your employment to require you to undertake duties which fall within your capabilities, in accordance with the applicable employment law.\nWhat You'll Bring\nKnowledge, skills & experience:\n•\tExtensive experience in motorsport/prototype/low volume/high performance complete vehicle builds, covering the manufacture, assembly and operating of such vehicles.\n•\tSome welding, machining and fabrication skills are preferred.\n•\tUnderstanding of current automotive electrical and electronic systems to enable fault finding and repair would be advantageous.\n•\tExperience on diagnostic platforms.\n•\tClean driving licence & passport.\n•\tIT literate in various packages e.g., Microsoft Office suite, Virtual Car.\n•\tEligible to live and work in Spain.\nPersonal Attributes / Competencies\n•\tExcellent communication skills.\n•\tFlexible approach to working hours, and weekend working when required.\n•\tWillingness to travel, working for periods away from the McLaren facility at Idiada.\n•\tSelf-motivated.\n•\tAbility to work confidently alone or as part of a team.\n•\tConscientious.\n•\tQuality driven.\n•\tExcellent attention to detail.\n•\tNo restrictions to living and working in Spain.\nWhat We'll Do for You\n- Full list of employee benefits\n- Working in a high perfromance team with pinnacle of perfromnace vehicles, teams, and facilities.\nWho Are We?\nNo restraints. No limitations. We don’t simply push boundaries. We completely rethink them. McLaren Automotive exists to create breath-taking performance road cars.\nIt takes a community to do what we do. A diverse group of people with many areas of expertise, united by their passion to deliver visionary products and set new benchmarks.\nMcLaren Automotive commits to equal opportunity for all. Diversity, Equality and Inclusion is at the heart of our impact, it drives our innovation and enables us to truly create something special. Join us on our journey.\n< Back to job list\nApply\nShare this job:\nShare\nLinkedIn\nFacebook\nEmail",
        "application_url": "https://mclarencareers.mclaren.com/careers/Login?jobId=58862",
        "": {},
        "metadata": {
            "Job Title": "Technician - Idiada Workshop",
            "Ref #": "58733",
            "Date posted": "Tuesday, January 20, 2026",
            "Country": "Spain",
            "Location": "Idiada",
            "Business area": "R&D",
            "Department": "Test & Development",
            "Position level": "6 - Support​ (L-13)",
            "Working time": "Full Time",
            "Contract type": "Permanent",
            "Working pattern": "8:30am - 5:30pm Monday to Friday",
            "Salary": "."
        },
        "link": "https://mclarencareers.mclaren.com/careers/JobDetail/Technician-Idiada-Workshop/58862"
    },
    {
        "title": "",
        "description_html": null,
        "description_text": "Job Title\nElectrical Technician -Idiada Workshop\nRef #\n58739\nDate posted\nTuesday, January 20, 2026\nCountry\nSpain\nLocation\nIdiada\nBusiness area\nR&D\nDepartment\nTest & Development\nPosition level\n6 - Support​ (L-13)\nWorking time\nFull Time\nContract type\nPermanent\nWorking pattern\n8:30am - 5:30pm Monday to Friday\nSalary\n.\nWhat to Expect\nAn opportunity exists within the Development group for an experienced Development Electrical Technician.\nThe key elements of the role are to ensure that the development activities are supported by the Electrical Technician as required. This will involve the assembly and testing of electrical harnesses and components for all development activities.\nUnsocial hours and travel will be required as part of this role as well as regular off-site UK, European and occasional Worldwide testing duties.\nWhat You'll Do\n•\tResponsibility for planning electrical/system tasks.\n•\tTo manufacture and repair Automotive and System 25 harnesses.\n•\tTo work with engineers and technicians with the integration of electrical systems onto vehicles and testing rigs, commissioning and rectifying electrical faults as necessary.\n•\tTo provide support to instrumentation department, when necessary, in repairing instrumentation systems in cars or rigs, equipment or harnesses.\n•\tCollaborate with workshop team and share knowledge and provide training to technicians.\n•\tTo assist with vehicle activities using tools such as CANape, Monaco, and CANalyzer among others.\n•\tEnsure effective communication of relevant technical issues to the relevant responsible and contribute to their resolution.\n•\tWhen necessary, to work additional hours, including shift patterns, weekends and Bank holidays when required, to maintain project schedules.\n•\tComply with the company Health and safety policies whilst ensuring the health and safety working standards are met in the fabrication shop by all the users.\nBecause of the changing nature of the company’s business and/or your role obligation will inevitably vary and develop over time. The Company reserve the right at any time during your employment to require you to undertake duties which fall within your capabilities, in accordance with the applicable employment law.\nWhat You'll Bring\nKnowledge, skills & experience:\n•\tPractical knowledge of vehicle wiring with the availability to manufacture and repair automotive and other harness types used on McLaren vehicles and rigs.\n•\tExperience of electric or hybrid vehicles.\n•\tKnowledge in CAN architecture\n•\tGood understanding of vehicle electronics.\n•\tKnowledge of CA based tools used in faults diagnoses, platform software updates and data logging.\n•\tKnowledge of an understanding of control systems.\n•\tIT literate and component in the use of multiple packages and platforms.\n•\tGrado Medio o Superior (Spain) Apprenticeship, City & Guilds, NVQ III Level in a relevant electrical/mechanical engineering discipline.\nPersonal Attributes / Competencies\n•\tExcellent team member who can also work confidently on their own.\n•\tCommitment and drive to succeed.\n•\tEnthusiastic, self-motivated, and reliable.\n•\tGood communication skills.\n•\tAbility to work under pressure.\n•\tMeticulous attention to detail.\n•\tPunctual and conscientious.\n•\tCurrent driving license.\n•\tAble to work in Spain, and at other locations if required.\nWhat We'll Do for You\n- Full list of employee benefits\n- Working in a high perfromance team with pinnacle of perfromnace vehicles, teams, and facilities.\nWho Are We?\nNo restraints. No limitations. We don’t simply push boundaries. We completely rethink them. McLaren Automotive exists to create breath-taking performance road cars.\nIt takes a community to do what we do. A diverse group of people with many areas of expertise, united by their passion to deliver visionary products and set new benchmarks.\nMcLaren Automotive commits to equal opportunity for all. Diversity, Equality and Inclusion is at the heart of our impact, it drives our innovation and enables us to truly create something special. Join us on our journey.\n< Back to job list\nApply\nShare this job:\nShare\nLinkedIn\nFacebook\nEmail",
        "application_url": "https://mclarencareers.mclaren.com/careers/Login?jobId=58868",
        "": {},
        "metadata": {
            "Job Title": "Electrical Technician -Idiada Workshop",
            "Ref #": "58739",
            "Date posted": "Tuesday, January 20, 2026",
            "Country": "Spain",
            "Location": "Idiada",
            "Business area": "R&D",
            "Department": "Test & Development",
            "Position level": "6 - Support​ (L-13)",
            "Working time": "Full Time",
            "Contract type": "Permanent",
            "Working pattern": "8:30am - 5:30pm Monday to Friday",
            "Salary": "."
        },
        "link": "https://mclarencareers.mclaren.com/careers/JobDetail/Electrical-Technician-Idiada-Workshop/58868"
    },
    {
        "title": "",
        "description_html": null,
        "description_text": "Job Title\nBuyer - Motorsport & MSO\nRef #\n58685\nDate posted\nThursday, November 20, 2025\nCountry\nUnited Kingdom\nLocation\nWoking\nBusiness area\nProcurement\nDepartment\nCommodity Procurement\nPosition level\n5 - Supervisory / Professional​ - (L-15)\nWorking time\nFull Time\nWorking pattern\n9am - 6pm Monday to Friday\nWhat to Expect\nThe McLaren Automotive Purchasing Department is an exciting yet demanding, fast paced and commercially driven environment.\nWe are currently recruiting for a buyer within the motorsport procurement function\nThe successful candidate will be working as part of a high performing and agile team, with direct report into the Purchasing Manager. Cross functional engagement with our Engineering, Quality, Production and Legal Teams is vital for successful delivery and performance.\nWhat You'll Do\nThe Commodity Buyer is accountable for the following key activities:\nNegotiate and finalize production supplier contracts for assigned commodities.\nMitigate cost increases and drive cost-down activities within scope.\nCollaborate with Engineering and Supplier Quality to develop and deploy sourcing strategies.\nConduct supplier assessments and coordinate sourcing recommendations.\nEnsure suppliers meet program targets for timing, cost, quality, and technical attributes.\nServe as the focal point for Supplier Relationship Management (SRM) activities with suppliers and internal customers.\nSupport risk assessment, total acquisition cost analysis, and cross-functional alignment on technical and quality Criteria\nWhat You'll Bring\nDegree in Business, Engineering, or related field preferred; MCIPS qualification desirable.\nPrevious purchasing experience in a manufacturing environment (automotive preferred).\nSolid experience in procurement or commodity buying.\nExperience in developing structured commodity strategies, including risk and cost\nassessments.\nSome experience negotiating complex contracts.\nStrong written and oral communication skills; ability to influence at senior management level.\nGood understanding of cost breakdown analysis.\nMotorsport Experience\nWhat We'll Do for You\nWe offer a wide – ranging benefits package, which includes:\nStructured career development framework\n25 days’ holiday, plus bank holiday. Annual buy & sell up to five days\nEnhanced company pension scheme\nDiscretionary annual bonus award\nPrivate medical insurance and health cash plan\nLife assurance benefit\nAbility to apply for a sabbatical of up to one year after only two years’ service\nBenefits you can adapt to your lifestyle, such as discounted shopping\nGenerous parental leave policies\nA range of wellbeing initiatives, such as employee assistance programme and free financial & mortgage advice\nWho Are We?\nNo restraints. No limitations. We don’t simply push boundaries. We completely rethink them. McLaren Automotive exists to create breath-taking performance road cars.\nIt takes a community to do what we do. A diverse group of people with many areas of expertise, united by their passion to deliver visionary products and set new benchmarks.\nMcLaren Automotive commits to equal opportunity for all. Diversity, Equality and Inclusion is at the heart of our impact, it drives our innovation and enables us to truly create something special. Join us on our journey.\n< Back to job list\nApply\nShare this job:\nShare\nLinkedIn\nFacebook\nEmail",
        "application_url": "https://mclarencareers.mclaren.com/careers/Login?jobId=58814",
        "": {},
        "metadata": {
            "Job Title": "Buyer - Motorsport & MSO",
            "Ref #": "58685",
            "Date posted": "Thursday, November 20, 2025",
            "Country": "United Kingdom",
            "Location": "Woking",
            "Business area": "Procurement",
            "Department": "Commodity Procurement",
            "Position level": "5 - Supervisory / Professional​ - (L-15)",
            "Working time": "Full Time",
            "Working pattern": "9am - 6pm Monday to Friday"
        },
        "link": "https://mclarencareers.mclaren.com/careers/JobDetail/Buyer-Motorsport-MSO/58814"
    },
    {
        "title": "",
        "description_html": null,
        "description_text": "Job Title\nProject Engineer - Motorsport\nRef #\n54205\nDate posted\nThursday, November 13, 2025\nCountry\nUnited Kingdom\nLocation\nWoking\nBusiness area\nMotorsport\nDepartment\nMotorsport\nPosition level\nH - Qualified\nWorking time\nFull Time\nContract type\nPermanent\nWorking pattern\n8:30am - 5:30pm Monday to Friday\nWhat to Expect\nThe Project Engineer will be responsible for working across the various functions within the Motorsport organisation to ensure the on time and successful delivery and support of our Motorsport vehicles.\nWhat You'll Do\nOversee the engineering release, and introduction of new parts and systems (Development and production)\n§\nWorking with the core business teams to support Engineering Release and Change Control processes.\n§\nWork with Engineering & Production operations to lead the design and development of systems and to ensure optimised vehicle performance.\n§\nBoM creation and maintenance, as well as assembly structuring within ERP systems.\n§\nManage the recording, root cause analysis and resolution of all concerns raised during all stages of development, pre-production builds, as well as all faults reported by customers.\n§\nMaintain design guides, technical specifications as required.\n§\nProvide support for CAD related design and drawing updates as required.\n§\nWork closely with Design Engineers to fulfil technical, commercial, and timing targets (DFM, FMEA etc.)\n§\nLiaison with Development Engineers to understand system performance and development requirements.\n§\nLiaison with Suppliers to support manufacturing quality and production concerns.\n§\nEnsuring compliance with technical and safety regulations appropriate to our products, as well as preparing and submitting homologation documentation to regulatory bodies as required.\n§\nCreation and maintenance of all Customer Technical Documentation relating to our products. Manuals, Bulletins, and all technical communications both internally and externally.\n§\nTraining and supporting customers in procedures and best practices.\nWhat You'll Bring\nEducated to degree level in an engineering or motorsport discipline\nPrevious experience in a motorsport of OEM environment\nCommercial awareness, understanding of 'Business case', profit etc.\nExcellent communication with the ability to support and lead a small focused team to work cross functionally\nRace car engineering experience preferred\nAble to adopt a creative & thortful approach to concept design and problem solving engineering problems with good attention to detail and an engaging mind, open to new problems outside of their normal comfort zone.\nWell organised and delivery focussed - with demonstrable track record of on-time delivery in a high pressure environment.\nA flexible approach to working hours, travel requirements and adaptability to multiple and changing priorities\nWhat We'll Do for You\nA competitive package with access to private healthcare, an executive car scheme, company pension scheme and the opportunity to work in a truly unique environment with one of the few GT race car manufacturers.\nWho Are We?\nNo restraints. No limitations. We don’t simply push boundaries. We completely rethink them. McLaren Automotive exists to create breath-taking performance road cars.\nIt takes a community to do what we do. A diverse group of people with many areas of expertise, united by their passion to deliver visionary products and set new benchmarks.\nMcLaren Automotive commits to equal opportunity for all. Diversity, Equality and Inclusion is at the heart of our impact, it drives our innovation and enables us to truly create something special. Join us on our journey.\n< Back to job list\nApply\nShare this job:\nShare\nLinkedIn\nFacebook\nEmail",
        "application_url": "https://mclarencareers.mclaren.com/careers/Login?jobId=58639",
        "": {},
        "metadata": {
            "Job Title": "Project Engineer - Motorsport",
            "Ref #": "54205",
            "Date posted": "Thursday, November 13, 2025",
            "Country": "United Kingdom",
            "Location": "Woking",
            "Business area": "Motorsport",
            "Department": "Motorsport",
            "Position level": "H - Qualified",
            "Working time": "Full Time",
            "Contract type": "Permanent",
            "Working pattern": "8:30am - 5:30pm Monday to Friday"
        },
        "link": "https://mclarencareers.mclaren.com/careers/JobDetail/Project-Engineer-Motorsport/58639"
    },
    {
        "title": "",
        "description_html": null,
        "description_text": "Job Title\nDevelopment Technician\nRef #\n58576\nDate posted\nThursday, November 13, 2025\nCountry\nUnited Kingdom\nLocation\nWoking\nBusiness area\nMotorsport\nDepartment\nMotorsport\nPosition level\nJ - Technician / Administrator\nWorking time\nFull Time\nContract type\nPermanent\nWorking pattern\nSecurity Blue 42\nWhat to Expect\nChallenging role both workshop and trackside based. Role can involve extensive travel\nWhat You'll Do\nDevelopment Technician role looking after the preparation, build and track side running of GT 3 and GT 4 development projects.\nWhat You'll Bring\nMechanical automotive repair skill, Basic fabrication skill,\nWhat We'll Do for You\nYou will become part of the development team and we will provide experience in running race cars trackside aswell as race car build and development skills\nWho Are We?\nNo restraints. No limitations. We don’t simply push boundaries. We completely rethink them. McLaren Automotive exists to create breath-taking performance road cars.\nIt takes a community to do what we do. A diverse group of people with many areas of expertise, united by their passion to deliver visionary products and set new benchmarks.\nMcLaren Automotive commits to equal opportunity for all. Diversity, Equality and Inclusion is at the heart of our impact, it drives our innovation and enables us to truly create something special. Join us on our journey.\n< Back to job list\nApply\nShare this job:\nShare\nLinkedIn\nFacebook\nEmail",
        "application_url": "https://mclarencareers.mclaren.com/careers/Login?jobId=58705",
        "": {},
        "metadata": {
            "Job Title": "Development Technician",
            "Ref #": "58576",
            "Date posted": "Thursday, November 13, 2025",
            "Country": "United Kingdom",
            "Location": "Woking",
            "Business area": "Motorsport",
            "Department": "Motorsport",
            "Position level": "J - Technician / Administrator",
            "Working time": "Full Time",
            "Contract type": "Permanent",
            "Working pattern": "Security Blue 42"
        },
        "link": "https://mclarencareers.mclaren.com/careers/JobDetail/Development-Technician/58705"
    },
    {
        "title": "",
        "description_html": null,
        "description_text": "Job Title\nSenior Supply Chain Specialist\nRef #\n58618\nDate posted\nThursday, November 13, 2025\nCountry\nUnited Kingdom\nLocation\nWoking\nBusiness area\nProcurement\nDepartment\nCommodity Procurement\nPosition level\n5\nWorking time\nFull Time\nContract type\nPermanent\nWorking pattern\n9am - 6pm Monday to Friday\nWhat to Expect\nMcLaren Automotive is a customer focussed and commercially driven environment, where ensuring the best vehicle ownership experience is always offered. For Aftersales this translates in the Procurement world to an emphasis on supplier development and effective negotiation with exceptional long-term and sustainable outcomes.\nAs an Aftersales Senior Supply Chain Specialist, you will be part of a team responsible for the on time and stable supply of Aftersales parts to the McLaren Global Retailer Network, whislt supporting the development of a lean supply chain.\nYou will be responsible for engaging with key internal stakeholders to track progress of parts supply.  Furthermore, you will be responsible for critical projects and activities that impact Aftersales inventory and parts supply, whilst providing effective reporting on operational performance and continuity of supply.\nWhat You'll Do\nImplementing a strategy to secure the supply of Aftersales product through the complete vehicle lifecycle, with particular focus on the stage between end of model production through to end of model life\nOngoing negotiation of Aftersales’ part and tool costs, optimising the commercial terms and conditions with suppliers to suit the needs of McLaren\nNegotiation of Aftersales commercial terms with the supply base for all new McLaren vehicles and models in support of project launch timescales\nSourcing of components sold to Retailers and customers as Aftersales specific product\nImplement a supplier engagement process specific to Aftersales, ensuring that all necessary suppliers are actively managed and fully committed to meeting their McLaren Aftersales obligations\nBuild relationships with both key internal and external stakeholders at a senior level, supporting all other accountabilities and ensuring that all Aftersales strategies match the overall McLaren business imperatives\nEnsure that all required master data needed to both procure parts from the supply chain, and to distribute through our global Retailers is accurate and captured in the system ahead of new product, model, or market launches.\nWhat You'll Bring\nEvidenced Procurement experience either from within the Automotive industry or from an indirect background.\nDegree in Business, Engineering, or related field preferred; MCIPS qualification desirable.\nProven experience in procurement within automotive or manufacturing.\nStrong commercial background and negotiation skills.\nExperience managing multi-national suppliers and delivering complex contracts.\nExcellent communication, influencing, and organizational skills.\nResults-driven, delivery-focused, and able to work autonomously.\nFamiliar with the specific challenges associated with sourcing and managing an Aftersales supply chain\nKeen eye for developing & implementing a strategic approach to problem solving.\nIT skills, in particular MS Excel is essential. Experience using SAP would be an advantage\nWhat We'll Do for You\nStructured career development framework\n25 days’ holiday, plus bank holiday. Annual buy & sell up to five days\nEnhanced company pension scheme\nDiscretionary annual bonus award\nPrivate medical insurance and health cash plan\nLife assurance 4x your basic salary\nAbility to apply for a sabbatical of up to one year after only two years’ service\nBenefits you can adapt to your lifestyle, such as discounted shopping\nGenerous parental leave policies including market leading maternity leave\nTax efficient nursery scheme benefit\nA range of wellbeing initiatives, such as employee assistance programme and free financial & mortgage advice\nFriends and family day\nOpportunities to experience our fantastic cars\nWho Are We?\nNo restraints. No limitations. We don’t simply push boundaries. We completely rethink them. McLaren Automotive exists to create breath-taking performance road cars.\nIt takes a community to do what we do. A diverse group of people with many areas of expertise, united by their passion to deliver visionary products and set new benchmarks.\nMcLaren Automotive commits to equal opportunity for all. Diversity, Equality and Inclusion is at the heart of our impact, it drives our innovation and enables us to truly create something special. Join us on our journey.\n< Back to job list\nApply\nShare this job:\nShare\nLinkedIn\nFacebook\nEmail",
        "application_url": "https://mclarencareers.mclaren.com/careers/Login?jobId=58747",
        "": {},
        "metadata": {
            "Job Title": "Senior Supply Chain Specialist",
            "Ref #": "58618",
            "Date posted": "Thursday, November 13, 2025",
            "Country": "United Kingdom",
            "Location": "Woking",
            "Business area": "Procurement",
            "Department": "Commodity Procurement",
            "Position level": "5",
            "Working time": "Full Time",
            "Contract type": "Permanent",
            "Working pattern": "9am - 6pm Monday to Friday"
        },
        "link": "https://mclarencareers.mclaren.com/careers/JobDetail/Senior-Supply-Chain-Specialist/58747"
    },
    {
        "title": "",
        "description_html": null,
        "description_text": "Job Title\nProject Engineer - Motorsport\nRef #\n58751\nDate posted\nThursday, November 13, 2025\nCountry\nUnited Kingdom\nLocation\nWoking\nBusiness area\nMotorsport\nDepartment\nMotorsport\nPosition level\nH - Qualified\nWorking time\nFull Time\nContract type\nPermanent\nWorking pattern\n8:30am - 5:30pm Monday to Friday\nSalary\n£\nWhat to Expect\nThe Project Engineer will be responsible for working across the various functions within the Motorsport organisation to ensure the on time and successful delivery and support of our Motorsport vehicles.\nWhat You'll Do\nOversee the engineering release, and introduction of new parts and systems (Development and production)\n§\nWorking with the core business teams to support Engineering Release and Change Control processes.\n§\nWork with Engineering & Production operations to lead the design and development of systems and to ensure optimised vehicle performance.\n§\nBoM creation and maintenance, as well as assembly structuring within ERP systems.\n§\nManage the recording, root cause analysis and resolution of all concerns raised during all stages of development, pre-production builds, as well as all faults reported by customers.\n§\nMaintain design guides, technical specifications as required.\n§\nProvide support for CAD related design and drawing updates as required.\n§\nWork closely with Design Engineers to fulfil technical, commercial, and timing targets (DFM, FMEA etc.)\n§\nLiaison with Development Engineers to understand system performance and development requirements.\n§\nLiaison with Suppliers to support manufacturing quality and production concerns.\n§\nEnsuring compliance with technical and safety regulations appropriate to our products, as well as preparing and submitting homologation documentation to regulatory bodies as required.\n§\nCreation and maintenance of all Customer Technical Documentation relating to our products. Manuals, Bulletins, and all technical communications both internally and externally.\n§\nTraining and supporting customers in procedures and best practices.\nWhat You'll Bring\nEducated to degree level in an engineering or motorsport discipline\nPrevious experience in a motorsport of OEM environment\nCommercial awareness, understanding of 'Business case', profit etc.\nExcellent communication with the ability to support and lead a small focused team to work cross functionally\nRace car engineering experience preferred\nAble to adopt a creative & thortful approach to concept design and problem solving engineering problems with good attention to detail and an engaging mind, open to new problems outside of their normal comfort zone.\nWell organised and delivery focussed - with demonstrable track record of on-time delivery in a high pressure environment.\nA flexible approach to working hours, travel requirements and adaptability to multiple and changing priorities\nWhat We'll Do for You\nA competitive package with access to private healthcare, an executive car scheme, company pension scheme and the opportunity to work in a truly unique environment with one of the few GT race car manufacturers.\nWho Are We?\nNo restraints. No limitations. We don’t simply push boundaries. We completely rethink them. McLaren Automotive exists to create breath-taking performance road cars.\nIt takes a community to do what we do. A diverse group of people with many areas of expertise, united by their passion to deliver visionary products and set new benchmarks.\nMcLaren Automotive commits to equal opportunity for all. Diversity, Equality and Inclusion is at the heart of our impact, it drives our innovation and enables us to truly create something special. Join us on our journey.\n< Back to job list\nApply\nShare this job:\nShare\nLinkedIn\nFacebook\nEmail",
        "application_url": "https://mclarencareers.mclaren.com/careers/Login?jobId=58885",
        "": {},
        "metadata": {
            "Job Title": "Project Engineer - Motorsport",
            "Ref #": "58751",
            "Date posted": "Thursday, November 13, 2025",
            "Country": "United Kingdom",
            "Location": "Woking",
            "Business area": "Motorsport",
            "Department": "Motorsport",
            "Position level": "H - Qualified",
            "Working time": "Full Time",
            "Contract type": "Permanent",
            "Working pattern": "8:30am - 5:30pm Monday to Friday",
            "Salary": "£"
        },
        "link": "https://mclarencareers.mclaren.com/careers/JobDetail/Project-Engineer-Motorsport/58885"
    },
    {
        "title": "",
        "description_html": null,
        "description_text": "Job Title\nSenior Procurement Programme Manager\nRef #\n58596\nDate posted\nThursday, October 23, 2025\nCountry\nUnited Kingdom\nLocation\nWoking\nBusiness area\nProcurement\nDepartment\nProgramme Procurement\nPosition level\n4\nWorking time\nFull Time\nContract type\nPermanent\nWorking pattern\n9am - 6pm Monday to Friday\nWhat to Expect\nAs a member of the Program Purchasing team, your main task is to be the Purchasing and SQA spokesperson in assigned product development projects. Working in a cross-functional setting, you will contribute to overall project delivery and company profitability by proactively work closely with New Model Launch and Product Development, to ensure alignment on key issues at stakeholder Gateway readiness reviews.\nThe scope and size of the projects will predominately be the development of a vehicle derivative. Purchasing is working in a truly cross functional environment with cross-border solutions, process applications and product commonality with opportunities to influence future development.\nWhat You'll Do\nManage the supplier activity with the purchasing team from pre-nomination through to end of production.\nJointly lead activities with Finance, Engineering and Program to ensure that robust cost targets for both bill of materials and investment are established and maintained throughout.\nDefine and manage the Purchasing and SQA activity plan ensuring that the deliverables are achieved at each of the program gateways.\nFormulate and manage the department KPIs for the program to ensure that the required activities are completed to the required standard in the defined timescales.\nRepresent the department in cross function reviews such as Project Meetings / ETRS / Change Management / Build review / Commercial meetings.\nEngaging with project team and other business areas and be a key decision-maker and able to exert influence.\nSupport and foster a cross-functional approach to achieve your objectives.\nWork cross functionally with the total project team to ensure that the required input and output activities meet the key stakeholder expectations.\nDevelop a culture of continuous improvement throughout the business.\nProvide strong and robust leadership; working within purchasing as well as the wider business.\nIdentify and highlight any incremental resource requirement needed in enough time to enable senior Management review / approvals.\nChampion Program Management process discipline, to ensure supplier manufacturing feasibility is not compromised by Design changes and programs do not proceed through Gateways with open Red supplier related issues.\nEngage the Purchasing & SQA teams to ensure new program competent supplier sourcing strategy is maintained.\nEnsure all new tooled parts have APQP reporting established at the earliest opportunity (No later than at Sourcing Confirmation).\nDevelop and maintain Supplier Master list for all new parts.\nLead and Drive Critical Supplier / Part Risk Assessments with the participation of cross functional partners and develop risk mitigation actions.\nTrack and drive delivery of committed Supplier PPAP part delivery for the builds.\nProvide supplier progress reporting for: Unsourced parts, APQP open issues, Non PPAP part pedigree prior to each build phase and PPAP delivery forecast / actual performance growth charts.\nPrepare Program Milestone Management summary report including recommendations on whether to proceed through Gateway and the supporting rationale to the Purchasing & SQA Director to gain buy in.\nManage Non PPAP part Concession process to ensure “Plan for every part” is established to support the builds.\nManage QCR process for new parts, to ensure Supplier Quality issues are correctly assigned and containment actions implemented within 24 hours.\nWork with Cross Functional Leadership partners to drive collaborative behaviours to achieve optimum outcome to deliver McLaren Performance to plan.\nCompile and share lessons learned for next program.\nMonitor Engineering Change Management to maintain build support plan.\nDrive Supplier selection & development process to achieve a self-sufficient supply base (IATF16949).\nDrive Major open issue resolution at Key suppliers, to ensure Supplier Senior Management team are fully engaged in the resolution process.\nLead Robust Manufacturing Feasibility strategy deployment and reviews.\nDrive Supplier Quality QCR issue resolution (8D) process to closure, to prevent reoccurrence.\nWhat You'll Bring\nUniversity degree in Engineering or Business/Economics, MSc/MBA or equal\nPrevious experience in Manufacturing Engineering, Production, Quality, Major Project Management\nPrevious experience in Automotive is advantage\n5+ years of purchasing program and/or supplier quality program experience\nStrong management/leadership qualities and excellent influencing and interpersonal skills\nWorked within an automotive purchasing environment in a direct buying role or as a program manager.\nExcellent organisational skills, deadline adherence and exceptional attention to accuracy and detail and ability to analyse and summarise large data sets.\nAbility to create / lead and energise a team to deliver superior results, continuous process improvement.\nThe determination to drive forward the business to ‘Best in Class’ performance standards.\nMust be capable of lateral thinking and be able to make structured and objective decisions.\nResults driven and the ability to deliver against aggressive targets to achieve the overall business objectives.\nGood working knowledge of both manufacturing and quality processes.\nStructured Problem Solving (8D)\nGood knowledge of Microsoft Outlook, Word, Excel, PowerPoint, Project, Visio etc.\nWorking ability in the English Language.\nWhat We'll Do for You\nWe offer a wide – ranging benefits package, which includes:\nStructured career development framework\n25 days’ holiday, plus bank holiday. Annual buy & sell up to five days\nEnhanced company pension scheme\nDiscretionary annual bonus award\nPrivate medical insurance and health cash plan\nLife assurance benefit\nAbility to apply for a sabbatical of up to one year after only two years’ service\nBenefits you can adapt to your lifestyle, such as discounted shopping\nGenerous parental leave policies\nA range of wellbeing initiatives, such as employee assistance programme and free financial & mortgage advice\nWho Are We?\nNo restraints. No limitations. We don’t simply push boundaries. We completely rethink them. McLaren Automotive exists to create breath-taking performance road cars.\nIt takes a community to do what we do. A diverse group of people with many areas of expertise, united by their passion to deliver visionary products and set new benchmarks.\nMcLaren Automotive commits to equal opportunity for all. Diversity, Equality and Inclusion is at the heart of our impact, it drives our innovation and enables us to truly create something special. Join us on our journey.\n< Back to job list\nApply\nShare this job:\nShare\nLinkedIn\nFacebook\nEmail",
        "application_url": "https://mclarencareers.mclaren.com/careers/Login?jobId=58725",
        "": {},
        "metadata": {
            "Job Title": "Senior Procurement Programme Manager",
            "Ref #": "58596",
            "Date posted": "Thursday, October 23, 2025",
            "Country": "United Kingdom",
            "Location": "Woking",
            "Business area": "Procurement",
            "Department": "Programme Procurement",
            "Position level": "4",
            "Working time": "Full Time",
            "Contract type": "Permanent",
            "Working pattern": "9am - 6pm Monday to Friday"
        },
        "link": "https://mclarencareers.mclaren.com/careers/JobDetail/Senior-Procurement-Programme-Manager/58725"
    },
    {
        "title": "",
        "description_html": null,
        "description_text": "Job Title\nDesign Engineer - Motorsport\nRef #\n54013\nDate posted\nThursday, October 16, 2025\nCountry\nUnited Kingdom\nLocation\nWoking\nBusiness area\nMotorsport\nDepartment\nMotorsport\nPosition level\nH - Qualified\nWorking time\nFull Time\nContract type\nPermanent\nWorking pattern\n8:30am - 5:30pm Monday to Friday\nWhat to Expect\nAs an integral member of the Design Team reporting to the Design Engineering Leader, you will be responsible for the design and release of components and systems from concept to manufacturing in line with project timeframes.\nWhat You'll Do\nOwnership of component and system design from concept through track sign off, into production\nCreation of 3D Surface and Solid designs for a wide range of vehicle systems and components\nCreation of supporting detailed GD & T manufacturing drawings\nBoM creation and structuring within ERP systems\nWork closely with Project Engineers to fulfil technical, commercial, and timing targets (DFM etc)\nLiaison with Development Engineers to understand system performance and development requirements\nLiaison with suppliers’ Manufacturing, Engineering and Purchasing teams\nCreation of jig and tooling designs in collaboration with end users where required\nTechnical support for car build (prototype and production)\nRepresent the department in design reviews and during test and development activities if required\nContribute to fault diagnosis and resolution in collaboration with the wider Engineering Team\nWhat You'll Bring\nDegree in Mechanical / Automotive / Aeronautical engineering or similar\nGood understanding of GT race car mechanical systems and design philosophy\nGood knowledge of component and assembly design requirements for motorsport\nElevated level of proficiency of CATIA-V5 preferred\nProficient with industry standard CAE tools to support design targets\nExperience of drafting / drawing creation and proficient with GD&T\nGood knowledge of metallic and composite materials and latest manufacturing techniques\nA passion for high performance / motorsport engineering\nStrong time management capability to deliver multiple work packages in parallel\nMust be a team player and be able to work closely with multiple stakeholders and suppliers\nAppreciate the need for appropriate design and manufacturing methods depending on scope and targets\nFlexible and adaptable approach to challenges\nStrong verbal and written communication skills\nAbility to work under pressure and to tight deadlines\nWhat We'll Do for You\nWe recognise that we can only achieve our vision with the dedication and collaboration of our world class employees. It is our aim to become the employer of choice within the global automotive industry.\nAt McLaren Automotive we are constantly looking to improve. To become the employer of choice we are always looking to develop our employee offerings. We currently offer a range of benefits to employees at all levels of the business including Private Healthcare, Contributory Pension Scheme, Life Assurance and Personal Lease Car Scheme. We also offer a range of discounts with our partner organisations.\nWho Are We?\nNo restraints. No limitations. We don’t simply push boundaries. We completely rethink them. McLaren Automotive exists to create breath-taking performance road cars.\nIt takes a community to do what we do. A diverse group of people with many areas of expertise, united by their passion to deliver visionary products and set new benchmarks.\nMcLaren Automotive commits to equal opportunity for all. Diversity, Equality and Inclusion is at the heart of our impact, it drives our innovation and enables us to truly create something special. Join us on our journey.\n< Back to job list\nApply\nShare this job:\nShare\nLinkedIn\nFacebook\nEmail",
        "application_url": "https://mclarencareers.mclaren.com/careers/Login?jobId=58447",
        "": {},
        "metadata": {
            "Job Title": "Design Engineer - Motorsport",
            "Ref #": "54013",
            "Date posted": "Thursday, October 16, 2025",
            "Country": "United Kingdom",
            "Location": "Woking",
            "Business area": "Motorsport",
            "Department": "Motorsport",
            "Position level": "H - Qualified",
            "Working time": "Full Time",
            "Contract type": "Permanent",
            "Working pattern": "8:30am - 5:30pm Monday to Friday"
        },
        "link": "https://mclarencareers.mclaren.com/careers/JobDetail/Design-Engineer/58447"
    },
    {
        "title": "",
        "description_html": null,
        "description_text": "Job Title\nBuyer - Commodity\nRef #\n58613\nDate posted\nThursday, October 16, 2025\nCountry\nUnited Kingdom\nLocation\nWoking\nBusiness area\nProcurement\nDepartment\nCommodity Procurement\nPosition level\n5\nWorking time\nFull Time\nContract type\nPermanent\nWorking pattern\n9am - 6pm Monday to Friday\nWhat to Expect\nThe McLaren Automotive Purchasing Department is an exciting yet demanding, fast paced and commercially driven environment. Reporting to the Procurement Manager, the Commodity Buyer is responsible for negotiating and completing supplier contracts within assigned commodity groups (Electric Powertrain, Electrical, Chassis, Exterior, Interior, Powertrain, Body in White and Carbon). The role involves leading sourcing activities and developing supplier strategies in collaboration with Engineering and Supplier Quality, ensuring McLaren leverages the best technology, cost, and quality for the future of the company.\nWhat You'll Do\nThe Commodity Buyer is accountable for the following key activities:\n•\tNegotiate and finalize production supplier contracts for assigned commodities.\n•\tMitigate cost increases and drive cost-down activities within scope.\n•\tCollaborate with Engineering and Supplier Quality to develop and deploy sourcing strategies.\n•\tConduct supplier assessments and coordinate sourcing recommendations.\n•\tEnsure suppliers meet program targets for timing, cost, quality, and technical attributes.\n•\tServe as the focal point for Supplier Relationship Management (SRM) activities with suppliers and internal customers.\n•\tSupport risk assessment, total acquisition cost analysis, and cross-functional alignment on technical and quality criteria.\nWhat You'll Bring\nDegree in Business, Engineering, or related field preferred; MCIPS qualification desirable.\nPrevious purchasing experience in a manufacturing environment (automotive preferred).\nSolid experience in procurement or commodity buying.\nExperience in developing structured commodity strategies, including risk and cost assessments.\nSome experience negotiating complex contracts.\nStrong written and oral communication skills; ability to influence at senior management level.\nGood understanding of cost breakdown analysis.\nPersonal Attributes / Competencies\nAnalytical mindset and attention to detail.\nAbility to build strong supplier relationships.\nCollaborative approach with cross-functional teams.\nEagerness to learn and develop within the procurement function.\nWhat We'll Do for You\nWe offer a wide – ranging benefits package, which includes:\nStructured career development framework\n25 days’ holiday, plus bank holiday. Annual buy & sell up to five days\nEnhanced company pension scheme\nDiscretionary annual bonus award\nPrivate medical insurance and health cash plan\nLife assurance benefit\nAbility to apply for a sabbatical of up to one year after only two years’ service\nBenefits you can adapt to your lifestyle, such as discounted shopping\nGenerous parental leave policies\nA range of wellbeing initiatives, such as employee assistance programme and free financial & mortgage advice\nWho Are We?\nNo restraints. No limitations. We don’t simply push boundaries. We completely rethink them. McLaren Automotive exists to create breath-taking performance road cars.\nIt takes a community to do what we do. A diverse group of people with many areas of expertise, united by their passion to deliver visionary products and set new benchmarks.\nMcLaren Automotive commits to equal opportunity for all. Diversity, Equality and Inclusion is at the heart of our impact, it drives our innovation and enables us to truly create something special. Join us on our journey.\n< Back to job list\nApply\nShare this job:\nShare\nLinkedIn\nFacebook\nEmail",
        "application_url": "https://mclarencareers.mclaren.com/careers/Login?jobId=58742",
        "": {},
        "metadata": {
            "Job Title": "Buyer - Commodity",
            "Ref #": "58613",
            "Date posted": "Thursday, October 16, 2025",
            "Country": "United Kingdom",
            "Location": "Woking",
            "Business area": "Procurement",
            "Department": "Commodity Procurement",
            "Position level": "5",
            "Working time": "Full Time",
            "Contract type": "Permanent",
            "Working pattern": "9am - 6pm Monday to Friday"
        },
        "link": "https://mclarencareers.mclaren.com/careers/JobDetail/Buyer/58742"
    },
    {
        "title": "",
        "description_html": null,
        "description_text": "Job Title\nBuyer - Commodity\nRef #\n58749\nDate posted\nThursday, October 16, 2025\nCountry\nUnited Kingdom\nLocation\nBicester\nBusiness area\nProcurement\nDepartment\nCommodity Procurement\nPosition level\n5\nWorking time\nFull Time\nContract type\nPermanent\nWorking pattern\n9am - 6pm Monday to Friday\nWhat to Expect\nThe McLaren Automotive Purchasing Department is an exciting yet demanding, fast paced and commercially driven environment. Reporting to the Procurement Manager, the Commodity Buyer is responsible for negotiating and completing supplier contracts within assigned commodity groups (Electric Powertrain, Electrical, Chassis, Exterior, Interior, Powertrain, Body in White and Carbon). The role involves leading sourcing activities and developing supplier strategies in collaboration with Engineering and Supplier Quality, ensuring McLaren leverages the best technology, cost, and quality for the future of the company.\nWhat You'll Do\nThe Commodity Buyer is accountable for the following key activities:\n•\tNegotiate and finalize production supplier contracts for assigned commodities.\n•\tMitigate cost increases and drive cost-down activities within scope.\n•\tCollaborate with Engineering and Supplier Quality to develop and deploy sourcing strategies.\n•\tConduct supplier assessments and coordinate sourcing recommendations.\n•\tEnsure suppliers meet program targets for timing, cost, quality, and technical attributes.\n•\tServe as the focal point for Supplier Relationship Management (SRM) activities with suppliers and internal customers.\n•\tSupport risk assessment, total acquisition cost analysis, and cross-functional alignment on technical and quality criteria.\nWhat You'll Bring\nDegree in Business, Engineering, or related field preferred; MCIPS qualification desirable.\nPrevious purchasing experience in a manufacturing environment (automotive preferred).\nSolid experience in procurement or commodity buying.\nExperience in developing structured commodity strategies, including risk and cost assessments.\nSome experience negotiating complex contracts.\nStrong written and oral communication skills; ability to influence at senior management level.\nGood understanding of cost breakdown analysis.\nPersonal Attributes / Competencies\nAnalytical mindset and attention to detail.\nAbility to build strong supplier relationships.\nCollaborative approach with cross-functional teams.\nEagerness to learn and develop within the procurement function.\nWhat We'll Do for You\nWe offer a wide – ranging benefits package, which includes:\nStructured career development framework\n25 days’ holiday, plus bank holiday. Annual buy & sell up to five days\nEnhanced company pension scheme\nDiscretionary annual bonus award\nPrivate medical insurance and health cash plan\nLife assurance benefit\nAbility to apply for a sabbatical of up to one year after only two years’ service\nBenefits you can adapt to your lifestyle, such as discounted shopping\nGenerous parental leave policies\nA range of wellbeing initiatives, such as employee assistance programme and free financial & mortgage advice\nWho Are We?\nNo restraints. No limitations. We don’t simply push boundaries. We completely rethink them. McLaren Automotive exists to create breath-taking performance road cars.\nIt takes a community to do what we do. A diverse group of people with many areas of expertise, united by their passion to deliver visionary products and set new benchmarks.\nMcLaren Automotive commits to equal opportunity for all. Diversity, Equality and Inclusion is at the heart of our impact, it drives our innovation and enables us to truly create something special. Join us on our journey.\n< Back to job list\nApply\nShare this job:\nShare\nLinkedIn\nFacebook\nEmail",
        "application_url": "https://mclarencareers.mclaren.com/careers/Login?jobId=58883",
        "": {},
        "metadata": {
            "Job Title": "Buyer - Commodity",
            "Ref #": "58749",
            "Date posted": "Thursday, October 16, 2025",
            "Country": "United Kingdom",
            "Location": "Bicester",
            "Business area": "Procurement",
            "Department": "Commodity Procurement",
            "Position level": "5",
            "Working time": "Full Time",
            "Contract type": "Permanent",
            "Working pattern": "9am - 6pm Monday to Friday"
        },
        "link": "https://mclarencareers.mclaren.com/careers/JobDetail/Buyer/58883"
    },
    {
        "title": "",
        "description_html": null,
        "description_text": "Job Title\nBuyer - Programme Procurement\nRef #\n54107\nDate posted\nFriday, October 3, 2025\nCountry\nUnited Kingdom\nLocation\nWoking\nBusiness area\nProcurement\nDepartment\nProgramme Procurement\nPosition level\n5\nWorking time\nFull Time\nContract type\nPermanent\nWorking pattern\n9am - 6pm Monday to Friday\nWhat to Expect\nThe Procurement Programme team is part of the Procurement organisation and is the interface between Direct Procurement, Programme Management, Engineering, Manufacturing, Finance and the wider business.  To support the Business's delivery of its upcoming Vehicle Programmes, your role will be to drive Procurement activities and performance across a variety of commodities, ensuring on-time Programme delivery and satisfaction of key Procurement deliverables and milestones. You’ll develop strong cross-functional relationships through close liaison with Programme Management, Product Development, Supplier Quality, Cost Engineering, Finance and Manufacturing. Work across multiple teams in key workstreams and challenges to understand key issues, status and resolution and consequently supporting the teams to drive adequate action and mitigation plans to support Programme Delivery.\nWhat You'll Do\nWorking across Procurement, collate all relevant inputs and detail for Procurement performance against Programme milestones and gateway deliverables. Key aspects will include sourcing timelines, cost position, supplier selection, and supply chain risk management.\nDevelop sourcing and nomination plans across all future Programme content, working across the Direct Procurement department, and with key cross-functional stakeholders, ensuring all inputs are provided and robust plans created, published, and maintained.\nDevelop innovative ways for managing Programme data, metrics and performance measures for Procurement, utilising this data in a concise way to drive value-adding activities.\nSupport cost target creation for relevant Programmes (Bill of Material (BoM) and Capex) from a Procurement view-point to ensure that tough but achievable programme goals are set and clearly communicated.\nManage and coordinate cross functional stakeholders including Engineering and Manufacturing partners to develop plans for supply chain delivery.\nCollation and publishing of Procurement Programme metrics, KPI’s and programme statuses.\nDrive and support key Procurement workstreams, particularly Procurement Programme management digitalisation.\nBom cost status, relative to Programme Budget’s and Should-Costs.\nFull understanding of relevant Programme change content, and evolutions to this.\nCoordinate supply chain capacity confirmations, and awareness of constraints and bottlenecks.\nManaging carry-over part availability and any associated sourcing activities.\nSupply continuity; ensuring an awareness of supply continuity risks, limitations on supply, and associated mitigation plans.\nWorking closely with our SQD team, facilitate and input into supply chain launch readiness and associated APQP processes. Identification of prospective programme risk and co-development of mitigation plans.\nSupport and influence technical and commercial change management process, ensuring clear transparency of BoM cost evolution.\nComponent delivery: understanding of any risks to build phases and proactive mitigation.\nWhat You'll Bring\nBusiness Knowledge\nA good understanding of Manufacturing Development Processes, systems, and procedures;\nAn understanding of the typical commodities lead times and complexities would be beneficial;\nUnderstanding of project management principles and tools would be advantageous.\nAn understanding of the Product Development process.\nEssential Functional / Technical Skills\nMinimum of a university degree in Business or Engineering or equivalent (ideally automotive, aerospace or industrial)\nIdeally, professionally qualified or experienced in Programme Management\nWell versed in successfully delivering complex cross functional projects;\nUnderstanding      of the Procurement function and processes, ideally with at least 3 years      of Programme Management, Supplier Quality or Procurement experience\nHighly      proficient in Microsoft suite of tools and Programmes, and similarly      managing large data sets.\nExperience      in digitalisation tools and methodologies for a Procurement department      would be beneficial.\nPersonal Attributes / Competencies\nA multi-tasker who successfully prioritises and executes against tight deadlines in a rapidly evolving work environment.\nCourageous and ambitious – has a “can-do” attitude and willingness to do whatever it takes to achieve great results.\nPersonable with      the strong capability to work cross-functionally and develop collaborative      relationships.\nResults      driven and able to deliver against challenging targets to achieve the      overall programme and business objectives.\nExcellent      organisational skills, deadline adherence and exceptional attention to      detail and ability to analyse and summarise large data sets.\nThe      determination to drive forward the business to ‘Best in Class’ performance      standards.\nGood      working knowledge of both manufacturing and quality processes.\nStrong      written, verbal and presentation skills.\nWhat We'll Do for You\nStructured career development framework\n25 days’ holiday, plus bank holiday. Annual buy & sell up to five days.\nEnhanced company pension scheme\nDiscretionary annual bonus award\nPrivate medical insurance and health cash plan\nLife assurance 4x your basic salary\nAbility to apply for a sabbatical of up to one year after only two years’ service.\nBenefits you can adapt to your lifestyle, such as discounted shopping.\nGenerous parental leave policies including market leading maternity leave.\nTax efficient nursery scheme benefit.\nA range of wellbeing initiatives, such as employee assistance programme and free financial & mortgage advice\nFriends and family day\nOpportunities to experience our fantastic cars.\nWho Are We?\nNo restraints. No limitations. We don’t simply push boundaries. We completely rethink them. McLaren Automotive exists to create breath-taking performance road cars.\nIt takes a community to do what we do. A diverse group of people with many areas of expertise, united by their passion to deliver visionary products and set new benchmarks.\nMcLaren Automotive commits to equal opportunity for all. Diversity, Equality and Inclusion is at the heart of our impact, it drives our innovation and enables us to truly create something special. Join us on our journey.\n< Back to job list\nApply\nShare this job:\nShare\nLinkedIn\nFacebook\nEmail",
        "application_url": "https://mclarencareers.mclaren.com/careers/Login?jobId=58541",
        "": {},
        "metadata": {
            "Job Title": "Buyer - Programme Procurement",
            "Ref #": "54107",
            "Date posted": "Friday, October 3, 2025",
            "Country": "United Kingdom",
            "Location": "Woking",
            "Business area": "Procurement",
            "Department": "Programme Procurement",
            "Position level": "5",
            "Working time": "Full Time",
            "Contract type": "Permanent",
            "Working pattern": "9am - 6pm Monday to Friday"
        },
        "link": "https://mclarencareers.mclaren.com/careers/JobDetail/Programme-Buyer/58541"
    },
    {
        "title": "",
        "description_html": null,
        "description_text": "Job Title\nSenior Programme Buyer\nRef #\n54122\nDate posted\nMonday, September 22, 2025\nCountry\nUnited Kingdom\nLocation\nWoking\nBusiness area\nProcurement\nDepartment\nProgramme Procurement\nPosition level\n5 - Supervisory / Professional​ - (L-16)\nWorking time\nFull Time\nContract type\nPermanent\nWorking pattern\n8:30am - 5:30pm Monday to Friday\nSalary\nTBC\nWhat to Expect\nThe Procurement Programme team is part of the Procurement organisation and is the interface between Direct Procurement, Programme Management, Engineering, Manufacturing, Finance and the wider business.  To support the Business's delivery of its upcoming Vehicle Programmes, your role will be to Project manage the sourcing and supply chain delivery for all commodities within Direct Procurement. This will require ensuring stakeholder adherence to Procurement policies, processes and procedures whilst facilitating alignment across the Engineering, Supplier Quality, Programme, Finance and broader cross-functional teams.  This role will require an element of leadership as the successful candidate will be responsible for supporting and guiding Procurement team members, and influencing key senior stakeholders.\nLocation: Woking or Bicester, Oxfordshire\nWhat You'll Do\nThe Senior Programme Buyer is accountable for the following key activities:\nDrive and maintain Direct Procurement sourcing timelines against key Programme deliverables such as cost, supplier selection, supply chain risk management and programme milestones.\nEarly engagement with Engineering, Vehicle Line Delivery & other functions to apply the McLaren Development Process (MDP) for that New Model, considering strategy, cost, quality, timing and resources.\nBe the gatekeeper and owner for Procurement sourcing and nomination planning, considering programme content, milestones, sourcing lead times and category strategies.\nActively contribute to the creation of cost targets (Bill of Material (BoM) and Capex) from a Procurement view-point to ensure that tough but achievable programme goals are set and clearly communicated. Actively feeding back and influencing targets in VLD, Finance & EFL based on Procurement intelligence.\nManage and coordinate cross functional stakeholders including Engineering and Manufacturing partners to develop plans for supply chain delivery.\nResponsible for representing the Procurement team through metrics, KPIs and status in key management reviews whilst maintaining their accuracy.\nStrong awareness and governance of pre-SOP BoM cost and CapEx positions, including:\nBom cost status, relative to Programme Budget’s and Should-Costs.\nDriving delivery of cost reduction opportunities, and supporting risk mitigation.\nSupplier CapEx position, including phasing, relative to Programme Budget’s and Should-Costs.\nCarry-over component cost forecasting and risk provisioning.\nCreate the required information release plans based on needed dates and negotiate them with Procurement and VLD / Engineering. Publish and hold everyone to account. Manage deviations from plan.\nFull understanding of relevant Programme change content, and evolutions to this.\nSupply chain capacity confirmations, and awareness of constraints and bottlenecks.\nManaging carry-over part availability and any associated sourcing activities.\nSupply continuity; ensuring a strong understanding of continuity risk, limitations on supply, and associated mitigation plans.\nWorking closely with our SQD team, support supply chain launch readiness and associated APQP processes. Identification of prospective programme risk and co-development of mitigation plans.\nGovern technical and commercial change management process, ensuring clear transparency of BoM cost evolution.\nComponent delivery: understanding of any risks to build phases and proactive mitigation.\nDrive and support key Procurement workstreams, understand critical issues & work with teams to formulate mitigation responses and ensure successful programme delivery.\nSupport in driving continuous improvement across the Business.\nWhat You'll Bring\nBusiness Knowledge\nA good understanding of the ‘partner’ functions that Procurement must work with and influence, in order to deliver Procurement’s programme objectives;\nA strong understanding of Manufacturing Development Processes, systems, and procedures;\nAn understanding of the typical commodity lead times and complexities would be beneficial;\nUnderstanding of project management principles and tools would be advantageous.\nAn understanding of the Product Development process.\nEssential Functional / Technical Skills\nMinimum of a university degree in Business or Engineering or equivalent (ideally automotive, aerospace or industrial)\nIdeally, professionally qualified or experienced in Programme Management\nWell versed in successfully delivering complex cross functional projects;\nDeep understanding of the Procurement function and processes, ideally with at least 5 years of Programme Management, Supplier Quality or Procurement experience\nHighly proficient in Microsoft Outlook, Word, Excel, PowerPoint, Project, Visio etc.\nExperience in digitalisation tools and methodologies for a Procurement department would be beneficial.\nExperience with structured Problem Solving (8D) would be advantageous\nPersonal Attributes / Competencies\nA multi-tasker who successfully prioritises and executes against tight deadlines in a rapidly evolving work environment.\nCourageous and ambitious – has a “can-do” attitude and willingness to do whatever it takes to achieve great results.\nPersonable with the strong capability to work cross-functionally and develop collaborative relationships.\nAble to effectively influence at all levels of the business from buyer to senior manager, with the appropriate level of detail;\nResults driven and able to deliver against challenging targets to achieve the overall programme and business objectives.\nExcellent organisational skills, deadline adherence and exceptional attention to detail and ability to analyse and summarise large data sets.\nThe determination to drive forward the business to ‘Best in Class’ performance standards.\nGood working knowledge of both manufacturing and quality processes.\nStrong written, verbal and presentation skills.\nWhat We'll Do for You\nWe offer a wide – ranging benefits package, which includes:\nStructured career development framework\n25 days’ holiday, plus bank holiday. Annual buy & sell up to five days\nEnhanced company pension scheme\nDiscretionary annual bonus award\nPrivate medical insurance and health cash plan\nLife assurance benefit\nAbility to apply for a sabbatical of up to one year after only two years’ service\nBenefits you can adapt to your lifestyle, such as discounted shopping\nGenerous parental leave policies\nA range of wellbeing initiatives, such as employee assistance programme and free financial & mortgage advice\nWho Are We?\nNo restraints. No limitations. We don’t simply push boundaries. We completely rethink them. McLaren Automotive exists to create breath-taking performance road cars.\nIt takes a community to do what we do. A diverse group of people with many areas of expertise, united by their passion to deliver visionary products and set new benchmarks.\nMcLaren Automotive commits to equal opportunity for all. Diversity, Equality and Inclusion is at the heart of our impact, it drives our innovation and enables us to truly create something special. Join us on our journey.\n< Back to job list\nApply\nShare this job:\nShare\nLinkedIn\nFacebook\nEmail",
        "application_url": "https://mclarencareers.mclaren.com/careers/Login?jobId=58556",
        "": {},
        "metadata": {
            "Job Title": "Senior Programme Buyer",
            "Ref #": "54122",
            "Date posted": "Monday, September 22, 2025",
            "Country": "United Kingdom",
            "Location": "Woking",
            "Business area": "Procurement",
            "Department": "Programme Procurement",
            "Position level": "5 - Supervisory / Professional​ - (L-16)",
            "Working time": "Full Time",
            "Contract type": "Permanent",
            "Working pattern": "8:30am - 5:30pm Monday to Friday",
            "Salary": "TBC"
        },
        "link": "https://mclarencareers.mclaren.com/careers/JobDetail/Senior-Programme-Buyer/58556"
    },
    {
        "title": "",
        "description_html": null,
        "description_text": "Job Title\nEnd of Line Technician - Ultimate Series\nRef #\n53807\nDate posted\nWednesday, September 10, 2025\nCountry\nUnited Kingdom\nLocation\nWoking\nBusiness area\nManufacturing\nDepartment\nSeries Rework\nPosition level\nJ - Technician / Administrator\nWorking time\nFull Time\nContract type\nPermanent\nWorking pattern\n7:30am - 4:30pm Monday to Friday\nWhat to Expect\nAs an End of Line technician within the production area, reporting to the Team Leader at McLaren Automotive, you will take on a role in ensuring a seamless and efficient operation is at it’s very best within one of our built-in quality areas, ensuring production continue a consistent, high quality build process.\nWhat You'll Do\nYour primary responsibility will be practical problem solving any issues found within the quality stations, reworking the fault to the require standard of process, also conducting a 4m method to quickly resolve within our internal stakeholder team. You will also ensure all health and safety guidelines are adhered too. Your contributions will be instrumental in achieving our ambitious goals as a company.\nWhat You'll Bring\nEssential Functional / Technical Skills\nThe understanding of processes/work instructions to deliver a consistent process.\nThe understanding of workplace safety risk assessments and their meaning.\nAbility to make sound and logical decisions.\nExperience of working under pressure and to tight deadlines\nKnowledge within automotive sector is required.\nPersonal Attributes / Competencies\nHigh attention to detail and quality standards\nConfident and professional always\nAble to act under pressure with calmness, clarity of thought\nFlexible approach to the working day if or when circumstances dictate\nGood communicator\nPunctual\nWilling to learn and train others “can do attitude”\nWhat We'll Do for You\nWe offer a wide - ranging benefits package, which includes:\nStructured career development framework.\n25 days' holiday, plus bank holiday. Annual buy & sell up to five days.\nEnhanced company pension scheme.\nDiscretionary annual bonus award.\nPrivate medical insurance and health cash plan.\nLife assurance benefit.\nAbility to apply for a sabbatical of up to one year after only two years' service.\nBenefits you can adapt to your lifestyle, such as discounted shopping.\nGenerous parental leave policies.\nA range of wellbeing initiatives, such as employee assistance programme and free financial & mortgage.\nWho Are We?\nNo restraints. No limitations. We don’t simply push boundaries. We completely rethink them. McLaren Automotive exists to create breath-taking performance road cars.\nIt takes a community to do what we do. A diverse group of people with many areas of expertise, united by their passion to deliver visionary products and set new benchmarks.\nMcLaren Automotive commits to equal opportunity for all. Diversity, Equality and Inclusion is at the heart of our impact, it drives our innovation and enables us to truly create something special. Join us on our journey.\n< Back to job list\nApply\nShare this job:\nShare\nLinkedIn\nFacebook\nEmail",
        "application_url": "https://mclarencareers.mclaren.com/careers/Login?jobId=58237",
        "": {},
        "metadata": {
            "Job Title": "End of Line Technician - Ultimate Series",
            "Ref #": "53807",
            "Date posted": "Wednesday, September 10, 2025",
            "Country": "United Kingdom",
            "Location": "Woking",
            "Business area": "Manufacturing",
            "Department": "Series Rework",
            "Position level": "J - Technician / Administrator",
            "Working time": "Full Time",
            "Contract type": "Permanent",
            "Working pattern": "7:30am - 4:30pm Monday to Friday"
        },
        "link": "https://mclarencareers.mclaren.com/careers/JobDetail/End-of-Line-Principle-Technician-Ultimate-Series/58237"
    },
    {
        "title": "",
        "description_html": null,
        "description_text": "Job Title\nMotorsport Technician\nRef #\n53091\nDate posted\nThursday, May 22, 2025\nCountry\nUnited Kingdom\nLocation\nWoking\nBusiness area\nMotorsport\nDepartment\nMotorsport Production\nPosition level\n6\nWorking time\nFull Time\nContract type\nPermanent\nWorking pattern\n7:30am - 4:30pm Monday to Friday\nWhat to Expect\nWorking in the motorsport team, this role will play a pivotal role in providing market leading service to our global customer base.\nThis is a fundamentally key role to managing and enhancing the relationship between McLaren Customer Racing and all our customer racing teams.\nWhat You'll Do\nPreparation and execution of chassis composite reworks prior to car build as required.\nBuild and preparation of McLaren Motorsport cars to the required specification.\nAccountable for build and preparation of the car and respective sub-assemblies\nUnderstand and follow detailed work instructions relating to the assembling of motorsport vehicles.\nEnsure that all build operations on each vehicle are completed to the required quality standards.\nWork as part of a team on the definition and solution of problems that may be affecting the quality, cost or productivity of the vehicles being produced.\nSupport the development and launch into production future McLaren Motorsport vehicle platforms and variants.\nSupport with the development of vehicle assembly processes for all assembly disciplines\nSupport the team and wider business functions to ensure all quality targets are correctly specified and achieved.\nSupport and participate in continuous improvement initiatives.\nWork alongside the Product Design Engineering team in identifying resolutions for product related issues during the pre-production build phases.\nWhat You'll Bring\nExperience of working within a low volume vehicle production / motorsport build environment essential.\nExperience of composite trimming, grinding, and drilling to high standards.\nBase level understanding of the differences between track-based cars and road-based vehicles\nHave value added experience in the field of vehicle manufacturing practices.\nTaking receipt of guidance and instruction from multiple leadership direction.\nFlexible approach to work hours to support program targets.\nDetermination to drive forward the business to “Best in Class” performance standards in line with brand expectations.\nTakes the opportunity to proactively use initiative where appropriate.\nA team player who can support others whilst also getting involved in day-to-day tasks as necessary.\nGood analytical skills and attention to detail\nResults focused and driven to achieve successful outcome.\nGood interpersonal and communication skills.\nAdhere to the McLaren Values and help grow the Automotive & Motorsport Brand.\nActively seeks ways to improve their quality of work through constructive feedback or self-education.\nFlexibility when working unsociable hours in support of meeting program targets and maintain a flexible approach to working hours.\nWhat We'll Do for You\nWe offer a wide – ranging benefits package, which includes:\nStructured career development framework\n25\ndays’ holiday, plus bank holiday. Annual buy & sell up to five days\nEnhanced company pension scheme\nDiscretionary annual bonus award\nPrivate medical insurance and health cash plan\nLife assurance 4x your basic salary\nAbility to apply for a sabbatical of up to one year after only two years’ service\nBenefits you can adapt to your lifestyle, such as discounted shopping\nGenerous parental leave policies including market leading maternity leave\nTax efficient nursery scheme benefit\nA range of wellbeing initiatives, such as employee assistance programme and free financial & mortgage advice\nFriends and family day\nOpportunities to experience our fantastic cars\nQualifying criteria applies\nWe recognise that we can only achieve our vision with the dedication and collaboration of our world class employees.  It is our aim to become the employer of choice within the global automotive industry.\nMcLaren Automotive are constantly looking to improve. To become the employer of choice, we are always looking to develop our employee offerings. We currently offer a range of benefits to employees at all levels of the business including Private Healthcare, Contributory Pension Scheme, Life Assurance and Personal Lease Car Scheme. We also offer a range of discounts with our partner organisations.\nWho Are We?\nNo restraints. No limitations. We don’t simply push boundaries. We completely rethink them. McLaren Automotive exists to create breath-taking performance road cars.\nIt takes a community to do what we do. A diverse group of people with many areas of expertise, united by their passion to deliver visionary products and set new benchmarks.\nMcLaren Automotive commits to equal opportunity for all. Diversity, Equality and Inclusion is at the heart of our impact, it drives our innovation and enables us to truly create something special. Join us on our journey.\n< Back to job list\nApply\nShare this job:\nShare\nLinkedIn\nFacebook\nEmail",
        "application_url": "https://mclarencareers.mclaren.com/careers/Login?jobId=57498",
        "": {},
        "metadata": {
            "Job Title": "Motorsport Technician",
            "Ref #": "53091",
            "Date posted": "Thursday, May 22, 2025",
            "Country": "United Kingdom",
            "Location": "Woking",
            "Business area": "Motorsport",
            "Department": "Motorsport Production",
            "Position level": "6",
            "Working time": "Full Time",
            "Contract type": "Permanent",
            "Working pattern": "7:30am - 4:30pm Monday to Friday"
        },
        "link": "https://mclarencareers.mclaren.com/careers/JobDetail/Motorsport-Technician/57498"
    },
    {
        "title": "",
        "description_html": null,
        "description_text": "Job Title\nUltimate Series Production Technician\nRef #\n53609\nDate posted\nThursday, May 15, 2025\nCountry\nUnited Kingdom\nLocation\nWoking\nBusiness area\nManufacturing\nDepartment\nNew Model Launch\nPosition level\n6\nWorking time\nFull Time\nContract type\nFixed Term Contract\nDuration\n24 months\nWorking pattern\n5:30am - 2:15pm Monday to Friday\nWhat to Expect\nWe're seeking a skilled and motivated Vehicle Technician to play a key role in launching new models into production. You'll work closely with the Launch team to ensure a smooth transition, meeting all quality, cost and volume targets. In addition to building Ultimate Series vehicle to required production volumes, you'll support wider business needs as required in a fast-paced, high performance environment.\nWhat You'll Do\nThe Ultimate Series Technician will be expected to;\nUnderstand and follow detailed work instructions relating to the construction, painting or assembling of vehicles.\nEnsure that all station operations on each vehicle are completed to the required quality standard.\nEnsure that all operations are completed to the required timescale.\nWork as part of a team on the definition and solution of problems that may be affecting the quality, cost or productivity of the vehicles being produced.\nAttend the workplace on a regular and timely basis, informing the Team leader of any lateness or unplanned absence in a timely manner.\nEnsure the work area is clean, tidy and orderly at all times in line with brand expectations.\nMaintain a safe working environment for yourself and other team members, participating in safety activities as requested.\nParticipate in continuous improvement activities as requested.\nProvide first hand support in the development and launch into production of future McLaren Automotive vehicle platforms and variants.\nProvide first hand support with the development of vehicle assembly processes for all assembly disciplines\nProvide first hand support with the development and specification of bespoke assembly tool and fixture equipment.\nProvide first hand support with the identification and specification of generic hand tool requirements for both prototype and production build phases.\nProvide first hand support with the generation of vehicle build concerns, documentation of and relevant root cause analysis\nProvide first hand support with assembly of prototype vehicles during the relevant prototype and development build phase\nProvide first hand support for vehicle / variant launch into production.\nProvide first hand support with the training of new build technicians to enable smooth transition into series manufacture\nClearly understand and adhere to McLaren brand values\nAs and when business determines, provide series production support during periods of absence / peak holiday.\nWhat You'll Bring\nIt is preferred that the candidate will have value added experience with:\nMinimum Level 2/3 Diploma in Light Vehicle maintenance and/or Electric/Hybrid Vehicle System repair and replacement\nPrototype build activity\nVehicle production launch experience\nBuild concern reporting\nQuality measurement systems, could include Faro arm usage\nWorking to demanding time schedules\nProcess and product maturation\nWorking in small teams\nPersonal Attributes\nThe candidate will have excellent motivational attributes\nThe candidate will be prepared to coach and develop peer skill sets\nThe candidate will have an understanding of niche vehicle brand requirements and have a minimum of 12 months experience working on Ultra High performance and/or prestige vehicles.\nAn ability to act under pressure with calmness with clarity of thought\nThe candidate will have determination to drive forward the business to ‘Best in Class’ performance standards in line with brand expectations\nDemonstrate a methodical approach towards problem solving\nExcellent communication skills both written and verbal\nThe applicant must be extremely trustworthy\nExcellent attention to detail\nTake advantage of a dynamic and flexible work schedule, where your adaptability to occasional shifts will play a key role in supporting the team\nHave value added experience in the field of production vehicle manufacturing.\nWhat We'll Do for You\nWe offer a wide – ranging benefits package, which includes:\nStructured career development framework\n25 days’ holiday, plus bank holiday. Annual buy & sell up to five days.\nEnhanced company pension scheme\nDiscretionary annual bonus award\nPrivate medical insurance and health cash plan\nLife assurance benefit\nAbility to apply for a sabbatical of up to one year after only two years’ service.\nBenefits you can adapt to your lifestyle, such as discounted shopping.\nGenerous parental leave policies\nA range of wellbeing initiatives, such as employee assistance programme and free financial & mortgage advice\nQualifying criteria applies.\nWho Are We?\nNo restraints. No limitations. We don’t simply push boundaries. We completely rethink them. McLaren Automotive exists to create breath-taking performance road cars.\nIt takes a community to do what we do. A diverse group of people with many areas of expertise, united by their passion to deliver visionary products and set new benchmarks.\nMcLaren Automotive commits to equal opportunity for all. Diversity, Equality and Inclusion is at the heart of our impact, it drives our innovation and enables us to truly create something special. Join us on our journey.\n< Back to job list\nApply\nShare this job:\nShare\nLinkedIn\nFacebook\nEmail",
        "application_url": "https://mclarencareers.mclaren.com/careers/Login?jobId=58039",
        "": {},
        "metadata": {
            "Job Title": "Ultimate Series Production Technician",
            "Ref #": "53609",
            "Date posted": "Thursday, May 15, 2025",
            "Country": "United Kingdom",
            "Location": "Woking",
            "Business area": "Manufacturing",
            "Department": "New Model Launch",
            "Position level": "6",
            "Working time": "Full Time",
            "Contract type": "Fixed Term Contract",
            "Duration": "24 months",
            "Working pattern": "5:30am - 2:15pm Monday to Friday"
        },
        "link": "https://mclarencareers.mclaren.com/careers/JobDetail/Ultimate-Series-Production-Technician/58039"
    }
]