[
    {
        "title": "Marketing Manager, Durable Medical Equipment",
        "description_html": null,
        "description_text": "General information\nLocation\nRemote\nFunction\nMarketing\nBusiness Unit\nShared Services\nFull-time/Part-time\nFull Time\nSalary Range Min - Max (USD)\n66100-109100\nCountry\nUnited States\nDate\n07-Oct-2025\nJob ID\n5149\nDescription & Requirements\nJoin Our Team and Make a Difference!\nAre you looking for an impactful role where you finish the workday knowing you helped someone? Whether you are part of our care coordination team or play a supporting role, the work our colleagues do every day enables us to collectively reach our mission of\ngetting people the care they need when they need it.\nBy staying committed to our core values of\nThink Big, Go Fast, Deliver Awe, Win Together and Care Deeply\n,\nwe can positively impact the lives of the injured workers we serve and get them back to the things that matter most in life.\nSalary Range:\nThis compensation range considers a wide range of factors, including, but not limited to, skill set, experience and training, licensure and certifications, and other business and organizational needs. The disclosed range estimate is not adjusted for geographic differential associated with the location where the position may be filled. At One Call, it is not typical for an individual to be hired at or near the top of the range for their role, and compensation decisions are dependent on the facts and circumstances of each case.\nWhat We Provide in Return for Your Commitment to Our Mission\nWe offer a vast array of benefits to help support the whole you, including:\nRemote Work:\nWe are a remote-first company, and almost all positions receive the flexibility of working from home.\nGenerous Time Off:\nBesides 8 company holidays and 2 personal days every year, all colleagues receive a minimum of 18 days of paid time off.\nComprehensive Benefits Package:\nIncluding medical, dental, vision, and pet insurance; 401(k) matching program; and company-paid life insurance and short and long-term disability coverage.\nSupportive Services:\nJust like our colleagues get injured workers the care they need when they need it, we want to do the same for our colleagues in their time of need. We offer a Colleague Assistance Program that provides free counseling and financial services, and our One Call Foundation, a non-profit arm of our company, provides colleagues financial assistance during times of unexpected hardships.\nJOB SUMMARY:\nThe Marketing Manager, DME, is responsible for developing and executing strategies that position our products and services effectively in the market, driving adoption and fueling revenue growth. This role ensures alignment across go-to-market initiatives, customer insights and competitive intelligence. The manager will own core messaging, analyze market trends, customer insights and competitive landscapes to shape strategy and drive revenue growth and will serve as a key member of the growth marketing team, supporting sales and revenue goals.\nESSENTIAL DUTIES & RESPONSIBILITIES:\nGo-to-Market & Pricing Strategy\nLead product marketing launches, positioning and pricing strategies.\nPartner with product and commercial teams to build go-to-market plans that maximize adoption and growth.\nKPIs for Market Success\nTrack and analyze key performance indicators tied to market adoption, revenue growth and product differentiation.\nProvide reporting and insights that inform ongoing optimization.\nCustomer Insights\nBuild customer personas and segmentation models to deepen understanding of target audiences.\nCollect and analyze customer feedback to inform product positioning and roadmap priorities.\nCompetitive Landscape Analysis\nConduct market and competitor research including win/loss sentiment analysis in partnership with sales.\nTranslate insights into actionable recommendations for positioning and sales enablement.\nSales Enablement & Competitive Tools\nDevelop and maintain competitive battlecards and playbooks to support sales teams.\nCreate sales enablement materials in collaboration with growth marketing to ensure consistent messaging.\nIndustry & Market Analysis\nMonitor industry trends, buyer behavior and market opportunities across service lines.\nDeliver insights that shape marketing and product strategies.\nCore Value Messaging\nCraft messaging frameworks, value propositions and differentiators that resonate with customers and prospects.\nEnsure messaging consistency across marketing campaigns, sales materials and client communications.\nMarket-Facing Education\nConduct external trainings, workshops, and presentations in collaboration with sales and growth marketing.\nPosition the company as a thought leader through education-driven engagement.\nMarket Insights & Product Innovation\nProvide insights that influence product innovation and long-term roadmap development.\nCollaborate with the technology team to align education and messaging with future offerings.\nSuccessful Product Launches\nDrive execution of product launches and awareness campaigns.\nPartner cross-functionally to ensure alignment across strategy, messaging and execution.\nEDUCATIONAL AND EXPERIENCE REQUIREMENTS:\nBachelor's degree in Marketing, Business, Communications or related fields.\n7+ years of experience in product marketing, go-to-market strategy or related field, preference for workers comp or product/service line specific background\nStrong analytical skills with ability to translate data into actionable insights.\nExcellent verbal and written communication skills including experience crafting messaging and delivering presentations.\nExperience in creating sales enablement tools and collaborating cross-functionally.\nKnowledge of competitive research, customer insights and market analysis.\nAbility to manage multiple projects in a fast-paced environment.\nESSENTIAL KNOWLEDGE, SKILLS & ABILITIES:\nAbility to work in an environment that aligns with the company's diversity, equity, inclusion and belonging standards.\nAbility to work both independently and in a team environment.\nStrategic thinking and market awareness.\nStrong collaboration and interpersonal skills.\nResults-driven with focus on adoption, growth and differentiation.\nAbility to simplify complex concepts into clear customer-facing messaging.\nProactive, resourceful and adaptable.\nDemonstrate our core values of Think Big, Go Fast, Deliver Awe, Win Together, and Care Deeply.\nPHYSICAL/MENTAL DEMANDS & WORK ENVIRONMENT:\nThis position will be performed in the colleague’s home with work related travel required.\nWork-from-home requirements include the colleague’s ability to set up computer equipment within their home office.\nThis job is primarily sedentary and may involve repetitive motions; the colleague must be able to remain in a stationary position for extended periods of time, operate a computer and other office equipment, assess information and files stored electronically, and converse/exchange accurate information with others, simultaneously.\nThe colleague must be able to discern text displayed on a monitor, input data into specific fields using a keyboard, and adjust focus to distances of up to three feet.\nThe colleague must have the ability to learn new tasks, follow established processes, maintain focus, complete tasks independently, complete multiple tasks simultaneously, communicate professionally with colleagues and customers, and complete tasks in situations that require speed or productivity.\nThe colleague must be able to manage competing deadlines and prioritize appropriately.\nPlease be advised that job descriptions typically change over time as business needs, job requirements, and employee skill levels change. As such, One Call retains the right to change or assign other duties to this position at any time.\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment regardless to race, color, religion, sex, nationality, disability status, protected veteran status, or any other status protected by law.\nGo back\nApply\nFacebook\nLinkedIn\nX\nEmail",
        "application_url": "https://onecall.avature.net/careers/SearchJobs/?folderRecordsPerPage=6&folderOffset=0&jobOffset=0",
        "": {},
        "metadata": {
            "Location": "Remote",
            "Function": "Marketing",
            "Business Unit": "Shared Services",
            "Full-time/Part-time": "Full Time",
            "Salary Range Min - Max (USD)": "66100-109100",
            "Country": "United States",
            "Date": "07-Oct-2025",
            "Job ID": "5149"
        },
        "link": "https://onecall.avature.net/careers/JobDetail/Marketing-Mgr-DME/5149"
    },
    {
        "title": "Care Coordinator I",
        "description_html": null,
        "description_text": "General information\nLocation\nRemote\nFunction\nOps-CSR\nBusiness Unit\nCentral Operations\nFull-time/Part-time\nFull Time\nSalary Range Min - Max (USD)\n16.5-21.5\nCountry\nUnited States\nDate\n21-Nov-2025\nJob ID\n5240\nDescription & Requirements\nPay Rate: $16.50-$17.50/hr plus benefits and almost four weeks of paid vacation time!\nJoin Our Team and Make a Difference!\nAre you looking for an impactful role where you finish the workday knowing you helped someone? Whether you are part of our care coordination team or play a supporting role, the work our colleagues do every day enables us to collectively reach our mission of\ngetting people the care they need when they need it.\nBy staying committed to our core values of\nThink Big, Go Fast, Deliver Awe, Win Together and Care Deeply\n,\nwe can positively impact the lives of the injured workers we serve and get them back to the things that matter most in life.\nSalary Range:\nThis compensation range considers a wide range of factors, including, but not limited to, skill set, experience and training, licensure and certifications, and other business and organizational needs. The disclosed range estimate is not adjusted for geographic differential associated with the location where the position may be filled. At One Call, it is not typical for an individual to be hired at or near the top of the range for their role, and compensation decisions are dependent on the facts and circumstances of each case.\nWhat We Provide in Return for Your Commitment to Our Mission\nWe offer a vast array of benefits to help support the whole you, including:\nRemote Work:\nWe are a remote-first company, and almost all positions receive the flexibility of working from home.\nGenerous Time Off:\nBesides 8 company holidays and 2 personal days every year, all colleagues receive a minimum of 18 days of paid time off.\nComprehensive Benefits Package:\nIncluding medical, dental, vision, and pet insurance; 401(k) matching program; and company-paid life insurance and short and long-term disability coverage.\nSupportive Services:\nJust like our colleagues get injured workers the care they need when they need it, we want to do the same for our colleagues in their time of need. We offer a Colleague Assistance Program that provides free counseling and financial services, and our One Call Foundation, a non-profit arm of our company, provides colleagues financial assistance during times of unexpected hardships.\nJOB SUMMARY:\nProvides customer support to business customers via the telephone and/or Internet (e.g. instant message email). Handles customer inquiries and resolves simple and basic support issues such as address changes processing orders warranty or billing/payment. For product or service-related issues will move customer to appropriate Product Support Specialist. Performs other administrative duties as requested.\nESSENTIAL DUTIES & RESPONSIBILITIES:\nProvides customer support by phone email or instant messaging to business customers. Serves as primary contact for inbound customers issues. Escalates more technical product-related issues to the proper Product Support department.\nProcesses a high volume of customer inquiries of One Call Care Management products and services and resolves a targeted percentage of those inquiries.\nTroubleshoots customer problems identifies the root cause of the problem and uses tool and resources appropriately to determine how to resolve customer problems.\nWhen unable to resolve the problem in a reasonable amount of time will escalate to the appropriate resource. Follows up on escalated issues with coaching and mentoring to learn the appropriate solution and expand overall knowledge.\nTracks and documents inbound support requests and ensures proper notation of customer problems or issues.\nUpdates customer information and ensures accurate entry of contact information.\nMeets the standards of the job such as quality standards adherence to schedule and average handle time.\nMay provide guidance and/or mentoring to less experienced Customer Service Associates - Business.\nEDUCATIONAL AND EXPERIENCE REQUIREMENTS:\nA high school diploma or GED is required for this role. Associate or Bachelor’s degree is preferable; or the equivalent combination of education training and work experience.\nESSENTIAL KNOWLEDGE SKILLS & ABILITIES:\nKnowledge of the company’s products services and business operations to enable resolution of customer inquiries.\nExcellent customer service skills that build high levels of customer.\nExcellent verbal and written communication skills.\nComputer navigation and operation skills.\nDemonstrates effective people skills and sensitivities when dealing with others.\nAbility to work both independently and in a team environment.\nAbility to work in an environment that aligns with the company's diversity equity inclusion and belonging standards.\nAbility to work both independently and in a team environment.\nDemonstrate our core values of Think Big Go Fast Deliver Awe and Win Together.\nPHYSICAL/MENTAL DEMANDS & WORK ENVIRONMENT:\nThis position will be performed in the colleague’s home. Work-from-home requirements include the colleague’s ability to set up computer equipment within their home office.\nThis job is primarily sedentary and may involve repetitive motions; the colleague must be able to remain in a stationary position for extended periods of time operate a computer and other office equipment assess information and files stored electronically and converse/exchange accurate information with others simultaneously.\nThe colleague must be able to discern text displayed on a monitor input data into specific fields using a keyboard and adjust focus to distances of up to three feet.\nThe colleague must have the ability to learn new tasks follow established processes maintain focus complete tasks independently complete multiple tasks simultaneously communicate professionally with colleagues and customers and complete tasks in situations that have a speed or productivity requirement.\nThe colleague must be able to manage moderate to significant mental stress as a result of but not limited to a dynamic and heavy workload.\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment regardless to race, color, religion, sex, nationality, disability status, protected veteran status, or any other status protected by law.\nGo back\nApply\nFacebook\nLinkedIn\nX\nEmail",
        "application_url": "https://onecall.avature.net/careers/SearchJobs/?folderRecordsPerPage=6&folderOffset=0&jobOffset=0",
        "": {},
        "metadata": {
            "Location": "Remote",
            "Function": "Ops-CSR",
            "Business Unit": "Central Operations",
            "Full-time/Part-time": "Full Time",
            "Salary Range Min - Max (USD)": "16.5-21.5",
            "Country": "United States",
            "Date": "21-Nov-2025",
            "Job ID": "5240"
        },
        "link": "https://onecall.avature.net/careers/JobDetail/Care-Coordinator-I/5240"
    },
    {
        "title": "Sales Executive Mid-Market",
        "description_html": null,
        "description_text": "General information\nLocation\nRemote\nFunction\nCommercial\nBusiness Unit\nShared Services\nFull-time/Part-time\nFull Time\nSalary Range Min - Max (USD)\n86000-141800\nCountry\nUnited States\nDate\n04-Dec-2025\nJob ID\n5268\nDescription & Requirements\nJoin Our Team and Make a Difference!\nAre you looking for an impactful role where you finish the workday knowing you helped someone? Whether you are part of our care coordination team or play a supporting role, the work our colleagues do every day enables us to collectively reach our mission of\ngetting people the care they need when they need it.\nBy staying committed to our core values of\nThink Big, Go Fast, Deliver Awe, Win Together and Care Deeply\n,\nwe can positively impact the lives of the injured workers we serve and get them back to the things that matter most in life.\nSalary Range:\nThis compensation range considers a wide range of factors, including, but not limited to, skill set, experience and training, licensure and certifications, and other business and organizational needs. The disclosed range estimate is not adjusted for geographic differential associated with the location where the position may be filled. At One Call, it is not typical for an individual to be hired at or near the top of the range for their role, and compensation decisions are dependent on the facts and circumstances of each case.\nWhat We Provide in Return for Your Commitment to Our Mission\nWe offer a vast array of benefits to help support the whole you, including:\nRemote Work:\nWe are a remote-first company, and almost all positions receive the flexibility of working from home.\nGenerous Time Off:\nBesides 8 company holidays and 2 personal days every year, all colleagues receive a minimum of 18 days of paid time off.\nComprehensive Benefits Package:\nIncluding medical, dental, vision, and pet insurance; 401(k) matching program; and company-paid life insurance and short and long-term disability coverage.\nSupportive Services:\nJust like our colleagues get injured workers the care they need when they need it, we want to do the same for our colleagues in their time of need. We offer a Colleague Assistance Program that provides free counseling and financial services, and our One Call Foundation, a non-profit arm of our company, provides colleagues financial assistance during times of unexpected hardships.\nJOB SUMMARY:\nThe Sales Executive is responsible for identifying and developing new business opportunities to support the company’s revenue goals. This role involves pipeline development and fostering relationships with prospects and stakeholders. The Sales Executive collaborates with the sales and marketing teams to drive growth within assigned markets. Sales Executives are responsible for identifying, developing, and closing new business opportunities within mid-market commercial accounts in the Commercial Sales sectors. The ideal candidate is a skilled relationship builder and strategic thinker with a strong background in B2B sales and a passion for delivering value to clients.\nESSENTIAL DUTIES & RESPONSIBILITIES:\nStrategic Sales Execution:\nExecute the company’s sales strategy to meet assigned revenue targets.\nMonitor market trends and identify opportunities for targeted growth.\nAnalyze market trends and competitor activities to identify opportunities for expansion and differentiation.\nInstill a belief in the company's vision, mission, goals, and work to establish One Call as an industry expert.\nWork closely with the Commercial and cross-functional teams (marketing, product, operations) to support strategic initiatives and ensure seamless client onboarding & retention.\nBuild and maintain strong relationships with key stakeholders in mid-market commercial organizations. Serve as a trusted advisor and advocate for client success.\nBusiness & Pipeline Development:\nProspect and engage mid-market market clients through outbound efforts, networking, and strategic outreach to generate new business opportunities. Build and manage a prospective pipeline of sales opportunities.\nEstablish and maintain relationships with clients, brokers, and industry contacts.\nIdentify potential opportunities through research and client outreach.\nDemonstrate specialized product knowledge for One Call solutions, market, and competitive intelligence.\nPrepare and present proposals to prospects and industry stakeholders – utilizing One Call resources and tools.\nIdentify and mitigate risks associated with sales activities.\nStay informed on industry trends, competitive landscape, and client challenges to tailor solutions and position offerings effectively.\nSales Process Management:\nManage the full sales cycle from lead generation to contract negotiation and close, ensuring alignment with company goals and client needs.\nBusiness Development\nMaintain accurate records of sales activities, pipeline status, and client interactions in the CRM system. Provide regular updates and insights to leadership.\nMeet or exceed individual sales targets and contribute to the overall success of the mid-market segment.\nEDUCATIONAL AND EXPERIENCE REQUIREMENTS:\nBachelor’s degree in Business, Marketing, or related field\n3–5 years of experience in B2B sales, preferably in healthcare or workers’ compensation markets\nProven track record of success in mid-market account sales and revenue generation, preferably in healthcare and/or worker’s compensation markets\nStrong communication, negotiation, and presentation skills\nProficiency with CRM tools (e.g., Salesforce) and sales analytics\nSelf-motivated, goal-oriented, and adaptable in a fast-paced environment\nESSENTIAL KNOWLEDGE, SKILLS & ABILITIES:\nProven track record of success in a sales role within the insurance industry and/or workers' compensation.\nStrong understanding of workers' compensation insurance products and market dynamics.\nProficiency in using CRM software and other sales tools.\nStrategic Thinking: Ability to think long-term and develop comprehensive sales strategies.\nRelationship Building: Excellent ability to build and maintain relationships with clients, partners, and team members.\nNegotiation: Skilled negotiator with a proven track record in closing complex deals.\nAnalytical Skills: Strong analytical skills to assess market trends, sales performance, and financial data.\nCommunication: Outstanding verbal and written communication skills.\nAbility to work in an environment that aligns with the company's diversity, equity, inclusion and belonging standards.\nAbility to work both independently and in a team environment.\nDemonstrate our core values of Think Big, Go Fast, Deliver Awe, Win Together and Care Deeply.\nPHYSICAL/MENTAL DEMANDS & WORK ENVIRONMENT:\nThis position will be performed primarily in the colleague’s home but will also require travel to other sites and include both sedentary and active work.\nWork-from-home requirements include the colleague’s ability to set up computer equipment within their home office.\nTravel requirements include the colleague’s ability to move between work locations for client meetings and other field work assignments.\nThis role requires travel at a minimum of 50% of the time.\nThe colleague must be able to remain in a stationary position, operate a computer and other office equipment, perform repetitive motions, assess information and files stored electronically, converse with customers and exchange accurate information.\nThe colleague must be able to discern text displayed on a monitor and input data into specific fields using a keyboard.\nThe colleague must have the ability to learn new tasks, follow established processes, maintain focus, complete tasks independently, complete multiple tasks simultaneously, communicate professionally with colleagues and customers, and complete tasks in situations that have a speed or productivity requirement.\nThe colleague must be able to manage moderate to significant mental stress as a result of, but not limited to, a dynamic and heavy workload.\nPlease be advised that job descriptions typically change over time as business needs, job requirements, and employee skill levels change. As such, One Call retains the right to change or assign other duties to this position at any time.\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment regardless to race, color, religion, sex, nationality, disability status, protected veteran status, or any other status protected by law.\nGo back\nApply\nFacebook\nLinkedIn\nX\nEmail",
        "application_url": "https://onecall.avature.net/careers/SearchJobs/?folderRecordsPerPage=6&folderOffset=0&jobOffset=0",
        "": {},
        "metadata": {
            "Location": "Remote",
            "Function": "Commercial",
            "Business Unit": "Shared Services",
            "Full-time/Part-time": "Full Time",
            "Salary Range Min - Max (USD)": "86000-141800",
            "Country": "United States",
            "Date": "04-Dec-2025",
            "Job ID": "5268"
        },
        "link": "https://onecall.avature.net/careers/JobDetail/Sales-Exec-Mid-Market/5268"
    },
    {
        "title": "Sales Executive Mid-Market",
        "description_html": null,
        "description_text": "General information\nLocation\nRemote\nFunction\nCommercial\nBusiness Unit\nShared Services\nFull-time/Part-time\nFull Time\nSalary Range Min - Max (USD)\n86000-141800\nCountry\nUnited States\nDate\n04-Dec-2025\nJob ID\n5269\nDescription & Requirements\nJoin Our Team and Make a Difference!\nAre you looking for an impactful role where you finish the workday knowing you helped someone? Whether you are part of our care coordination team or play a supporting role, the work our colleagues do every day enables us to collectively reach our mission of\ngetting people the care they need when they need it.\nBy staying committed to our core values of\nThink Big, Go Fast, Deliver Awe, Win Together and Care Deeply\n,\nwe can positively impact the lives of the injured workers we serve and get them back to the things that matter most in life.\nSalary Range:\nThis compensation range considers a wide range of factors, including, but not limited to, skill set, experience and training, licensure and certifications, and other business and organizational needs. The disclosed range estimate is not adjusted for geographic differential associated with the location where the position may be filled. At One Call, it is not typical for an individual to be hired at or near the top of the range for their role, and compensation decisions are dependent on the facts and circumstances of each case.\nWhat We Provide in Return for Your Commitment to Our Mission\nWe offer a vast array of benefits to help support the whole you, including:\nRemote Work:\nWe are a remote-first company, and almost all positions receive the flexibility of working from home.\nGenerous Time Off:\nBesides 8 company holidays and 2 personal days every year, all colleagues receive a minimum of 18 days of paid time off.\nComprehensive Benefits Package:\nIncluding medical, dental, vision, and pet insurance; 401(k) matching program; and company-paid life insurance and short and long-term disability coverage.\nSupportive Services:\nJust like our colleagues get injured workers the care they need when they need it, we want to do the same for our colleagues in their time of need. We offer a Colleague Assistance Program that provides free counseling and financial services, and our One Call Foundation, a non-profit arm of our company, provides colleagues financial assistance during times of unexpected hardships.\nJOB SUMMARY:\nThe Sales Executive is responsible for identifying and developing new business opportunities to support the company’s revenue goals. This role involves pipeline development and fostering relationships with prospects and stakeholders. The Sales Executive collaborates with the sales and marketing teams to drive growth within assigned markets. Sales Executives are responsible for identifying, developing, and closing new business opportunities within mid-market commercial accounts in the Commercial Sales sectors. The ideal candidate is a skilled relationship builder and strategic thinker with a strong background in B2B sales and a passion for delivering value to clients.\nESSENTIAL DUTIES & RESPONSIBILITIES:\nStrategic Sales Execution:\nExecute the company’s sales strategy to meet assigned revenue targets.\nMonitor market trends and identify opportunities for targeted growth.\nAnalyze market trends and competitor activities to identify opportunities for expansion and differentiation.\nInstill a belief in the company's vision, mission, goals, and work to establish One Call as an industry expert.\nWork closely with the Commercial and cross-functional teams (marketing, product, operations) to support strategic initiatives and ensure seamless client onboarding & retention.\nBuild and maintain strong relationships with key stakeholders in mid-market commercial organizations. Serve as a trusted advisor and advocate for client success.\nBusiness & Pipeline Development:\nProspect and engage mid-market market clients through outbound efforts, networking, and strategic outreach to generate new business opportunities. Build and manage a prospective pipeline of sales opportunities.\nEstablish and maintain relationships with clients, brokers, and industry contacts.\nIdentify potential opportunities through research and client outreach.\nDemonstrate specialized product knowledge for One Call solutions, market, and competitive intelligence.\nPrepare and present proposals to prospects and industry stakeholders – utilizing One Call resources and tools.\nIdentify and mitigate risks associated with sales activities.\nStay informed on industry trends, competitive landscape, and client challenges to tailor solutions and position offerings effectively.\nSales Process Management:\nManage the full sales cycle from lead generation to contract negotiation and close, ensuring alignment with company goals and client needs.\nBusiness Development\nMaintain accurate records of sales activities, pipeline status, and client interactions in the CRM system. Provide regular updates and insights to leadership.\nMeet or exceed individual sales targets and contribute to the overall success of the mid-market segment.\nEDUCATIONAL AND EXPERIENCE REQUIREMENTS:\nBachelor’s degree in Business, Marketing, or related field\n3–5 years of experience in B2B sales, preferably in healthcare or workers’ compensation markets\nProven track record of success in mid-market account sales and revenue generation, preferably in healthcare and/or worker’s compensation markets\nStrong communication, negotiation, and presentation skills\nProficiency with CRM tools (e.g., Salesforce) and sales analytics\nSelf-motivated, goal-oriented, and adaptable in a fast-paced environment\nESSENTIAL KNOWLEDGE, SKILLS & ABILITIES:\nProven track record of success in a sales role within the insurance industry and/or workers' compensation.\nStrong understanding of workers' compensation insurance products and market dynamics.\nProficiency in using CRM software and other sales tools.\nStrategic Thinking: Ability to think long-term and develop comprehensive sales strategies.\nRelationship Building: Excellent ability to build and maintain relationships with clients, partners, and team members.\nNegotiation: Skilled negotiator with a proven track record in closing complex deals.\nAnalytical Skills: Strong analytical skills to assess market trends, sales performance, and financial data.\nCommunication: Outstanding verbal and written communication skills.\nAbility to work in an environment that aligns with the company's diversity, equity, inclusion and belonging standards.\nAbility to work both independently and in a team environment.\nDemonstrate our core values of Think Big, Go Fast, Deliver Awe, Win Together and Care Deeply.\nPHYSICAL/MENTAL DEMANDS & WORK ENVIRONMENT:\nThis position will be performed primarily in the colleague’s home but will also require travel to other sites and include both sedentary and active work.\nWork-from-home requirements include the colleague’s ability to set up computer equipment within their home office.\nTravel requirements include the colleague’s ability to move between work locations for client meetings and other field work assignments.\nThis role requires travel at a minimum of 50% of the time.\nThe colleague must be able to remain in a stationary position, operate a computer and other office equipment, perform repetitive motions, assess information and files stored electronically, converse with customers and exchange accurate information.\nThe colleague must be able to discern text displayed on a monitor and input data into specific fields using a keyboard.\nThe colleague must have the ability to learn new tasks, follow established processes, maintain focus, complete tasks independently, complete multiple tasks simultaneously, communicate professionally with colleagues and customers, and complete tasks in situations that have a speed or productivity requirement.\nThe colleague must be able to manage moderate to significant mental stress as a result of, but not limited to, a dynamic and heavy workload.\nPlease be advised that job descriptions typically change over time as business needs, job requirements, and employee skill levels change. As such, One Call retains the right to change or assign other duties to this position at any time.\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment regardless to race, color, religion, sex, nationality, disability status, protected veteran status, or any other status protected by law.\nGo back\nApply\nFacebook\nLinkedIn\nX\nEmail",
        "application_url": "https://onecall.avature.net/careers/SearchJobs/?folderRecordsPerPage=6&folderOffset=0&jobOffset=0",
        "": {},
        "metadata": {
            "Location": "Remote",
            "Function": "Commercial",
            "Business Unit": "Shared Services",
            "Full-time/Part-time": "Full Time",
            "Salary Range Min - Max (USD)": "86000-141800",
            "Country": "United States",
            "Date": "04-Dec-2025",
            "Job ID": "5269"
        },
        "link": "https://onecall.avature.net/careers/JobDetail/Sales-Exec-Mid-Market/5269"
    },
    {
        "title": "Sales Executive Mid-Market",
        "description_html": null,
        "description_text": "General information\nLocation\nRemote\nFunction\nCommercial\nBusiness Unit\nShared Services\nFull-time/Part-time\nFull Time\nSalary Range Min - Max (USD)\n86000-141800\nCountry\nUnited States\nDate\n04-Dec-2025\nJob ID\n5270\nDescription & Requirements\nJoin Our Team and Make a Difference!\nAre you looking for an impactful role where you finish the workday knowing you helped someone? Whether you are part of our care coordination team or play a supporting role, the work our colleagues do every day enables us to collectively reach our mission of\ngetting people the care they need when they need it.\nBy staying committed to our core values of\nThink Big, Go Fast, Deliver Awe, Win Together and Care Deeply\n,\nwe can positively impact the lives of the injured workers we serve and get them back to the things that matter most in life.\nSalary Range:\nThis compensation range considers a wide range of factors, including, but not limited to, skill set, experience and training, licensure and certifications, and other business and organizational needs. The disclosed range estimate is not adjusted for geographic differential associated with the location where the position may be filled. At One Call, it is not typical for an individual to be hired at or near the top of the range for their role, and compensation decisions are dependent on the facts and circumstances of each case.\nWhat We Provide in Return for Your Commitment to Our Mission\nWe offer a vast array of benefits to help support the whole you, including:\nRemote Work:\nWe are a remote-first company, and almost all positions receive the flexibility of working from home.\nGenerous Time Off:\nBesides 8 company holidays and 2 personal days every year, all colleagues receive a minimum of 18 days of paid time off.\nComprehensive Benefits Package:\nIncluding medical, dental, vision, and pet insurance; 401(k) matching program; and company-paid life insurance and short and long-term disability coverage.\nSupportive Services:\nJust like our colleagues get injured workers the care they need when they need it, we want to do the same for our colleagues in their time of need. We offer a Colleague Assistance Program that provides free counseling and financial services, and our One Call Foundation, a non-profit arm of our company, provides colleagues financial assistance during times of unexpected hardships.\nJOB SUMMARY:\nThe Sales Executive is responsible for identifying and developing new business opportunities to support the company’s revenue goals. This role involves pipeline development and fostering relationships with prospects and stakeholders. The Sales Executive collaborates with the sales and marketing teams to drive growth within assigned markets. Sales Executives are responsible for identifying, developing, and closing new business opportunities within mid-market commercial accounts in the Commercial Sales sectors. The ideal candidate is a skilled relationship builder and strategic thinker with a strong background in B2B sales and a passion for delivering value to clients.\nESSENTIAL DUTIES & RESPONSIBILITIES:\nStrategic Sales Execution:\nExecute the company’s sales strategy to meet assigned revenue targets.\nMonitor market trends and identify opportunities for targeted growth.\nAnalyze market trends and competitor activities to identify opportunities for expansion and differentiation.\nInstill a belief in the company's vision, mission, goals, and work to establish One Call as an industry expert.\nWork closely with the Commercial and cross-functional teams (marketing, product, operations) to support strategic initiatives and ensure seamless client onboarding & retention.\nBuild and maintain strong relationships with key stakeholders in mid-market commercial organizations. Serve as a trusted advisor and advocate for client success.\nBusiness & Pipeline Development:\nProspect and engage mid-market market clients through outbound efforts, networking, and strategic outreach to generate new business opportunities. Build and manage a prospective pipeline of sales opportunities.\nEstablish and maintain relationships with clients, brokers, and industry contacts.\nIdentify potential opportunities through research and client outreach.\nDemonstrate specialized product knowledge for One Call solutions, market, and competitive intelligence.\nPrepare and present proposals to prospects and industry stakeholders – utilizing One Call resources and tools.\nIdentify and mitigate risks associated with sales activities.\nStay informed on industry trends, competitive landscape, and client challenges to tailor solutions and position offerings effectively.\nSales Process Management:\nManage the full sales cycle from lead generation to contract negotiation and close, ensuring alignment with company goals and client needs.\nBusiness Development\nMaintain accurate records of sales activities, pipeline status, and client interactions in the CRM system. Provide regular updates and insights to leadership.\nMeet or exceed individual sales targets and contribute to the overall success of the mid-market segment.\nEDUCATIONAL AND EXPERIENCE REQUIREMENTS:\nBachelor’s degree in Business, Marketing, or related field\n3–5 years of experience in B2B sales, preferably in healthcare or workers’ compensation markets\nProven track record of success in mid-market account sales and revenue generation, preferably in healthcare and/or worker’s compensation markets\nStrong communication, negotiation, and presentation skills\nProficiency with CRM tools (e.g., Salesforce) and sales analytics\nSelf-motivated, goal-oriented, and adaptable in a fast-paced environment\nESSENTIAL KNOWLEDGE, SKILLS & ABILITIES:\nProven track record of success in a sales role within the insurance industry and/or workers' compensation.\nStrong understanding of workers' compensation insurance products and market dynamics.\nProficiency in using CRM software and other sales tools.\nStrategic Thinking: Ability to think long-term and develop comprehensive sales strategies.\nRelationship Building: Excellent ability to build and maintain relationships with clients, partners, and team members.\nNegotiation: Skilled negotiator with a proven track record in closing complex deals.\nAnalytical Skills: Strong analytical skills to assess market trends, sales performance, and financial data.\nCommunication: Outstanding verbal and written communication skills.\nAbility to work in an environment that aligns with the company's diversity, equity, inclusion and belonging standards.\nAbility to work both independently and in a team environment.\nDemonstrate our core values of Think Big, Go Fast, Deliver Awe, Win Together and Care Deeply.\nPHYSICAL/MENTAL DEMANDS & WORK ENVIRONMENT:\nThis position will be performed primarily in the colleague’s home but will also require travel to other sites and include both sedentary and active work.\nWork-from-home requirements include the colleague’s ability to set up computer equipment within their home office.\nTravel requirements include the colleague’s ability to move between work locations for client meetings and other field work assignments.\nThis role requires travel at a minimum of 50% of the time.\nThe colleague must be able to remain in a stationary position, operate a computer and other office equipment, perform repetitive motions, assess information and files stored electronically, converse with customers and exchange accurate information.\nThe colleague must be able to discern text displayed on a monitor and input data into specific fields using a keyboard.\nThe colleague must have the ability to learn new tasks, follow established processes, maintain focus, complete tasks independently, complete multiple tasks simultaneously, communicate professionally with colleagues and customers, and complete tasks in situations that have a speed or productivity requirement.\nThe colleague must be able to manage moderate to significant mental stress as a result of, but not limited to, a dynamic and heavy workload.\nPlease be advised that job descriptions typically change over time as business needs, job requirements, and employee skill levels change. As such, One Call retains the right to change or assign other duties to this position at any time.\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment regardless to race, color, religion, sex, nationality, disability status, protected veteran status, or any other status protected by law.\nGo back\nApply\nFacebook\nLinkedIn\nX\nEmail",
        "application_url": "https://onecall.avature.net/careers/SearchJobs/?folderRecordsPerPage=6&folderOffset=0&jobOffset=0",
        "": {},
        "metadata": {
            "Location": "Remote",
            "Function": "Commercial",
            "Business Unit": "Shared Services",
            "Full-time/Part-time": "Full Time",
            "Salary Range Min - Max (USD)": "86000-141800",
            "Country": "United States",
            "Date": "04-Dec-2025",
            "Job ID": "5270"
        },
        "link": "https://onecall.avature.net/careers/JobDetail/Sales-Exec-Mid-Market/5270"
    },
    {
        "title": "Inside Sales Executive",
        "description_html": null,
        "description_text": "General information\nLocation\nRemote\nFunction\nCommercial\nBusiness Unit\nShared Services\nFull-time/Part-time\nFull Time\nSalary Range Min - Max (USD)\n66100-109100\nCountry\nUnited States\nDate\n04-Dec-2025\nJob ID\n5271\nDescription & Requirements\nJoin Our Team and Make a Difference!\nAre you looking for an impactful role where you finish the workday knowing you helped someone? Whether you are part of our care coordination team or play a supporting role, the work our colleagues do every day enables us to collectively reach our mission of\ngetting people the care they need when they need it.\nBy staying committed to our core values of\nThink Big, Go Fast, Deliver Awe, Win Together and Care Deeply\n,\nwe can positively impact the lives of the injured workers we serve and get them back to the things that matter most in life.\nSalary Range:\nThis compensation range considers a wide range of factors, including, but not limited to, skill set, experience and training, licensure and certifications, and other business and organizational needs. The disclosed range estimate is not adjusted for geographic differential associated with the location where the position may be filled. At One Call, it is not typical for an individual to be hired at or near the top of the range for their role, and compensation decisions are dependent on the facts and circumstances of each case.\nWhat We Provide in Return for Your Commitment to Our Mission\nWe offer a vast array of benefits to help support the whole you, including:\nRemote Work:\nWe are a remote-first company, and almost all positions receive the flexibility of working from home.\nGenerous Time Off:\nBesides 8 company holidays and 2 personal days every year, all colleagues receive a minimum of 18 days of paid time off.\nComprehensive Benefits Package:\nIncluding medical, dental, vision, and pet insurance; 401(k) matching program; and company-paid life insurance and short and long-term disability coverage.\nSupportive Services:\nJust like our colleagues get injured workers the care they need when they need it, we want to do the same for our colleagues in their time of need. We offer a Colleague Assistance Program that provides free counseling and financial services, and our One Call Foundation, a non-profit arm of our company, provides colleagues financial assistance during times of unexpected hardships.\nJOB SUMMARY:\nThe Inside Sales Executive should be goal oriented and a skilled communicator with a passion for consultative selling, lead conversion and pipeline development. This role is responsible for driving revenue growth through outbound and inbound sales efforts, targeting small to mid-sized businesses in the healthcare and workers' compensation space.\nESSENTIAL DUTIES & RESPONSIBILITIES:\nSales Execution & Lead Management\nConduct outbound calls and follow up on inbound inquiries to generate qualified leads and close sales.\nManage a high volume of sales activities including calls, emails, and virtual meetings.\nMaintain detailed records of interactions and progress in the CRM system. Develop and implement sales strategies for mid-market and telesales segments aligned with broader commercial goals.\nPipeline Development\nIdentify and nurture opportunities within the mid-market segment using data-driven insights and market intelligence.\nCollaborate with marketing and sales leadership to optimize lead generation campaigns and conversion strategies.\nCollaboration & Reporting\nWork closely with the Director of Mid-Market & Telesales to align goals, strategies, and performance metrics.\nProvide regular updates on pipeline status, sales activity, and market feedback.\nEnsure accurate CRM usage, reporting, and forecasting.\nEDUCATIONAL AND EXPERIENCE REQUIREMENTS:\n2–4 years of experience in inside sales, preferably in healthcare, insurance, or B2B services\nProven track record of meeting or exceeding sales targets\nBachelor’s degree preferred\nESSENTIAL KNOWLEDGE, SKILLS & ABILITIES:\nProven track record of driving revenue growth within sales teams\nSelf-motivated, organized, and comfortable working in a fast-paced environment\nDeep understanding of inside sales dynamics and enterprise sales cycles\nDemonstrated ability to build and manage a high-performing sales pipeline from scratch\nExpertise in CRM systems (e.g., Salesforce, HubSpot) and data-driven sales management\nExceptional communication, negotiation, and leadership skills\nAbility to work in an environment that aligns with the company's diversity, equity, inclusion and belonging standards\nAbility to work both independently and in a team environment\nDemonstrate our core values of Think Big, Go Fast, Deliver Awe, Win Together and Care Deeply\nPHYSICAL/MENTAL DEMANDS & WORK ENVIRONMENT:\nThis position will be performed primarily in the colleague’s home but will also require travel to other sites and include both sedentary and active work.\nWork-from-home requirements include the colleague’s ability to set up computer equipment within their home office.\nTravel requirements include the colleague’s ability to move between work locations for client meetings and other field work assignments. Travel may be up to 50% of working hours\nThe colleague must be able to remain in a stationary position, operate a computer and other office equipment, perform repetitive motions, assess information and files stored electronically, converse with customers and exchange accurate information.\nThe colleague must be able to discern text displayed on a monitor and input data into specific fields using a keyboard.\nThe colleague must have the ability to learn new tasks, follow established processes, maintain focus, complete tasks independently, complete multiple tasks simultaneously, communicate professionally with colleagues and customers, and complete tasks in situations that have a speed or productivity requirement.\nThe colleague must be able to manage moderate to significant mental stress as a result of, but not limited to, a dynamic and heavy workload.\nPlease be advised that job descriptions typically change over time as business needs, job requirements, and employee skill levels change. As such, One Call retains the right to change or assign other duties to this position at any time.\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment regardless to race, color, religion, sex, nationality, disability status, protected veteran status, or any other status protected by law.\nGo back\nApply\nFacebook\nLinkedIn\nX\nEmail",
        "application_url": "https://onecall.avature.net/careers/SearchJobs/?folderRecordsPerPage=6&folderOffset=0&jobOffset=0",
        "": {},
        "metadata": {
            "Location": "Remote",
            "Function": "Commercial",
            "Business Unit": "Shared Services",
            "Full-time/Part-time": "Full Time",
            "Salary Range Min - Max (USD)": "66100-109100",
            "Country": "United States",
            "Date": "04-Dec-2025",
            "Job ID": "5271"
        },
        "link": "https://onecall.avature.net/careers/JobDetail/Inside-Sales-Exec/5271"
    },
    {
        "title": "Inside Sales Executive",
        "description_html": null,
        "description_text": "General information\nLocation\nRemote\nFunction\nCommercial\nBusiness Unit\nShared Services\nFull-time/Part-time\nFull Time\nSalary Range Min - Max (USD)\n66100-109100\nCountry\nUnited States\nDate\n04-Dec-2025\nJob ID\n5272\nDescription & Requirements\nJoin Our Team and Make a Difference!\nAre you looking for an impactful role where you finish the workday knowing you helped someone? Whether you are part of our care coordination team or play a supporting role, the work our colleagues do every day enables us to collectively reach our mission of\ngetting people the care they need when they need it.\nBy staying committed to our core values of\nThink Big, Go Fast, Deliver Awe, Win Together and Care Deeply\n,\nwe can positively impact the lives of the injured workers we serve and get them back to the things that matter most in life.\nSalary Range:\nThis compensation range considers a wide range of factors, including, but not limited to, skill set, experience and training, licensure and certifications, and other business and organizational needs. The disclosed range estimate is not adjusted for geographic differential associated with the location where the position may be filled. At One Call, it is not typical for an individual to be hired at or near the top of the range for their role, and compensation decisions are dependent on the facts and circumstances of each case.\nWhat We Provide in Return for Your Commitment to Our Mission\nWe offer a vast array of benefits to help support the whole you, including:\nRemote Work:\nWe are a remote-first company, and almost all positions receive the flexibility of working from home.\nGenerous Time Off:\nBesides 8 company holidays and 2 personal days every year, all colleagues receive a minimum of 18 days of paid time off.\nComprehensive Benefits Package:\nIncluding medical, dental, vision, and pet insurance; 401(k) matching program; and company-paid life insurance and short and long-term disability coverage.\nSupportive Services:\nJust like our colleagues get injured workers the care they need when they need it, we want to do the same for our colleagues in their time of need. We offer a Colleague Assistance Program that provides free counseling and financial services, and our One Call Foundation, a non-profit arm of our company, provides colleagues financial assistance during times of unexpected hardships.\nJOB SUMMARY:\nThe Inside Sales Executive should be goal oriented and a skilled communicator with a passion for consultative selling, lead conversion and pipeline development. This role is responsible for driving revenue growth through outbound and inbound sales efforts, targeting small to mid-sized businesses in the healthcare and workers' compensation space.\nESSENTIAL DUTIES & RESPONSIBILITIES:\nSales Execution & Lead Management\nConduct outbound calls and follow up on inbound inquiries to generate qualified leads and close sales.\nManage a high volume of sales activities including calls, emails, and virtual meetings.\nMaintain detailed records of interactions and progress in the CRM system. Develop and implement sales strategies for mid-market and telesales segments aligned with broader commercial goals.\nPipeline Development\nIdentify and nurture opportunities within the mid-market segment using data-driven insights and market intelligence.\nCollaborate with marketing and sales leadership to optimize lead generation campaigns and conversion strategies.\nCollaboration & Reporting\nWork closely with the Director of Mid-Market & Telesales to align goals, strategies, and performance metrics.\nProvide regular updates on pipeline status, sales activity, and market feedback.\nEnsure accurate CRM usage, reporting, and forecasting.\nEDUCATIONAL AND EXPERIENCE REQUIREMENTS:\n2–4 years of experience in inside sales, preferably in healthcare, insurance, or B2B services\nProven track record of meeting or exceeding sales targets\nBachelor’s degree preferred\nESSENTIAL KNOWLEDGE, SKILLS & ABILITIES:\nProven track record of driving revenue growth within sales teams\nSelf-motivated, organized, and comfortable working in a fast-paced environment\nDeep understanding of inside sales dynamics and enterprise sales cycles\nDemonstrated ability to build and manage a high-performing sales pipeline from scratch\nExpertise in CRM systems (e.g., Salesforce, HubSpot) and data-driven sales management\nExceptional communication, negotiation, and leadership skills\nAbility to work in an environment that aligns with the company's diversity, equity, inclusion and belonging standards\nAbility to work both independently and in a team environment\nDemonstrate our core values of Think Big, Go Fast, Deliver Awe, Win Together and Care Deeply\nPHYSICAL/MENTAL DEMANDS & WORK ENVIRONMENT:\nThis position will be performed primarily in the colleague’s home but will also require travel to other sites and include both sedentary and active work.\nWork-from-home requirements include the colleague’s ability to set up computer equipment within their home office.\nTravel requirements include the colleague’s ability to move between work locations for client meetings and other field work assignments. Travel may be up to 50% of working hours\nThe colleague must be able to remain in a stationary position, operate a computer and other office equipment, perform repetitive motions, assess information and files stored electronically, converse with customers and exchange accurate information.\nThe colleague must be able to discern text displayed on a monitor and input data into specific fields using a keyboard.\nThe colleague must have the ability to learn new tasks, follow established processes, maintain focus, complete tasks independently, complete multiple tasks simultaneously, communicate professionally with colleagues and customers, and complete tasks in situations that have a speed or productivity requirement.\nThe colleague must be able to manage moderate to significant mental stress as a result of, but not limited to, a dynamic and heavy workload.\nPlease be advised that job descriptions typically change over time as business needs, job requirements, and employee skill levels change. As such, One Call retains the right to change or assign other duties to this position at any time.\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment regardless to race, color, religion, sex, nationality, disability status, protected veteran status, or any other status protected by law.\nGo back\nApply\nFacebook\nLinkedIn\nX\nEmail",
        "application_url": "https://onecall.avature.net/careers/SearchJobs/?folderRecordsPerPage=6&folderOffset=6&jobOffset=6",
        "": {},
        "metadata": {
            "Location": "Remote",
            "Function": "Commercial",
            "Business Unit": "Shared Services",
            "Full-time/Part-time": "Full Time",
            "Salary Range Min - Max (USD)": "66100-109100",
            "Country": "United States",
            "Date": "04-Dec-2025",
            "Job ID": "5272"
        },
        "link": "https://onecall.avature.net/careers/JobDetail/Inside-Sales-Exec/5272"
    },
    {
        "title": "Inside Sales Executive",
        "description_html": null,
        "description_text": "General information\nLocation\nRemote\nFunction\nCommercial\nBusiness Unit\nShared Services\nFull-time/Part-time\nFull Time\nSalary Range Min - Max (USD)\n66100-109100\nCountry\nUnited States\nDate\n04-Dec-2025\nJob ID\n5273\nDescription & Requirements\nJoin Our Team and Make a Difference!\nAre you looking for an impactful role where you finish the workday knowing you helped someone? Whether you are part of our care coordination team or play a supporting role, the work our colleagues do every day enables us to collectively reach our mission of\ngetting people the care they need when they need it.\nBy staying committed to our core values of\nThink Big, Go Fast, Deliver Awe, Win Together and Care Deeply\n,\nwe can positively impact the lives of the injured workers we serve and get them back to the things that matter most in life.\nSalary Range:\nThis compensation range considers a wide range of factors, including, but not limited to, skill set, experience and training, licensure and certifications, and other business and organizational needs. The disclosed range estimate is not adjusted for geographic differential associated with the location where the position may be filled. At One Call, it is not typical for an individual to be hired at or near the top of the range for their role, and compensation decisions are dependent on the facts and circumstances of each case.\nWhat We Provide in Return for Your Commitment to Our Mission\nWe offer a vast array of benefits to help support the whole you, including:\nRemote Work:\nWe are a remote-first company, and almost all positions receive the flexibility of working from home.\nGenerous Time Off:\nBesides 8 company holidays and 2 personal days every year, all colleagues receive a minimum of 18 days of paid time off.\nComprehensive Benefits Package:\nIncluding medical, dental, vision, and pet insurance; 401(k) matching program; and company-paid life insurance and short and long-term disability coverage.\nSupportive Services:\nJust like our colleagues get injured workers the care they need when they need it, we want to do the same for our colleagues in their time of need. We offer a Colleague Assistance Program that provides free counseling and financial services, and our One Call Foundation, a non-profit arm of our company, provides colleagues financial assistance during times of unexpected hardships.\nJOB SUMMARY:\nThe Inside Sales Executive should be goal oriented and a skilled communicator with a passion for consultative selling, lead conversion and pipeline development. This role is responsible for driving revenue growth through outbound and inbound sales efforts, targeting small to mid-sized businesses in the healthcare and workers' compensation space.\nESSENTIAL DUTIES & RESPONSIBILITIES:\nSales Execution & Lead Management\nConduct outbound calls and follow up on inbound inquiries to generate qualified leads and close sales.\nManage a high volume of sales activities including calls, emails, and virtual meetings.\nMaintain detailed records of interactions and progress in the CRM system. Develop and implement sales strategies for mid-market and telesales segments aligned with broader commercial goals.\nPipeline Development\nIdentify and nurture opportunities within the mid-market segment using data-driven insights and market intelligence.\nCollaborate with marketing and sales leadership to optimize lead generation campaigns and conversion strategies.\nCollaboration & Reporting\nWork closely with the Director of Mid-Market & Telesales to align goals, strategies, and performance metrics.\nProvide regular updates on pipeline status, sales activity, and market feedback.\nEnsure accurate CRM usage, reporting, and forecasting.\nEDUCATIONAL AND EXPERIENCE REQUIREMENTS:\n2–4 years of experience in inside sales, preferably in healthcare, insurance, or B2B services\nProven track record of meeting or exceeding sales targets\nBachelor’s degree preferred\nESSENTIAL KNOWLEDGE, SKILLS & ABILITIES:\nProven track record of driving revenue growth within sales teams\nSelf-motivated, organized, and comfortable working in a fast-paced environment\nDeep understanding of inside sales dynamics and enterprise sales cycles\nDemonstrated ability to build and manage a high-performing sales pipeline from scratch\nExpertise in CRM systems (e.g., Salesforce, HubSpot) and data-driven sales management\nExceptional communication, negotiation, and leadership skills\nAbility to work in an environment that aligns with the company's diversity, equity, inclusion and belonging standards\nAbility to work both independently and in a team environment\nDemonstrate our core values of Think Big, Go Fast, Deliver Awe, Win Together and Care Deeply\nPHYSICAL/MENTAL DEMANDS & WORK ENVIRONMENT:\nThis position will be performed primarily in the colleague’s home but will also require travel to other sites and include both sedentary and active work.\nWork-from-home requirements include the colleague’s ability to set up computer equipment within their home office.\nTravel requirements include the colleague’s ability to move between work locations for client meetings and other field work assignments. Travel may be up to 50% of working hours\nThe colleague must be able to remain in a stationary position, operate a computer and other office equipment, perform repetitive motions, assess information and files stored electronically, converse with customers and exchange accurate information.\nThe colleague must be able to discern text displayed on a monitor and input data into specific fields using a keyboard.\nThe colleague must have the ability to learn new tasks, follow established processes, maintain focus, complete tasks independently, complete multiple tasks simultaneously, communicate professionally with colleagues and customers, and complete tasks in situations that have a speed or productivity requirement.\nThe colleague must be able to manage moderate to significant mental stress as a result of, but not limited to, a dynamic and heavy workload.\nPlease be advised that job descriptions typically change over time as business needs, job requirements, and employee skill levels change. As such, One Call retains the right to change or assign other duties to this position at any time.\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment regardless to race, color, religion, sex, nationality, disability status, protected veteran status, or any other status protected by law.\nGo back\nApply\nFacebook\nLinkedIn\nX\nEmail",
        "application_url": "https://onecall.avature.net/careers/SearchJobs/?folderRecordsPerPage=6&folderOffset=6&jobOffset=6",
        "": {},
        "metadata": {
            "Location": "Remote",
            "Function": "Commercial",
            "Business Unit": "Shared Services",
            "Full-time/Part-time": "Full Time",
            "Salary Range Min - Max (USD)": "66100-109100",
            "Country": "United States",
            "Date": "04-Dec-2025",
            "Job ID": "5273"
        },
        "link": "https://onecall.avature.net/careers/JobDetail/Inside-Sales-Exec/5273"
    },
    {
        "title": "Account Manager - West",
        "description_html": null,
        "description_text": "General information\nLocation\nRemote\nFunction\nCommercial\nBusiness Unit\nShared Services\nFull-time/Part-time\nFull Time\nSalary Range Min - Max (USD)\n86000-141800\nCountry\nUnited States\nDate\n04-Dec-2025\nJob ID\n5274\nDescription & Requirements\nJoin Our Team and Make a Difference!\nAre you looking for an impactful role where you finish the workday knowing you helped someone? Whether you are part of our care coordination team or play a supporting role, the work our colleagues do every day enables us to collectively reach our mission of\ngetting people the care they need when they need it.\nBy staying committed to our core values of\nThink Big, Go Fast, Deliver Awe, Win Together and Care Deeply\n,\nwe can positively impact the lives of the injured workers we serve and get them back to the things that matter most in life.\nSalary Range:\nThis compensation range considers a wide range of factors, including, but not limited to, skill set, experience and training, licensure and certifications, and other business and organizational needs. The disclosed range estimate is not adjusted for geographic differential associated with the location where the position may be filled. At One Call, it is not typical for an individual to be hired at or near the top of the range for their role, and compensation decisions are dependent on the facts and circumstances of each case.\nWhat We Provide in Return for Your Commitment to Our Mission\nWe offer a vast array of benefits to help support the whole you, including:\nRemote Work:\nWe are a remote-first company, and almost all positions receive the flexibility of working from home.\nGenerous Time Off:\nBesides 8 company holidays and 2 personal days every year, all colleagues receive a minimum of 18 days of paid time off.\nComprehensive Benefits Package:\nIncluding medical, dental, vision, and pet insurance; 401(k) matching program; and company-paid life insurance and short and long-term disability coverage.\nSupportive Services:\nJust like our colleagues get injured workers the care they need when they need it, we want to do the same for our colleagues in their time of need. We offer a Colleague Assistance Program that provides free counseling and financial services, and our One Call Foundation, a non-profit arm of our company, provides colleagues financial assistance during times of unexpected hardships.\nJOB SUMMARY:\nThe Account Manager is accountable for relationships, sells products and/or services to One Call clients to ensure satisfaction, alignment of One Call’s corporate strategy, account retention, and revenue growth. Additionally, the Account Manager supports the Strategic Account Executive in on-going service delivery, customer satisfaction, and relationship development with One Call’s Corporate and Regional Accounts.\nESSENTIAL DUTIES & RESPONSIBILITIES:\nSignificant focus should be on client retention and developing/executing account plans to ensure continued revenue growth\nDemonstrates product knowledge including solutions, markets, and competitive intelligence\nLeverages client-facing data to reinforce One Call value proposition\nLeverages internal data to identify opportunities for improving service delivery and increased revenue\nProvides accurate and timely sales forecasts\nDevelop relationships with desk-level buyers, pulling through revenue at the user level\nEnsures accurate content and certification of information in CRM software for assigned clients\nWithin the client organizations, builds network of influencers and maintains knowledge of products and services utilized\nIdentifies and mitigates at-risk business\nIf working with federal government contract clients, employee is required to receive federal government clearance for handling sensitive information. Employees are also required to receive annual security awareness training.\nEDUCATIONAL AND EXPERIENCE REQUIREMENTS:\nBachelor’s degree or the equivalent combination of education, training, or work experience.\nA minimum of 3 years of sales or equivalent experience required; 5 years or more preferred.\nESSENTIAL KNOWLEDGE, SKILLS & ABILITIES:\nGood understanding of One Call products and services\nGeneral knowledge of workers’ compensation industry\nCommunicates ideas both verbally, in written form and via presentation in a clear, concise, and professional manner appropriate to audience including executive levels.\nRequires the ability to establish and maintain effective working relationships with all levels of management (internally/externally), employees, clients and public.\nAbility to work in an environment that aligns with the company's diversity, equity, inclusion and belonging standards.\nAbility to show established track record of involvement in industry trade groups preferred.\nAbility to work both independently and in a team environment.\nExpert knowledge of Microsoft Office suite of applications, CRM software, and data visualization tools.\nDemonstrate our core values of Think Big, Go Fast, Deliver Awe, Win Together and Care Deeply.\nPHYSICAL/MENTAL DEMANDS & WORK ENVIRONMENT:\nFor roles located in office or home settings, this job is primarily sedentary and may involve repetitive motions; the employee is regularly required to sit, use hands and fingers, speak and hear.\nWork-from-home requirements include the colleague’s ability to set up computer equipment within their home office.\nTravel requirements include the colleague’s ability to move between work locations for client meetings and other field work assignments.\nTravel may be up to 50% of working hours.\nThe employee is occasionally required to stand, walk, and lift objects (up to 10lbs weight; up to 4 ft. height).\nThe colleague must be able to remain in a stationary position, operate a computer and other office equipment, perform repetitive motions, assess information and files stored electronically, converse with customers and exchange accurate information.\nThe colleague must be able to discern text displayed on a monitor and input data into specific fields using a keyboard.\nThe colleague must have the ability to learn new tasks, follow established processes, maintain focus, complete tasks independently, complete multiple tasks simultaneously, communicate professionally with colleagues and customers, and complete tasks in situations that have a speed or productivity requirement.\nReasonable accommodation will be individually assessed and possibly made to enable individuals with disabilities to perform the essential functions of the position\nThe colleague must be able to manage moderate to significant mental stress as a result of, but not limited to, a dynamic and heavy workload.\nPlease be advised that job descriptions typically change over time as business needs, job requirements, and employee skill levels change. As such, One Call retains the right to change or assign other duties to this position at any time.\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment regardless to race, color, religion, sex, nationality, disability status, protected veteran status, or any other status protected by law.\nGo back\nApply\nFacebook\nLinkedIn\nX\nEmail",
        "application_url": "https://onecall.avature.net/careers/SearchJobs/?folderRecordsPerPage=6&folderOffset=6&jobOffset=6",
        "": {},
        "metadata": {
            "Location": "Remote",
            "Function": "Commercial",
            "Business Unit": "Shared Services",
            "Full-time/Part-time": "Full Time",
            "Salary Range Min - Max (USD)": "86000-141800",
            "Country": "United States",
            "Date": "04-Dec-2025",
            "Job ID": "5274"
        },
        "link": "https://onecall.avature.net/careers/JobDetail/Account-Manager/5274"
    },
    {
        "title": "Strategic Account Executive - Midwest",
        "description_html": null,
        "description_text": "General information\nLocation\nRemote\nFunction\nCommercial\nBusiness Unit\nShared Services\nFull-time/Part-time\nFull Time\nSalary Range Min - Max (USD)\n116100-191500\nCountry\nUnited States\nDate\n04-Dec-2025\nJob ID\n5275\nDescription & Requirements\nJoin Our Team and Make a Difference!\nAre you looking for an impactful role where you finish the workday knowing you helped someone? Whether you are part of our care coordination team or play a supporting role, the work our colleagues do every day enables us to collectively reach our mission of\ngetting people the care they need when they need it.\nBy staying committed to our core values of\nThink Big, Go Fast, Deliver Awe, Win Together and Care Deeply\n,\nwe can positively impact the lives of the injured workers we serve and get them back to the things that matter most in life.\nSalary Range:\nThis compensation range considers a wide range of factors, including, but not limited to, skill set, experience and training, licensure and certifications, and other business and organizational needs. The disclosed range estimate is not adjusted for geographic differential associated with the location where the position may be filled. At One Call, it is not typical for an individual to be hired at or near the top of the range for their role, and compensation decisions are dependent on the facts and circumstances of each case.\nWhat We Provide in Return for Your Commitment to Our Mission\nWe offer a vast array of benefits to help support the whole you, including:\nRemote Work:\nWe are a remote-first company, and almost all positions receive the flexibility of working from home.\nGenerous Time Off:\nBesides 8 company holidays and 2 personal days every year, all colleagues receive a minimum of 18 days of paid time off.\nComprehensive Benefits Package:\nIncluding medical, dental, vision, and pet insurance; 401(k) matching program; and company-paid life insurance and short and long-term disability coverage.\nSupportive Services:\nJust like our colleagues get injured workers the care they need when they need it, we want to do the same for our colleagues in their time of need. We offer a Colleague Assistance Program that provides free counseling and financial services, and our One Call Foundation, a non-profit arm of our company, provides colleagues financial assistance during times of unexpected hardships.\nJOB SUMMARY:\nAdvanced professional role, serving clients by identifying and providing product-based solutions to satisfy their unique needs. Sells products and/or services and manages relationships with existing named accounts to ensure satisfaction, alignment of One Call’s Workers Compensation Strategy with One Call’s Corporate Strategy, account retention, and continued revenue growth. Assigned to large, complex, high visibility, strategic, or tactically important accounts. Determines methods and procedures towards strategic initiatives and may coordinate activities of other personnel.\nESSENTIAL DUTIES & RESPONSIBILITIES:\nMeets with current and future customers to review product portfolio and create custom solutions based on need and desired outcome.\nProvides product service or technical information by answering customer questions or requests, RFPs, or RFQs\nMay negotiate contract terms and close sales by agreeing to terms and conditions.\nPrepares custom presentations and reports for head office and keeps customer records.\nAttends sales calls or on-site visits, and reviews quotes/proposals.\nProvides product feedback to appropriate stakeholders and development teams based on client input.\nMay ensure that post-sales support or implementation services meet customer expectations.\nServes as a leader of authority with expert-level knowledge in one or more areas.\nMakes authoritative decisions and recommendations.\nPlans, organizes, & guides projects as needed.\nMay be called on to consult in other areas.\nWorks to achieve assigned sales quota.\nDemonstrates product and industry knowledge including various solutions, market strategies, and competitive intelligence.\nEnsures accurate forecasting and pipeline management as well as accurate content and certification of information in sales software for assigned clients.\nImplements account coverage methodologies that ensure 100% renewal rates of current One Call clients.\nIdentifies and reports “at risk” clients and escalates to executive management; prepares, implements and executes “at risk” plan.\nEDUCATIONAL AND EXPERIENCE REQUIREMENTS:\nA BS/BA degree from an accredited college/university; MBA or advanced degree in related field of study preferred\nA minimum of 5 years of sales solutions engineering/architecture experience required; 10 years preferred.\nESSENTIAL KNOWLEDGE, SKILLS & ABILITIES:\nGood understanding of One Call products and services\nGeneral knowledge of workers’ compensation industry\nCommunicates ideas both verbally, in written form and via presentation in a clear, concise, and professional manner appropriate to audience including executive levels.\nRequires the ability to establish and maintain effective working relationships with all levels of management (internally/externally), employees, clients and public.\nAbility to work in an environment that aligns with the company's diversity, equity, inclusion and belonging standards.\nAbility to show established track record of involvement in industry trade groups preferred.\nAbility to work both independently and in a team environment.\nExpert knowledge of Microsoft Office suite of applications, CRM software, and data visualization tools.\nDemonstrate our core values of Think Big, Go Fast, Deliver Awe, Win Together and Care Deeply.\nAbility to work in an environment that aligns with the company's diversity, equity, inclusion and belonging standards.\nAbility to work both independently and in a team environment.\nDemonstrate our core values of Think Big, Go Fast, Deliver Awe, Win Together and Care Deeply.\nPHYSICAL/MENTAL DEMANDS & WORK ENVIRONMENT:\nThis position will be performed primarily in the colleague’s home but will also require travel to other sites and include both sedentary and active work.\nWork-from-home requirements include the colleague’s ability to set up computer equipment within their home office.\nTravel requirements include the colleague’s ability to move between work locations for client meetings and other field work assignments.\nDuring duties located in the field; this job is primarily active; the employee is regularly mobile and must be able to utilize transportation (such as driving and managing air travel), use hands and fingers, speak and hear.\nThe employee may be required to travel up to 50% of their working hours.\nThe colleague must be able to remain in a stationary position, operate a computer and other office equipment, perform repetitive motions, assess information and files stored electronically, converse with customers and exchange accurate information.\nThe colleague must be able to discern text displayed on a monitor and input data into specific fields using a keyboard.\nThe colleague must have the ability to learn new tasks, follow established processes, maintain focus, complete tasks independently, complete multiple tasks simultaneously, communicate professionally with colleagues and customers, and complete tasks in situations that have a speed or productivity requirement.\nThe colleague must be able to manage moderate to significant mental stress as a result of, but not limited to, a dynamic and heavy workload.\nPlease be advised that job descriptions typically change over time as business needs, job requirements, and employee skill levels change. As such, One Call retains the right to change or assign other duties to this position at any time.\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment regardless to race, color, religion, sex, nationality, disability status, protected veteran status, or any other status protected by law.\nGo back\nApply\nFacebook\nLinkedIn\nX\nEmail",
        "application_url": "https://onecall.avature.net/careers/SearchJobs/?folderRecordsPerPage=6&folderOffset=6&jobOffset=6",
        "": {},
        "metadata": {
            "Location": "Remote",
            "Function": "Commercial",
            "Business Unit": "Shared Services",
            "Full-time/Part-time": "Full Time",
            "Salary Range Min - Max (USD)": "116100-191500",
            "Country": "United States",
            "Date": "04-Dec-2025",
            "Job ID": "5275"
        },
        "link": "https://onecall.avature.net/careers/JobDetail/Strategic-Acct-Executive/5275"
    },
    {
        "title": "Regional Director - Midwest",
        "description_html": null,
        "description_text": "General information\nLocation\nRemote\nFunction\nCommercial\nBusiness Unit\nShared Services\nFull-time/Part-time\nFull Time\nSalary Range Min - Max (USD)\n116100-191500\nCountry\nUnited States\nDate\n04-Dec-2025\nJob ID\n5277\nDescription & Requirements\nJoin Our Team and Make a Difference!\nAre you looking for an impactful role where you finish the workday knowing you helped someone? Whether you are part of our care coordination team or play a supporting role, the work our colleagues do every day enables us to collectively reach our mission of\ngetting people the care they need when they need it.\nBy staying committed to our core values of\nThink Big, Go Fast, Deliver Awe, Win Together and Care Deeply\n,\nwe can positively impact the lives of the injured workers we serve and get them back to the things that matter most in life.\nSalary Range:\nThis compensation range considers a wide range of factors, including, but not limited to, skill set, experience and training, licensure and certifications, and other business and organizational needs. The disclosed range estimate is not adjusted for geographic differential associated with the location where the position may be filled. At One Call, it is not typical for an individual to be hired at or near the top of the range for their role, and compensation decisions are dependent on the facts and circumstances of each case.\nWhat We Provide in Return for Your Commitment to Our Mission\nWe offer a vast array of benefits to help support the whole you, including:\nRemote Work:\nWe are a remote-first company, and almost all positions receive the flexibility of working from home.\nGenerous Time Off:\nBesides 8 company holidays and 2 personal days every year, all colleagues receive a minimum of 18 days of paid time off.\nComprehensive Benefits Package:\nIncluding medical, dental, vision, and pet insurance; 401(k) matching program; and company-paid life insurance and short and long-term disability coverage.\nSupportive Services:\nJust like our colleagues get injured workers the care they need when they need it, we want to do the same for our colleagues in their time of need. We offer a Colleague Assistance Program that provides free counseling and financial services, and our One Call Foundation, a non-profit arm of our company, provides colleagues financial assistance during times of unexpected hardships.\nJOB SUMMARY:\nThe Regional Director is a key leadership role responsible for managing and supporting Account Managers within the Regional Accounts organization. Reporting to the VP of Regional Accounts, this role ensures the successful execution of client engagement strategies, post-implementation success, and revenue growth initiatives across regional key accounts. The Regional Director translates strategic direction into operational excellence, fosters a high-performance culture, and builds strong relationships with internal and external stakeholders to drive client satisfaction and retention.\nESSENTIAL DUTIES & RESPONSIBILITIES:\nTeam Leadership & Development\nLead, coach, and develop Account Managers to ensure high performance and professional growth.\nFoster a culture of accountability, collaboration, and continuous improvement.\nSupport the VP in cascading strategic goals and initiatives to the team.\nClient Engagement & Retention\nServe as a key point of contact for regional clients, ensuring consistent and high-quality service delivery.\nMonitor client satisfaction and post-implementation success to identify opportunities for improvement and growth.\nCollaborate with Strategic Account Executives to support client-specific strategies and relationship management.\nOperational Execution\nOversee day-to-day operations of the regional accounts team, ensuring alignment with corporate objectives.\nIdentify and act on revenue leakage, panel elevation, and product extension opportunities.\nEnsure timely and accurate reporting of client performance metrics and team KPIs.\nStrategic Support\nAssist in the execution of strategic plans developed by the VP of Regional Accounts.\nTranslate executive vision into tactical plans and ensure successful implementation across the region.\nContribute to the development of innovative initiatives that enhance client experience and internal efficiency.\nCross-Functional Collaboration\nPartner with internal departments (e.g., Sales, Operations, Product) to ensure seamless client service and issue resolution.\nMaintain strong relationships with external partners and clients to support business development and retention efforts.\nEDUCATIONAL AND EXPERIENCE REQUIREMENTS:\nBachelor’s degree in Business, Marketing, or related field; advanced degree preferred.\n5+ years of experience in account management, client services, or sales leadership, preferably in the Workers’ Compensation or healthcare services industry.\nProven experience managing teams and driving client growth initiatives.\nESSENTIAL KNOWLEDGE, SKILLS & ABILITIES:\nProven track record in leading teams and driving meaningful client growth. Success in facilitating progressive organizational change and development within a growing organization.\nExcellent communication skills both verbal and written for interpersonal communication and collaborative management, across all sales and company departments.\nStrong knowledge of the Workers Compensations field and experience in organizational effectiveness and implementing best practices.\nDemonstrated leadership and vision in managing staff groups and major projects or initiatives.\nExhibit a high degree of initiative and analytical skills to handle and solve complex problems and thrives in a high production environment.\nViewed as an expert resource by peers and coworkers, maintains a good working relationship with both internal and client management, and has thorough internal working knowledge of the enterprise.\nDisplay strong leadership qualities, decision making abilities, and strong business judgment.\nPossess strong personnel management skills to mentor and coach diverse teams.\nExceptional written, oral, interpersonal, and presentation skills.\nA demonstrated commitment to high professional ethical standards and a diverse workplace.\nExcel at operating in a fast pace, community environment.\nChallenges and debates issues of importance to the organization.\nExcellent computer skills and proficient in Excel, Word, Outlook, and Access.\nAbility to work in an environment that aligns with the company's diversity, equity, inclusion and belonging standards.\nAbility to work both independently and in a team environment.\nDemonstrate our core values of Think Big, Go Fast, Deliver Awe, Win Together and Care Deeply.\nPHYSICAL/MENTAL DEMANDS & WORK ENVIRONMENT:\nThis position will be performed primarily in the colleague’s home but will also require considerable travel to other sites and include both sedentary and active work.\nWork-from-home requirements include the colleague’s ability to set up computer equipment within their home office.\nTravel requirements include the colleague’s ability to move between work locations for client meetings and other field work assignments.\nThis role requires travel at a minimum of 50% of the time.\nThe colleague must be able to remain in a stationary position, operate a computer and other office equipment, perform repetitive motions, assess information and files stored electronically, converse with customers and exchange accurate information.\nThe colleague must be able to discern text displayed on a monitor and input data into specific fields using a keyboard.\nThe colleague must have the ability to learn new tasks, follow established processes, maintain focus, complete tasks independently, complete multiple tasks simultaneously, communicate professionally with colleagues and customers, and complete tasks in situations that have a speed or productivity requirement.\nThe colleague must be able to manage moderate to significant mental stress as a result of, but not limited to, a dynamic and heavy workload.\nPlease be advised that job descriptions typically change over time as business needs, job requirements, and employee skill levels change. As such, One Call retains the right to change or assign other duties to this position at any time.\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment regardless to race, color, religion, sex, nationality, disability status, protected veteran status, or any other status protected by law.\nGo back\nApply\nFacebook\nLinkedIn\nX\nEmail",
        "application_url": "https://onecall.avature.net/careers/SearchJobs/?folderRecordsPerPage=6&folderOffset=6&jobOffset=6",
        "": {},
        "metadata": {
            "Location": "Remote",
            "Function": "Commercial",
            "Business Unit": "Shared Services",
            "Full-time/Part-time": "Full Time",
            "Salary Range Min - Max (USD)": "116100-191500",
            "Country": "United States",
            "Date": "04-Dec-2025",
            "Job ID": "5277"
        },
        "link": "https://onecall.avature.net/careers/JobDetail/Regional-Dir/5277"
    },
    {
        "title": "Regional Director - Northeast",
        "description_html": null,
        "description_text": "General information\nLocation\nRemote\nFunction\nCommercial\nBusiness Unit\nShared Services\nFull-time/Part-time\nFull Time\nSalary Range Min - Max (USD)\n116100-191500\nCountry\nUnited States\nDate\n04-Dec-2025\nJob ID\n5279\nDescription & Requirements\nJoin Our Team and Make a Difference!\nAre you looking for an impactful role where you finish the workday knowing you helped someone? Whether you are part of our care coordination team or play a supporting role, the work our colleagues do every day enables us to collectively reach our mission of\ngetting people the care they need when they need it.\nBy staying committed to our core values of\nThink Big, Go Fast, Deliver Awe, Win Together and Care Deeply\n,\nwe can positively impact the lives of the injured workers we serve and get them back to the things that matter most in life.\nSalary Range:\nThis compensation range considers a wide range of factors, including, but not limited to, skill set, experience and training, licensure and certifications, and other business and organizational needs. The disclosed range estimate is not adjusted for geographic differential associated with the location where the position may be filled. At One Call, it is not typical for an individual to be hired at or near the top of the range for their role, and compensation decisions are dependent on the facts and circumstances of each case.\nWhat We Provide in Return for Your Commitment to Our Mission\nWe offer a vast array of benefits to help support the whole you, including:\nRemote Work:\nWe are a remote-first company, and almost all positions receive the flexibility of working from home.\nGenerous Time Off:\nBesides 8 company holidays and 2 personal days every year, all colleagues receive a minimum of 18 days of paid time off.\nComprehensive Benefits Package:\nIncluding medical, dental, vision, and pet insurance; 401(k) matching program; and company-paid life insurance and short and long-term disability coverage.\nSupportive Services:\nJust like our colleagues get injured workers the care they need when they need it, we want to do the same for our colleagues in their time of need. We offer a Colleague Assistance Program that provides free counseling and financial services, and our One Call Foundation, a non-profit arm of our company, provides colleagues financial assistance during times of unexpected hardships.\nJOB SUMMARY:\nThe Regional Director is a key leadership role responsible for managing and supporting Account Managers within the Regional Accounts organization. Reporting to the VP of Regional Accounts, this role ensures the successful execution of client engagement strategies, post-implementation success, and revenue growth initiatives across regional key accounts. The Regional Director translates strategic direction into operational excellence, fosters a high-performance culture, and builds strong relationships with internal and external stakeholders to drive client satisfaction and retention.\nESSENTIAL DUTIES & RESPONSIBILITIES:\nTeam Leadership & Development\nLead, coach, and develop Account Managers to ensure high performance and professional growth.\nFoster a culture of accountability, collaboration, and continuous improvement.\nSupport the VP in cascading strategic goals and initiatives to the team.\nClient Engagement & Retention\nServe as a key point of contact for regional clients, ensuring consistent and high-quality service delivery.\nMonitor client satisfaction and post-implementation success to identify opportunities for improvement and growth.\nCollaborate with Strategic Account Executives to support client-specific strategies and relationship management.\nOperational Execution\nOversee day-to-day operations of the regional accounts team, ensuring alignment with corporate objectives.\nIdentify and act on revenue leakage, panel elevation, and product extension opportunities.\nEnsure timely and accurate reporting of client performance metrics and team KPIs.\nStrategic Support\nAssist in the execution of strategic plans developed by the VP of Regional Accounts.\nTranslate executive vision into tactical plans and ensure successful implementation across the region.\nContribute to the development of innovative initiatives that enhance client experience and internal efficiency.\nCross-Functional Collaboration\nPartner with internal departments (e.g., Sales, Operations, Product) to ensure seamless client service and issue resolution.\nMaintain strong relationships with external partners and clients to support business development and retention efforts.\nEDUCATIONAL AND EXPERIENCE REQUIREMENTS:\nBachelor’s degree in Business, Marketing, or related field; advanced degree preferred.\n5+ years of experience in account management, client services, or sales leadership, preferably in the Workers’ Compensation or healthcare services industry.\nProven experience managing teams and driving client growth initiatives.\nESSENTIAL KNOWLEDGE, SKILLS & ABILITIES:\nProven track record in leading teams and driving meaningful client growth. Success in facilitating progressive organizational change and development within a growing organization.\nExcellent communication skills both verbal and written for interpersonal communication and collaborative management, across all sales and company departments.\nStrong knowledge of the Workers Compensations field and experience in organizational effectiveness and implementing best practices.\nDemonstrated leadership and vision in managing staff groups and major projects or initiatives.\nExhibit a high degree of initiative and analytical skills to handle and solve complex problems and thrives in a high production environment.\nViewed as an expert resource by peers and coworkers, maintains a good working relationship with both internal and client management, and has thorough internal working knowledge of the enterprise.\nDisplay strong leadership qualities, decision making abilities, and strong business judgment.\nPossess strong personnel management skills to mentor and coach diverse teams.\nExceptional written, oral, interpersonal, and presentation skills.\nA demonstrated commitment to high professional ethical standards and a diverse workplace.\nExcel at operating in a fast pace, community environment.\nChallenges and debates issues of importance to the organization.\nExcellent computer skills and proficient in Excel, Word, Outlook, and Access.\nAbility to work in an environment that aligns with the company's diversity, equity, inclusion and belonging standards.\nAbility to work both independently and in a team environment.\nDemonstrate our core values of Think Big, Go Fast, Deliver Awe, Win Together and Care Deeply.\nPHYSICAL/MENTAL DEMANDS & WORK ENVIRONMENT:\nThis position will be performed primarily in the colleague’s home but will also require considerable travel to other sites and include both sedentary and active work.\nWork-from-home requirements include the colleague’s ability to set up computer equipment within their home office.\nTravel requirements include the colleague’s ability to move between work locations for client meetings and other field work assignments.\nThis role requires travel at a minimum of 50% of the time.\nThe colleague must be able to remain in a stationary position, operate a computer and other office equipment, perform repetitive motions, assess information and files stored electronically, converse with customers and exchange accurate information.\nThe colleague must be able to discern text displayed on a monitor and input data into specific fields using a keyboard.\nThe colleague must have the ability to learn new tasks, follow established processes, maintain focus, complete tasks independently, complete multiple tasks simultaneously, communicate professionally with colleagues and customers, and complete tasks in situations that have a speed or productivity requirement.\nThe colleague must be able to manage moderate to significant mental stress as a result of, but not limited to, a dynamic and heavy workload.\nPlease be advised that job descriptions typically change over time as business needs, job requirements, and employee skill levels change. As such, One Call retains the right to change or assign other duties to this position at any time.\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment regardless to race, color, religion, sex, nationality, disability status, protected veteran status, or any other status protected by law.\nGo back\nApply\nFacebook\nLinkedIn\nX\nEmail",
        "application_url": "https://onecall.avature.net/careers/SearchJobs/?folderRecordsPerPage=6&folderOffset=6&jobOffset=6",
        "": {},
        "metadata": {
            "Location": "Remote",
            "Function": "Commercial",
            "Business Unit": "Shared Services",
            "Full-time/Part-time": "Full Time",
            "Salary Range Min - Max (USD)": "116100-191500",
            "Country": "United States",
            "Date": "04-Dec-2025",
            "Job ID": "5279"
        },
        "link": "https://onecall.avature.net/careers/JobDetail/Regional-Dir/5279"
    },
    {
        "title": "Customer Experience Specialist, Senior",
        "description_html": null,
        "description_text": "General information\nLocation\nRemote\nFunction\nOps\nBusiness Unit\nShared Services\nFull-time/Part-time\nFull Time\nSalary Range Min - Max (USD)\n55700-83500\nCountry\nUnited States\nDate\n22-Dec-2025\nJob ID\n5299\nDescription & Requirements\nJoin Our Team and Make a Difference!\nAre you looking for an impactful role where you finish the workday knowing you helped someone? Whether you are part of our care coordination team or play a supporting role, the work our colleagues do every day enables us to collectively reach our mission of\ngetting people the care they need when they need it.\nBy staying committed to our core values of\nThink Big, Go Fast, Deliver Awe, Win Together and Care Deeply\n,\nwe can positively impact the lives of the injured workers we serve and get them back to the things that matter most in life.\nSalary Range:\nThis compensation range considers a wide range of factors, including, but not limited to, skill set, experience and training, licensure and certifications, and other business and organizational needs. The disclosed range estimate is not adjusted for geographic differential associated with the location where the position may be filled. At One Call, it is not typical for an individual to be hired at or near the top of the range for their role, and compensation decisions are dependent on the facts and circumstances of each case.\nWhat We Provide in Return for Your Commitment to Our Mission\nWe offer a vast array of benefits to help support the whole you, including:\nRemote Work:\nWe are a remote-first company, and almost all positions receive the flexibility of working from home.\nGenerous Time Off:\nBesides 8 company holidays and 2 personal days every year, all colleagues receive a minimum of 18 days of paid time off.\nComprehensive Benefits Package:\nIncluding medical, dental, vision, and pet insurance; 401(k) matching program; and company-paid life insurance and short and long-term disability coverage.\nSupportive Services:\nJust like our colleagues get injured workers the care they need when they need it, we want to do the same for our colleagues in their time of need. We offer a Colleague Assistance Program that provides free counseling and financial services, and our One Call Foundation, a non-profit arm of our company, provides colleagues financial assistance during times of unexpected hardships.\nJOB SUMMARY:\nThe Customer Experience Specialist is responsible for thoroughly vetting client requests to ensure they align with operational needs. This role involves determining customer-specific processing parameters setting up One Call products and services and ensuring all client requirements are met. The specialist determines customer specific processing parameters and completes One Call set up for clients.\nESSENTIAL DUTIES & RESPONSIBILITIES:\nProject Management: 40%\n·\nCompletes product workflow documents summarizing all processing requirements and determines key challenges in converting customer to One Call.\n·\nMay develop new procedures with client sales and operations to ensure the product is used appropriately\n.\n·\nDevelops understanding of One Call products and services through information gathering sessions to determine how One Call products and processes must be established to meet client needs.\n·\nCoordinates and conducts readiness review. This includes directing the customer in the preparation and execution of implementation.\n·\nCoordinates and directs the completion of implementation maintenance potentially including error resolution system or data changes and balancing adjustments.\n·\nExamines client’s processes forms and reports determines operational needs and documents what product will do and all related processes forms reports etc. post-implementation.\n·\nThrough analysis product mapping and interviews gathers forms and data files from customer sales and operations and assesses requirements for utilization and discusses any customization requirements with the appropriate team.\n·\nReview implementation results and coordinate completion of implementation maintenance including error resolution and system or data changes.\nCollaboration: 60%\n·\nThroughout the project provides expertise to answer questions and guide the client or sales in the use of the products\n·\nActs as a resource during implementation and answers questions troubleshoots problems as they occur supports implementation of new procedures and provides support during implementation. Reviews the implementation results.\nEDUCATIONAL AND EXPERIENCE REQUIREMENTS:\n·\nBachelor's degree in Business or related major from an accredited college/university or an equivalent combination of education and experience\n·\nPreferred two to three years of healthcare experience in ancillary services.\nESSENTIAL KNOWLEDGE SKILLS & ABILITIES:\n·\nAbility to work in an environment that aligns with the company's diversity equity inclusion and belonging standards.\n·\nAbility to work both independently and in a team environment.\n·\nDemonstrate our core values of Think Big Go Fast Deliver Awe and Win Together.\n·\nCommunicates ideas both verbally and in written form in a clear concise and professional manner\n·\nRequires advanced working knowledge of One Call products as well as the industries in which One Call competes for business\n·\nAbility to understand apply and explain concepts\n·\nAbility to handle project commensurate with job expectations\n·\nAbility to analyze and solve problems using learned techniques and tools\n·\nRequires human relations negotiation and documentation skills\n·\nRequires high attention to detail\n·\nPositions involving data mapping require strong analytical and technical skills\n·\nAbility to translate client requirements to technical specifications and communicate to technical staff\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment regardless to race, color, religion, sex, nationality, disability status, protected veteran status, or any other status protected by law.\nGo back\nApply\nFacebook\nLinkedIn\nX\nEmail",
        "application_url": "https://onecall.avature.net/careers/SearchJobs/?folderRecordsPerPage=6&folderOffset=12&jobOffset=12",
        "": {},
        "metadata": {
            "Location": "Remote",
            "Function": "Ops",
            "Business Unit": "Shared Services",
            "Full-time/Part-time": "Full Time",
            "Salary Range Min - Max (USD)": "55700-83500",
            "Country": "United States",
            "Date": "22-Dec-2025",
            "Job ID": "5299"
        },
        "link": "https://onecall.avature.net/careers/JobDetail/Customer-Exp-Spclst-Sr/5299"
    },
    {
        "title": "Retro Billing Associate I",
        "description_html": null,
        "description_text": "General information\nLocation\nRemote\nFunction\nRCM\nBusiness Unit\nShared Services\nFull-time/Part-time\nFull Time\nSalary Range Min - Max (USD)\n17.5-25.35\nCountry\nUnited States\nDate\n23-Dec-2025\nJob ID\n5300\nDescription & Requirements\nJoin Our Team and Make a Difference!\nAre you looking for an impactful role where you finish the workday knowing you helped someone? Whether you are part of our care coordination team or play a supporting role, the work our colleagues do every day enables us to collectively reach our mission of\ngetting people the care they need when they need it.\nBy staying committed to our core values of\nThink Big, Go Fast, Deliver Awe, Win Together and Care Deeply\n,\nwe can positively impact the lives of the injured workers we serve and get them back to the things that matter most in life.\nSalary Range:\nThis compensation range considers a wide range of factors, including, but not limited to, skill set, experience and training, licensure and certifications, and other business and organizational needs. The disclosed range estimate is not adjusted for geographic differential associated with the location where the position may be filled. At One Call, it is not typical for an individual to be hired at or near the top of the range for their role, and compensation decisions are dependent on the facts and circumstances of each case.\nWhat We Provide in Return for Your Commitment to Our Mission\nWe offer a vast array of benefits to help support the whole you, including:\nRemote Work:\nWe are a remote-first company, and almost all positions receive the flexibility of working from home.\nGenerous Time Off:\nBesides 8 company holidays and 2 personal days every year, all colleagues receive a minimum of 18 days of paid time off.\nComprehensive Benefits Package:\nIncluding medical, dental, vision, and pet insurance; 401(k) matching program; and company-paid life insurance and short and long-term disability coverage.\nSupportive Services:\nJust like our colleagues get injured workers the care they need when they need it, we want to do the same for our colleagues in their time of need. We offer a Colleague Assistance Program that provides free counseling and financial services, and our One Call Foundation, a non-profit arm of our company, provides colleagues financial assistance during times of unexpected hardships.\nJOB SUMMARY:\nThe Retro Billing Associate reviews bills submitted by payors and channel partners via One Call’s retrospective program. Associates follow state and federal guidelines, fee schedules, and customer-specific rules to obtain enhanced savings for our clients. Associates interact with Providers and Claim Professionals as necessary to deliver accurate and efficient bill processing. Communicates timely responses to inquiries from Internal and External customers.\nESSENTIAL DUTIES & RESPONSIBILITIES:\nLearns or remains current on billing protocols and regulations, federal and state regulations, and internal procedures that affect processing.\nProvides subject matter expertise on billing and coding guidelines and regulations as required by the department.\nUses internal and external billing protocols and regulations for repricing bills at a cost savings to the customer.\nIdentifies trending opportunities related to policies and procedures to ensure efficiency and accuracy in bill processing.\nReviews, researches, and initiates the resolution of billing errors.\nReviews, researches, and resolves customer-related inquiries.\nDevelops/maintains process documentation for each assigned task.\nCommunicates with appropriate internal departments to solve issues and discrepancies.\nPerforms other related duties as assigned.\nEDUCATIONAL AND EXPERIENCE REQUIREMENTS:\nHigh school diploma/GED required.\nESSENTIAL KNOWLEDGE, SKILLS & ABILITIES:\nKnowledge of Billing rules and regulations and federal and state regulations.\nExcellent customer service skills that build high levels of customer satisfaction.\nEffective verbal and written communication skills.\nComputer navigation and operation skills.\nDetail-oriented with good organizational skills.\nAbility to manage multiple tasks.\nAbility to work both independently and in a team environment.\nAbility to maintain confidentiality.\nProficient with Microsoft Office.\nAbility to work in an environment that aligns with the company's diversity, equity, inclusion and belonging standards.\nAbility to work both independently and in a team environment.\nDemonstrate our core values of Think Big, Go Fast, Deliver Awe, and Win Together.\nPHYSICAL/MENTAL DEMANDS & WORK ENVIRONMENT:\nThis position will be performed in the colleague’s home. Work-from-home requirements include the colleague’s ability to set up computer equipment within their home office.\nThis job is primarily sedentary and may involve repetitive motions; the colleague must be able to remain in a stationary position for extended periods of time, operate a computer and other office equipment, assess information and files stored electronically, and converse/exchange accurate information with others, simultaneously.\nThe colleague must be able to discern text displayed on a monitor, input data into specific fields using a keyboard, and adjust focus to distances of up to three feet.\nThe colleague must have the ability to learn new tasks, follow established processes, maintain focus, complete tasks independently, complete multiple tasks simultaneously, communicate professionally with colleagues and customers, and complete tasks in situations that have a speed or productivity requirement.\nThe colleague must be able to manage moderate to significant mental stress as a result of, but not limited to, a dynamic and heavy workload.\nPlease be advised that job descriptions typically change over time as business needs, job requirements, and employee skill levels change. As such, One Call retains the right to change or assign other duties to this position at any time.\nRetro Billing Associate I\nEntry level role. Basic skills with moderate level of proficiency. Resolves routine questions and problems; refers more complex issues to higher levels. Consults with senior peers and team leads on non-complex issues to learn through experience. Works under close supervision without latitude for independent judgment. Follows standard procedures and written instructions to accomplish assigned tasks. Requires a High School diploma and typically less than 1 year of experience in an office setting and/or billing experience.\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment regardless to race, color, religion, sex, nationality, disability status, protected veteran status, or any other status protected by law.\nGo back\nApply\nFacebook\nLinkedIn\nX\nEmail",
        "application_url": "https://onecall.avature.net/careers/SearchJobs/?folderRecordsPerPage=6&folderOffset=12&jobOffset=12",
        "": {},
        "metadata": {
            "Location": "Remote",
            "Function": "RCM",
            "Business Unit": "Shared Services",
            "Full-time/Part-time": "Full Time",
            "Salary Range Min - Max (USD)": "17.5-25.35",
            "Country": "United States",
            "Date": "23-Dec-2025",
            "Job ID": "5300"
        },
        "link": "https://onecall.avature.net/careers/JobDetail/Retro-Billing-Assoc-I/5300"
    },
    {
        "title": "Medical Service Coordinator I",
        "description_html": null,
        "description_text": "General information\nLocation\nRemote\nFunction\nOps-CSR\nBusiness Unit\nHome Health Services\nFull-time/Part-time\nFull Time\nSalary Range Min - Max (USD)\n17.5-25.35\nCountry\nUnited States\nDate\n09-Jan-2026\nJob ID\n5307\nDescription & Requirements\nJoin Our Team and Make a Difference!\nAre you looking for an impactful role where you finish the workday knowing you helped someone? Whether you are part of our care coordination team or play a supporting role, the work our colleagues do every day enables us to collectively reach our mission of\ngetting people the care they need when they need it.\nBy staying committed to our core values of\nThink Big, Go Fast, Deliver Awe, Win Together and Care Deeply\n,\nwe can positively impact the lives of the injured workers we serve and get them back to the things that matter most in life.\nSalary Range:\nThis compensation range considers a wide range of factors, including, but not limited to, skill set, experience and training, licensure and certifications, and other business and organizational needs. The disclosed range estimate is not adjusted for geographic differential associated with the location where the position may be filled. At One Call, it is not typical for an individual to be hired at or near the top of the range for their role, and compensation decisions are dependent on the facts and circumstances of each case.\nWhat We Provide in Return for Your Commitment to Our Mission\nWe offer a vast array of benefits to help support the whole you, including:\nRemote Work:\nWe are a remote-first company, and almost all positions receive the flexibility of working from home.\nGenerous Time Off:\nBesides 8 company holidays and 2 personal days every year, all colleagues receive a minimum of 18 days of paid time off.\nComprehensive Benefits Package:\nIncluding medical, dental, vision, and pet insurance; 401(k) matching program; and company-paid life insurance and short and long-term disability coverage.\nSupportive Services:\nJust like our colleagues get injured workers the care they need when they need it, we want to do the same for our colleagues in their time of need. We offer a Colleague Assistance Program that provides free counseling and financial services, and our One Call Foundation, a non-profit arm of our company, provides colleagues financial assistance during times of unexpected hardships.\nJOB SUMMARY:\nThe Medical Service Coordinator serves as the primary contact for coordinating medical services and patient care and will address and resolve simple to complex inquiries with clients, patients, and providers. The Medical Service Coordinator may serve as a mentor/coach to less experienced colleagues to assist in elevating their skills. This position may be asked to perform other administrative duties such as running and interpreting reports, billing, and any other administrative duties.\nESSENTIAL DUTIES & RESPONSIBILITIES:\nCustomer Care: 70%\nWorks independently to address routine and complex client inquiries that deviate from normal issues for one or more service lines.\nAdept at effectively resolving client escalations with latitude for independent judgment.\nPlay a lead role in resolving low-moderate level escalations for best client outcomes.\nUses root cause analysis methods to identify and resolve the client’s underlying needs.\nConsistently demonstrates all seven qualities of exceptional care in serving clients (friendliness, empathy, empowerment, accountability, knowledge, resilience fairness, and providing “plus 1” service).\nCollaboration: 10%\nProvide prompt, accurate, and clear information to clients.\nIdentify, communicate, and implement best practices and solutions to improve the client experience based on market and industry trends.\nMentor client care colleagues on approaches to effectively handle client interactions.\nAdministration: 20%\nPerform extensive research, analyze, and provide resolutions to low-moderate inquiries within a reasonable amount of time.\nOrganize time and workload to ensure follow-up on items is done timely and appropriately.\nProvide details for any system/client notes that reduce the need for clarification or follow-up.\nAbility to run reports, interpret data, and provide action items based on the same.\nMeet or exceed KPIs established for your role and area.\nNavigate multiple software systems as appropriate to document and/or obtain information for inquiries.\nDemonstrates understanding of HIPPA and other regulatory requirements and applies them to daily work interactions.\nEDUCATIONAL AND EXPERIENCE REQUIREMENTS:\n2 years of post-high school education or 3+ years of experience is required for this role.\nAn associate or bachelor’s degree is preferable, or the equivalent combination of education, training, and work experience.\nESSENTIAL KNOWLEDGE, SKILLS & ABILITIES:\nKnowledge of the company’s products, services, and business operations to enable resolution of inquiries.\nProficient customer service skills that build the highest levels of client satisfaction.\nProficient verbal and written communication skills.\nProficient level of computer navigation and operation skills.\nDemonstrates highly proficient people skills and empathy when taking care of clients.\nAbility to work both independently and in a team environment.\nAbility to work in an environment that aligns with the company's diversity, equity, inclusion, and belonging standards.\nAbility to work both independently and in a team\nDemonstrate our core values of Think Big, Go Fast, Deliver Awe, and Win Together.\nPHYSICAL/MENTAL DEMANDS & WORK ENVIRONMENT:\nThis position will be performed in the colleague’s home. Work-from-home requirements include the colleague’s ability to set up computer equipment within their home office.\nThis job is primarily sedentary and may involve repetitive motions; the colleague must be able to remain stationary for extended periods, operate a computer and other office equipment, assess information and files stored electronically, and converse/exchange accurate information with others, simultaneously. The colleague must be able to discern text displayed on a monitor, input data into specific fields using a keyboard, and adjust focus to distances of up to three feet.\nThe colleague must be able to learn new tasks, follow established processes, maintain focus, complete tasks independently, complete multiple tasks simultaneously, communicate professionally with colleagues and customers, and complete tasks in situations that require speed or productivity.\nThe colleague must be able to manage moderate to significant mental stress because of, but not limited to, a dynamic and heavy workload.\nPlease be advised that job descriptions typically change over time as business needs, job requirements, and employee skill levels change. As such, One Call retains the right to change or assign other duties to this position at any time.\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment regardless to race, color, religion, sex, nationality, disability status, protected veteran status, or any other status protected by law.\nGo back\nApply\nFacebook\nLinkedIn\nX\nEmail",
        "application_url": "https://onecall.avature.net/careers/SearchJobs/?folderRecordsPerPage=6&folderOffset=12&jobOffset=12",
        "": {},
        "metadata": {
            "Location": "Remote",
            "Function": "Ops-CSR",
            "Business Unit": "Home Health Services",
            "Full-time/Part-time": "Full Time",
            "Salary Range Min - Max (USD)": "17.5-25.35",
            "Country": "United States",
            "Date": "09-Jan-2026",
            "Job ID": "5307"
        },
        "link": "https://onecall.avature.net/careers/JobDetail/Medical-Svcs-Coord-I/5307"
    },
    {
        "title": "Negotiation Specialist I",
        "description_html": null,
        "description_text": "General information\nLocation\nRemote\nFunction\nProvider\nBusiness Unit\nShared Services\nFull-time/Part-time\nFull Time\nSalary Range Min - Max (USD)\n19.04-28.56\nCountry\nUnited States\nDate\n07-Jan-2026\nJob ID\n5316\nDescription & Requirements\nJoin Our Team and Make a Difference!\nAre you looking for an impactful role where you finish the workday knowing you helped someone? Whether you are part of our care coordination team or play a supporting role, the work our colleagues do every day enables us to collectively reach our mission of\ngetting people the care they need when they need it.\nBy staying committed to our core values of\nThink Big, Go Fast, Deliver Awe, Win Together and Care Deeply\n,\nwe can positively impact the lives of the injured workers we serve and get them back to the things that matter most in life.\nSalary Range:\nThis compensation range considers a wide range of factors, including, but not limited to, skill set, experience and training, licensure and certifications, and other business and organizational needs. The disclosed range estimate is not adjusted for geographic differential associated with the location where the position may be filled. At One Call, it is not typical for an individual to be hired at or near the top of the range for their role, and compensation decisions are dependent on the facts and circumstances of each case.\nWhat We Provide in Return for Your Commitment to Our Mission\nWe offer a vast array of benefits to help support the whole you, including:\nRemote Work:\nWe are a remote-first company, and almost all positions receive the flexibility of working from home.\nGenerous Time Off:\nBesides 8 company holidays and 2 personal days every year, all colleagues receive a minimum of 18 days of paid time off.\nComprehensive Benefits Package:\nIncluding medical, dental, vision, and pet insurance; 401(k) matching program; and company-paid life insurance and short and long-term disability coverage.\nSupportive Services:\nJust like our colleagues get injured workers the care they need when they need it, we want to do the same for our colleagues in their time of need. We offer a Colleague Assistance Program that provides free counseling and financial services, and our One Call Foundation, a non-profit arm of our company, provides colleagues financial assistance during times of unexpected hardships.\nJOB SUMMARY:\nThe Negotiations Specialist will provide real-time support to Operations by locating out-of-network providers and/or addressing in-network providers requesting rates outside of their contract by negotiating single rate agreements or identifying in-network providers willing to accept the referral utilizing contracted rates. The Negotiations Specialist is a partner to the scheduling team, ensuring that One Call secures providers and confirms negotiated services are started timely.\nESSENTIAL DUTIES & RESPONSIBILITIES:\nNegotiation: 40%\nConduct negotiations with out-of-network/network providers for prospective referrals utilizing established guidelines.\nExecutes short-term agreements (i.e., Single Referral Agreements) for One Call’s referrals if we are unable to staff through One Call’s provider network.\nWorks with contracted providers that request reimbursement outside of contracted rates in conjunction with the Provider Engagement & Contracting Teams.\nRecruiting Providers: 30%\nEffectively and timely locate an out-of-network provider that meets the operational needs of a specific referral.\nEffectively communicate the One Call value proposition to out-of-network providers.\nSubmit interested or viable non-contracted providers to Provider Contracting for contracting opportunities.\nCompliance: 15%\nAcquires minimum provider qualification documents at completion of Single Referral Agreement.\nSubmits Single Referral Agreement request to Provider Data Management.\nEnsures proper notation and documentation for each assigned task is clean, clear, and concise.\nCustomer Care: 15%\nCleary communicates dates and other instructions with the service provider(s) for negotiated files.\nConfirms Start of Care for negotiated files.\nMeets the established team standards, including (but not limited to) quality standards and turnaround time requirements.\nProvides an outstanding experience to internal and external customers, where applicable.\nAble to support various levels of management on ad-hoc requests and perform other related duties as assigned.\nEDUCATIONAL AND EXPERIENCE REQUIREMENTS:\nAssociate’s degree, or 1-2 years experience instead of a degree.\nESSENTIAL KNOWLEDGE, SKILLS & ABILITIES:\nFinancial acumen.\nProficient in negotiating with the ability to calculate margins based on client & provider pricing.\nGood understanding of One Call products and services.\nGeneral knowledge of the workers’ compensation industry.\nGeneral knowledge of negotiation principles.\nExcellent customer service competencies.\nExcellent verbal and written communication skills.\nProficiency to operate independently on work that is often confidential.\nComputer navigation and operation skills.\nDemonstrates effective people skills and sensitivities when dealing with others.\nAble to work both independently and in a team environment.\nCommunicates concisely, and professionally.\nAble to understand, apply, and explain concepts.\nAble to handle projects commensurate with job expectations.\nAble to analyze and solve problems using learned techniques and tools.\nRequires human relations, negotiation, and documentation skills.\nRequires high attention to detail.\nFlexibility, versatility, and dependability.\nAble to work in an environment that aligns with the company's diversity, equity, inclusion, and belonging standards.\nAble to work both independently and in a team\nDemonstrate our core values of Think Big, Go Fast, Deliver Awe, and Win Together.\nPHYSICAL/MENTAL DEMANDS & WORK ENVIRONMENT:\nThis position will be performed in the colleague’s home. Work-from-home requirements include the colleague’s ability to set up computer equipment within their home office.\nThis job is primarily sedentary and may involve repetitive motions; the colleague must be able to remain stationary for extended periods, operate a computer and other office equipment, assess information and files stored electronically, and converse/exchange accurate information with others, simultaneously.\nThe colleague must be able to discern text displayed on a monitor, input data into specific fields using a keyboard, and adjust focus to distances of up to three feet.\nThe colleague must have the ability to learn new tasks, follow established processes, maintain focus, complete tasks independently, complete multiple tasks simultaneously, communicate professionally with colleagues and customers, and complete tasks in situations that require speed or productivity.\nThe colleague must be able to manage moderate to significant mental stress because of, but not limited to, a dynamic and heavy workload.\nPlease be advised that job descriptions typically change over time as business needs, job requirements, and employee skill levels change. As such, One Call retains the right to change or assign other duties to this position at any time.\nADDITIONAL LEVELS WITHIN JOB FAMILY:\nNegotiation Specialist I\nThe Negotiation Specialist I has a general understanding of staffing, healthcare products, and services, and the ability to negotiate single referral agreement pricing. Works under close supervision with limited latitude for independent judgment. Consults with senior peers as necessary for non-standard issues and unconventional challenges.\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment regardless to race, color, religion, sex, nationality, disability status, protected veteran status, or any other status protected by law.\nGo back\nApply\nFacebook\nLinkedIn\nX\nEmail",
        "application_url": "https://onecall.avature.net/careers/SearchJobs/?folderRecordsPerPage=6&folderOffset=12&jobOffset=12",
        "": {},
        "metadata": {
            "Location": "Remote",
            "Function": "Provider",
            "Business Unit": "Shared Services",
            "Full-time/Part-time": "Full Time",
            "Salary Range Min - Max (USD)": "19.04-28.56",
            "Country": "United States",
            "Date": "07-Jan-2026",
            "Job ID": "5316"
        },
        "link": "https://onecall.avature.net/careers/JobDetail/Negotiation-Spclst-I/5316"
    },
    {
        "title": "Senior Manager of Engineering",
        "description_html": null,
        "description_text": "General information\nLocation\nRemote\nFunction\nTechnology\nBusiness Unit\nShared Services\nFull-time/Part-time\nFull Time\nSalary Range Min - Max (USD)\n138568-221709\nCountry\nUnited States\nDate\n13-Jan-2026\nJob ID\n5342\nDescription & Requirements\nJoin Our Team and Make a Difference!\nAre you looking for an impactful role where you finish the workday knowing you helped someone? Whether you are part of our care coordination team or play a supporting role, the work our colleagues do every day enables us to collectively reach our mission of\ngetting people the care they need when they need it.\nBy staying committed to our core values of\nThink Big, Go Fast, Deliver Awe, Win Together and Care Deeply\n,\nwe can positively impact the lives of the injured workers we serve and get them back to the things that matter most in life.\nSalary Range:\nThis compensation range considers a wide range of factors, including, but not limited to, skill set, experience and training, licensure and certifications, and other business and organizational needs. The disclosed range estimate is not adjusted for geographic differential associated with the location where the position may be filled. At One Call, it is not typical for an individual to be hired at or near the top of the range for their role, and compensation decisions are dependent on the facts and circumstances of each case.\nWhat We Provide in Return for Your Commitment to Our Mission\nWe offer a vast array of benefits to help support the whole you, including:\nRemote Work:\nWe are a remote-first company, and almost all positions receive the flexibility of working from home.\nGenerous Time Off:\nBesides 8 company holidays and 2 personal days every year, all colleagues receive a minimum of 18 days of paid time off.\nComprehensive Benefits Package:\nIncluding medical, dental, vision, and pet insurance; 401(k) matching program; and company-paid life insurance and short and long-term disability coverage.\nSupportive Services:\nJust like our colleagues get injured workers the care they need when they need it, we want to do the same for our colleagues in their time of need. We offer a Colleague Assistance Program that provides free counseling and financial services, and our One Call Foundation, a non-profit arm of our company, provides colleagues financial assistance during times of unexpected hardships.\nJOB SUMMARY:\nAs a Senior Engineering Manager, you will be responsible for leading high-performing engineering teams in delivering scalable, high-quality technology solutions that align with our strategic goals. You will be responsible for technical direction, driving execution, and fostering a culture of innovation, ownership, and continuous improvement. Your leadership will ensure that our development processes are efficient, collaborative, and focused on delivering exceptional value to our customers.\nThis role spans one to two product areas, with direct accountability for 10–15 engineers and you’ll work cross-functionally with product managers, designers, and business stakeholders to translate vision into actionable roadmaps and technical strategies. You’ll be accountable for team performance, talent development, and operational excellence—championing modern engineering practices such as DevOps, cloud-native architectures, and agile methodologies. If you're passionate about building empowered teams and driving meaningful impact through technology, we’d love to hear from you.\nThis role is remote and operates across globally distributed teams.\nESSENTIAL DUTIES & RESPONSIBILITIES:\nLead multiple engineering teams in delivering scalable, secure, and high-quality software products.\nDrive adoption of modern development practices including Agile, DevOps, CI/CD and test automation.\nPartner with Product, Design, and Architecture to define and deliver on product roadmaps with speed and quality.\nEnsure engineering teams are aligned with business outcomes, and measure success through KPIs such as velocity, quality, availability, and customer impact.\nBuild and maintain a high-talent, high-accountability culture, including hiring, coaching, performance management, and career development.\nChampion engineering excellence through code quality, technical reviews, observability, and continuous improvement.\nManage offshore teams, ensuring alignment with internal standards and delivery expectations.\nOwn the operational health of applications including uptime, incident response, and compliance (e.g., SOC2, HIPAA).\nDrive strategic initiatives such as platform modernization, technical debt reduction, and automation.\nCollaborate across engineering, product, and business teams to resolve cross-functional challenges and deliver integrated solutions.\nManage resource allocation, and capacity planning.\nEDUCATIONAL AND EXPERIENCE REQUIREMENTS:\nBachelor’s degree in Computer Science, Engineering, or equivalent experience.\n5+ years of engineering leadership experience, including managing multiple teams and product areas.\nProven experience leading teams in cloud-native environments (e.g., AWS, Azure, GCP).\nExperience with remote-first and globally distributed teams.\nTrack record of delivering enterprise-grade software in regulated environments (SOC2, HIPAA).\nESSENTIAL KNOWLEDGE, SKILLS & ABILITIES:\nStrong leadership and communication skills; ability to inspire and influence across levels.\nDeep understanding of Agile, DevOps, CI/CD, and modern software development lifecycle.\nFamiliarity with tools like Jira, Azure DevOps, GitHub, etc.\nAbility to drive technical strategy, architecture decisions, and platform evolution.\nWorking knowledge of managing both cloud-based and on-prem applications.\nSkilled in managing engineering metrics and using data to drive decisions.\nWorking knowledge of compliance standards such as SOC2 and HIPAA compliance.\nCommitment to diversity, equity, inclusion, and belonging.\nDemonstrate our core values of Think Big, Go Fast, Deliver Awe, and Win Together\nAbility to thrive in a fast-paced, dynamic environment and manage multiple priorities.\nPHYSICAL/MENTAL DEMANDS & WORK ENVIRONMENT:\nThis position will be performed in the colleague’s home. Work-from-home requirements include the colleague’s ability to set up computer equipment within their home office.\nThis job is primarily sedentary and may involve repetitive motions; the colleague must be able to remain in a stationary position for extended periods of time, operate a computer and other office equipment, assess information and files stored electronically, and converse/exchange accurate information with others, simultaneously.\nThe colleague must be able to discern text displayed on a monitor, input data into specific fields using a keyboard, and adjust focus to distances of up to three feet.\nThe colleague must have the ability to learn new tasks, follow established processes, maintain focus, complete tasks independently, complete multiple tasks simultaneously, communicate professionally with colleagues and customers, and complete tasks in situations that require speed or productivity.\nThe colleague must be able to manage moderate to significant mental stress because of, but not limited to, a dynamic and heavy workload.\nPlease be advised that job descriptions typically change over time as business needs, job requirements, and employee skill levels change. As such, One Call retains the right to change or assign other duties to this position at any time.\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment regardless to race, color, religion, sex, nationality, disability status, protected veteran status, or any other status protected by law.\nGo back\nApply\nFacebook\nLinkedIn\nX\nEmail",
        "application_url": "https://onecall.avature.net/careers/SearchJobs/?folderRecordsPerPage=6&folderOffset=12&jobOffset=12",
        "": {},
        "metadata": {
            "Location": "Remote",
            "Function": "Technology",
            "Business Unit": "Shared Services",
            "Full-time/Part-time": "Full Time",
            "Salary Range Min - Max (USD)": "138568-221709",
            "Country": "United States",
            "Date": "13-Jan-2026",
            "Job ID": "5342"
        },
        "link": "https://onecall.avature.net/careers/JobDetail/Sr-Mgr-Engineering/5342"
    },
    {
        "title": "Transformation Specialist I",
        "description_html": null,
        "description_text": "General information\nLocation\nRemote\nFunction\nOps\nBusiness Unit\nShared Services\nFull-time/Part-time\nFull Time\nSalary Range Min - Max (USD)\n46700-70100\nCountry\nUnited States\nDate\n21-Jan-2026\nJob ID\n5345\nDescription & Requirements\nJoin Our Team and Make a Difference!\nAre you looking for an impactful role where you finish the workday knowing you helped someone? Whether you are part of our care coordination team or play a supporting role, the work our colleagues do every day enables us to collectively reach our mission of\ngetting people the care they need when they need it.\nBy staying committed to our core values of\nThink Big, Go Fast, Deliver Awe, Win Together and Care Deeply\n,\nwe can positively impact the lives of the injured workers we serve and get them back to the things that matter most in life.\nSalary Range:\nThis compensation range considers a wide range of factors, including, but not limited to, skill set, experience and training, licensure and certifications, and other business and organizational needs. The disclosed range estimate is not adjusted for geographic differential associated with the location where the position may be filled. At One Call, it is not typical for an individual to be hired at or near the top of the range for their role, and compensation decisions are dependent on the facts and circumstances of each case.\nWhat We Provide in Return for Your Commitment to Our Mission\nWe offer a vast array of benefits to help support the whole you, including:\nRemote Work:\nWe are a remote-first company, and almost all positions receive the flexibility of working from home.\nGenerous Time Off:\nBesides 8 company holidays and 2 personal days every year, all colleagues receive a minimum of 18 days of paid time off.\nComprehensive Benefits Package:\nIncluding medical, dental, vision, and pet insurance; 401(k) matching program; and company-paid life insurance and short and long-term disability coverage.\nSupportive Services:\nJust like our colleagues get injured workers the care they need when they need it, we want to do the same for our colleagues in their time of need. We offer a Colleague Assistance Program that provides free counseling and financial services, and our One Call Foundation, a non-profit arm of our company, provides colleagues financial assistance during times of unexpected hardships.\nJOB SUMMARY:\nThis position is responsible for supporting and driving organizational change and growth. Your primary responsibilities will be to support the execution of business transformation initiatives, ensure the successful implementation and adoption of new processes and systems, and assist with the discovery efforts on initiatives. You will do this by collaborating with various stakeholders to collect the data necessary to execute operational transformation initiatives.\nESSENTIAL DUTIES & RESPONSIBILITIES:\nTransformation Support: 45%\nResponsible for data collection to support the Transformation team during projects and/or initiatives to help drive transformational change.\nUtilize data analytics to monitor performance metrics, identify trends, and measure the impact of transformation initiatives.\nResponsible for identifying potential areas of opportunity through data and root cause analysis.\nAssist Transformation leaders with any pre-/post-testing on transformation technology initiatives.\nCollaboration: 35%\nWork cross-functionally with different teams, including IT and Operations, to align transformation efforts with overall business objectives.\nPartner with subject matter experts and operational leaders to collect data necessary to support projects and/or initiatives.\nInfluences internal and external sources to implement strategies and achieve transformation objectives.\nAdministrative: 20%\nComplete the reporting and analytics of initiative outcomes to identify improvement opportunities.\nResponsible for the timely delivery of functional area commitments.\nAbility to work independently with minimal instruction.\nEDUCATIONAL AND EXPERIENCE REQUIREMENTS:\nAssociate’s degree in a related field, and 1-2 years of relevant experience, or\nAn equivalent combination of education and 1-2 years of relevant work experience.\nESSENTIAL KNOWLEDGE, SKILLS & ABILITIES:\nGood understanding of One Call products and services.\nGeneral knowledge of the workers’ compensation industry.\nAble to communicate ideas clearly and professionally, in both written and verbal form, to audiences at all levels of the organization.\nAble to establish and maintain effective working relationships with all levels of leadership (internally/externally), colleagues, clients, and the public.\nProven ability to meet deliverable timelines, with a strong track record of active collaboration with various stakeholders.\nProficiency in Microsoft Office suite applications.\nProcess improvement expertise.\nStrong data analytics skills.\nAbility to stay motivated in a work-from-home environment.\nPHYSICAL/MENTAL DEMANDS & WORK ENVIRONMENT:\nThis position will be performed in the colleague’s home. Work-from-home requirements include the colleague’s ability to set up computer equipment within their home office.\nThis job is primarily sedentary and may involve repetitive motions; the colleague must be able to remain stationary for extended periods, operate a computer and other office equipment, assess information and files stored electronically, and converse/exchange accurate information with others, simultaneously.\nThe colleague must be able to discern text displayed on a monitor, input data into specific fields using a keyboard, and adjust focus to distances of up to three feet.\nThe colleague must have the ability to learn new tasks, follow established processes, maintain focus, complete tasks independently, complete multiple tasks simultaneously, communicate professionally with colleagues and customers, and complete tasks in situations that require speed or productivity.\nThe colleague must be able to manage moderate to significant mental stress because of, but not limited to, a dynamic and heavy workload.\nPlease be advised that job descriptions typically change over time as business needs, job requirements, and employee skill levels change. As such, One Call retains the right to change or assign other duties to this position at any time.\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment regardless to race, color, religion, sex, nationality, disability status, protected veteran status, or any other status protected by law.\nGo back\nApply\nFacebook\nLinkedIn\nX\nEmail",
        "application_url": "https://onecall.avature.net/careers/SearchJobs/?folderRecordsPerPage=6&folderOffset=12&jobOffset=12",
        "": {},
        "metadata": {
            "Location": "Remote",
            "Function": "Ops",
            "Business Unit": "Shared Services",
            "Full-time/Part-time": "Full Time",
            "Salary Range Min - Max (USD)": "46700-70100",
            "Country": "United States",
            "Date": "21-Jan-2026",
            "Job ID": "5345"
        },
        "link": "https://onecall.avature.net/careers/JobDetail/Transformation-Spclst-I/5345"
    },
    {
        "title": "Sales Executive Large Market",
        "description_html": null,
        "description_text": "General information\nLocation\nRemote\nFunction\nCommercial\nBusiness Unit\nShared Services\nFull-time/Part-time\nFull Time\nSalary Range Min - Max (USD)\n116100-191500\nCountry\nUnited States\nDate\n14-Jan-2026\nJob ID\n5347\nDescription & Requirements\nJoin Our Team and Make a Difference!\nAre you looking for an impactful role where you finish the workday knowing you helped someone? Whether you are part of our care coordination team or play a supporting role, the work our colleagues do every day enables us to collectively reach our mission of\ngetting people the care they need when they need it.\nBy staying committed to our core values of\nThink Big, Go Fast, Deliver Awe, Win Together and Care Deeply\n,\nwe can positively impact the lives of the injured workers we serve and get them back to the things that matter most in life.\nSalary Range:\nThis compensation range considers a wide range of factors, including, but not limited to, skill set, experience and training, licensure and certifications, and other business and organizational needs. The disclosed range estimate is not adjusted for geographic differential associated with the location where the position may be filled. At One Call, it is not typical for an individual to be hired at or near the top of the range for their role, and compensation decisions are dependent on the facts and circumstances of each case.\nWhat We Provide in Return for Your Commitment to Our Mission\nWe offer a vast array of benefits to help support the whole you, including:\nRemote Work:\nWe are a remote-first company, and almost all positions receive the flexibility of working from home.\nGenerous Time Off:\nBesides 8 company holidays and 2 personal days every year, all colleagues receive a minimum of 18 days of paid time off.\nComprehensive Benefits Package:\nIncluding medical, dental, vision, and pet insurance; 401(k) matching program; and company-paid life insurance and short and long-term disability coverage.\nSupportive Services:\nJust like our colleagues get injured workers the care they need when they need it, we want to do the same for our colleagues in their time of need. We offer a Colleague Assistance Program that provides free counseling and financial services, and our One Call Foundation, a non-profit arm of our company, provides colleagues financial assistance during times of unexpected hardships.\nJOB SUMMARY:\nThe Sales Executive is responsible for identifying and developing new business opportunities to support the company’s revenue goals. This role involves pipeline development and fostering relationships with prospects and stakeholders. The Sales Executive collaborates with the sales and marketing teams to drive growth within assigned markets. Sales Executives are responsible for identifying, developing, and closing new business opportunities within large commercial accounts in the Commercial Sales sectors. The ideal candidate is a skilled relationship builder and strategic thinker with a strong background in B2B sales and a passion for delivering value to clients.\nESSENTIAL DUTIES & RESPONSIBILITIES:\nStrategic Sales Execution:\nExecute the company’s sales strategy to meet assigned revenue targets.\nMonitor market trends and identify opportunities for targeted growth.\nAnalyze market trends and competitor activities to identify opportunities for expansion and differentiation.\nInstill a belief in the company's vision, mission, goals, and work to establish One Call as an industry expert.\nWork closely with the Commercial and cross-functional teams (marketing, product, operations) to support strategic initiatives and ensure seamless client onboarding & retention.\nBuild and maintain strong relationships with key stakeholders in large commercial organizations. Serve as a trusted advisor and advocate for client success.\nBusiness & Pipeline Development:\nProspect and engage large market clients through outbound efforts, networking, and strategic outreach to generate new business opportunities. Build and manage a prospective pipeline of sales opportunities.\nEstablish and maintain relationships with clients, brokers, and industry contacts.\nIdentify potential opportunities through research and client outreach.\nDemonstrate specialized product knowledge for One Call solutions, market, and competitive intelligence.\nPrepare and present proposals to prospects and industry stakeholders – utilizing One Call resources and tools.\nIdentify and mitigate risks associated with sales activities.\nStay informed on industry trends, competitive landscape, and client challenges to tailor solutions and position offerings effectively.\nSales Process Management:\nManage the full sales cycle from lead generation to contract negotiation and close, ensuring alignment with company goals and client needs.\nBusiness Development\nMaintain accurate records of sales activities, pipeline status, and client interactions in the CRM system. Provide regular updates and insights to leadership.\nMeet or exceed individual sales targets and contribute to the overall success of the large market segment.\nEDUCATIONAL AND EXPERIENCE REQUIREMENTS:\nBachelor’s degree in Business, Marketing, or related field\n3–5 years of experience in B2B sales, preferably in healthcare or workers’ compensation markets\nProven track record of success in large account sales and revenue generation, preferably in healthcare and/or worker’s compensation markets\nStrong communication, negotiation, and presentation skills\nProficiency with CRM tools (e.g., Salesforce) and sales analytics\nSelf-motivated, goal-oriented, and adaptable in a fast-paced environment\nESSENTIAL KNOWLEDGE, SKILLS & ABILITIES:\nProven track record of success in a sales role within the insurance industry and/or workers' compensation.\nStrong understanding of workers' compensation insurance products and market dynamics.\nProficiency in using CRM software and other sales tools.\nStrategic Thinking: Ability to think long-term and develop comprehensive sales strategies.\nRelationship Building: Excellent ability to build and maintain relationships with clients, partners, and team members.\nNegotiation: Skilled negotiator with a proven track record in closing complex deals.\nAnalytical Skills: Strong analytical skills to assess market trends, sales performance, and financial data.\nCommunication: Outstanding verbal and written communication skills.\nAbility to work in an environment that aligns with the company's diversity, equity, inclusion and belonging standards.\nAbility to work both independently and in a team environment.\nDemonstrate our core values of Think Big, Go Fast, Deliver Awe, Win Together and Care Deeply.\nPHYSICAL/MENTAL DEMANDS & WORK ENVIRONMENT:\nThis position will be performed primarily in the colleague’s home but will also require travel to other sites and include both sedentary and active work.\nWork-from-home requirements include the colleague’s ability to set up computer equipment within their home office.\nTravel requirements include the colleague’s ability to move between work locations for client meetings and other field work assignments.\nThis role requires travel at a minimum of 50% of the time.\nThe colleague must be able to remain in a stationary position, operate a computer and other office equipment, perform repetitive motions, assess information and files stored electronically, converse with customers and exchange accurate information.\nThe colleague must be able to discern text displayed on a monitor and input data into specific fields using a keyboard.\nThe colleague must have the ability to learn new tasks, follow established processes, maintain focus, complete tasks independently, complete multiple tasks simultaneously, communicate professionally with colleagues and customers, and complete tasks in situations that have a speed or productivity requirement.\nThe colleague must be able to manage moderate to significant mental stress as a result of, but not limited to, a dynamic and heavy workload.\nPlease be advised that job descriptions typically change over time as business needs, job requirements, and employee skill levels change. As such, One Call retains the right to change or assign other duties to this position at any time.\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment regardless to race, color, religion, sex, nationality, disability status, protected veteran status, or any other status protected by law.\nGo back\nApply\nFacebook\nLinkedIn\nX\nEmail",
        "application_url": "https://onecall.avature.net/careers/SearchJobs/?folderRecordsPerPage=6&folderOffset=18&jobOffset=18",
        "": {},
        "metadata": {
            "Location": "Remote",
            "Function": "Commercial",
            "Business Unit": "Shared Services",
            "Full-time/Part-time": "Full Time",
            "Salary Range Min - Max (USD)": "116100-191500",
            "Country": "United States",
            "Date": "14-Jan-2026",
            "Job ID": "5347"
        },
        "link": "https://onecall.avature.net/careers/JobDetail/Sales-Exec-Large-Mkt/5347"
    },
    {
        "title": "Strategic Acct Executive, Regional Accounts",
        "description_html": null,
        "description_text": "General information\nLocation\nRemote\nFunction\nCommercial\nBusiness Unit\nShared Services\nFull-time/Part-time\nFull Time\nSalary Range Min - Max (USD)\n116100-191500\nCountry\nUnited States\nDate\n14-Jan-2026\nJob ID\n5348\nDescription & Requirements\nJoin Our Team and Make a Difference!\nAre you looking for an impactful role where you finish the workday knowing you helped someone? Whether you are part of our care coordination team or play a supporting role, the work our colleagues do every day enables us to collectively reach our mission of\ngetting people the care they need when they need it.\nBy staying committed to our core values of\nThink Big, Go Fast, Deliver Awe, Win Together and Care Deeply\n,\nwe can positively impact the lives of the injured workers we serve and get them back to the things that matter most in life.\nSalary Range:\nThis compensation range considers a wide range of factors, including, but not limited to, skill set, experience and training, licensure and certifications, and other business and organizational needs. The disclosed range estimate is not adjusted for geographic differential associated with the location where the position may be filled. At One Call, it is not typical for an individual to be hired at or near the top of the range for their role, and compensation decisions are dependent on the facts and circumstances of each case.\nWhat We Provide in Return for Your Commitment to Our Mission\nWe offer a vast array of benefits to help support the whole you, including:\nRemote Work:\nWe are a remote-first company, and almost all positions receive the flexibility of working from home.\nGenerous Time Off:\nBesides 8 company holidays and 2 personal days every year, all colleagues receive a minimum of 18 days of paid time off.\nComprehensive Benefits Package:\nIncluding medical, dental, vision, and pet insurance; 401(k) matching program; and company-paid life insurance and short and long-term disability coverage.\nSupportive Services:\nJust like our colleagues get injured workers the care they need when they need it, we want to do the same for our colleagues in their time of need. We offer a Colleague Assistance Program that provides free counseling and financial services, and our One Call Foundation, a non-profit arm of our company, provides colleagues financial assistance during times of unexpected hardships.\nJOB SUMMARY:\nAdvanced professional role, serving clients by identifying and providing product-based solutions to satisfy their unique needs. Sells products and/or services and manages relationships with existing named accounts to ensure satisfaction, alignment of One Call’s Workers Compensation Strategy with One Call’s Corporate Strategy, account retention, and continued revenue growth. Assigned to large, complex, high visibility, strategic, or tactically important accounts. Determines methods and procedures towards strategic initiatives and may coordinate activities of other personnel.\nESSENTIAL DUTIES & RESPONSIBILITIES:\nMeets with current and future customers to review product portfolio and create custom solutions based on need and desired outcome.\nProvides product service or technical information by answering customer questions or requests, RFPs, or RFQs\nMay negotiate contract terms and close sales by agreeing to terms and conditions.\nPrepares custom presentations and reports for head office and keeps customer records.\nAttends sales calls or on-site visits, and reviews quotes/proposals.\nProvides product feedback to appropriate stakeholders and development teams based on client input.\nMay ensure that post-sales support or implementation services meet customer expectations.\nServes as a leader of authority with expert-level knowledge in one or more areas.\nMakes authoritative decisions and recommendations.\nPlans, organizes, & guides projects as needed.\nMay be called on to consult in other areas.\nWorks to achieve assigned sales quota.\nDemonstrates product and industry knowledge including various solutions, market strategies, and competitive intelligence.\nEnsures accurate forecasting and pipeline management as well as accurate content and certification of information in sales software for assigned clients.\nImplements account coverage methodologies that ensure 100% renewal rates of current One Call clients.\nIdentifies and reports “at risk” clients and escalates to executive management; prepares, implements and executes “at risk” plan.\nEDUCATIONAL AND EXPERIENCE REQUIREMENTS:\nA BS/BA degree from an accredited college/university; MBA or advanced degree in related field of study preferred\nA minimum of 5 years of sales solutions engineering/architecture experience required; 10 years preferred.\nESSENTIAL KNOWLEDGE, SKILLS & ABILITIES:\nGood understanding of One Call products and services\nGeneral knowledge of workers’ compensation industry\nCommunicates ideas both verbally, in written form and via presentation in a clear, concise, and professional manner appropriate to audience including executive levels.\nRequires the ability to establish and maintain effective working relationships with all levels of management (internally/externally), employees, clients and public.\nAbility to work in an environment that aligns with the company's diversity, equity, inclusion and belonging standards.\nAbility to show established track record of involvement in industry trade groups preferred.\nAbility to work both independently and in a team environment.\nExpert knowledge of Microsoft Office suite of applications, CRM software, and data visualization tools.\nDemonstrate our core values of Think Big, Go Fast, Deliver Awe, Win Together and Care Deeply.\nAbility to work in an environment that aligns with the company's diversity, equity, inclusion and belonging standards.\nAbility to work both independently and in a team environment.\nDemonstrate our core values of Think Big, Go Fast, Deliver Awe, Win Together and Care Deeply.\nPHYSICAL/MENTAL DEMANDS & WORK ENVIRONMENT:\nThis position will be performed primarily in the colleague’s home but will also require travel to other sites and include both sedentary and active work.\nWork-from-home requirements include the colleague’s ability to set up computer equipment within their home office.\nTravel requirements include the colleague’s ability to move between work locations for client meetings and other field work assignments.\nDuring duties located in the field; this job is primarily active; the employee is regularly mobile and must be able to utilize transportation (such as driving and managing air travel), use hands and fingers, speak and hear.\nThe employee may be required to travel up to 50% of their working hours.\nThe colleague must be able to remain in a stationary position, operate a computer and other office equipment, perform repetitive motions, assess information and files stored electronically, converse with customers and exchange accurate information.\nThe colleague must be able to discern text displayed on a monitor and input data into specific fields using a keyboard.\nThe colleague must have the ability to learn new tasks, follow established processes, maintain focus, complete tasks independently, complete multiple tasks simultaneously, communicate professionally with colleagues and customers, and complete tasks in situations that have a speed or productivity requirement.\nThe colleague must be able to manage moderate to significant mental stress as a result of, but not limited to, a dynamic and heavy workload.\nPlease be advised that job descriptions typically change over time as business needs, job requirements, and employee skill levels change. As such, One Call retains the right to change or assign other duties to this position at any time.\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment regardless to race, color, religion, sex, nationality, disability status, protected veteran status, or any other status protected by law.\nGo back\nApply\nFacebook\nLinkedIn\nX\nEmail",
        "application_url": "https://onecall.avature.net/careers/SearchJobs/?folderRecordsPerPage=6&folderOffset=18&jobOffset=18",
        "": {},
        "metadata": {
            "Location": "Remote",
            "Function": "Commercial",
            "Business Unit": "Shared Services",
            "Full-time/Part-time": "Full Time",
            "Salary Range Min - Max (USD)": "116100-191500",
            "Country": "United States",
            "Date": "14-Jan-2026",
            "Job ID": "5348"
        },
        "link": "https://onecall.avature.net/careers/JobDetail/Strategic-Acct-Executive/5348"
    },
    {
        "title": "Retro Billing Associate II",
        "description_html": null,
        "description_text": "General information\nLocation\nRemote\nFunction\nRCM\nBusiness Unit\nShared Services\nFull-time/Part-time\nFull Time\nSalary Range Min - Max (USD)\n17.75-26.7\nCountry\nUnited States\nDate\n21-Jan-2026\nJob ID\n5349\nDescription & Requirements\nJoin Our Team and Make a Difference!\nAre you looking for an impactful role where you finish the workday knowing you helped someone? Whether you are part of our care coordination team or play a supporting role, the work our colleagues do every day enables us to collectively reach our mission of\ngetting people the care they need when they need it.\nBy staying committed to our core values of\nThink Big, Go Fast, Deliver Awe, Win Together and Care Deeply\n,\nwe can positively impact the lives of the injured workers we serve and get them back to the things that matter most in life.\nSalary Range:\nThis compensation range considers a wide range of factors, including, but not limited to, skill set, experience and training, licensure and certifications, and other business and organizational needs. The disclosed range estimate is not adjusted for geographic differential associated with the location where the position may be filled. At One Call, it is not typical for an individual to be hired at or near the top of the range for their role, and compensation decisions are dependent on the facts and circumstances of each case.\nWhat We Provide in Return for Your Commitment to Our Mission\nWe offer a vast array of benefits to help support the whole you, including:\nRemote Work:\nWe are a remote-first company, and almost all positions receive the flexibility of working from home.\nGenerous Time Off:\nBesides 8 company holidays and 2 personal days every year, all colleagues receive a minimum of 18 days of paid time off.\nComprehensive Benefits Package:\nIncluding medical, dental, vision, and pet insurance; 401(k) matching program; and company-paid life insurance and short and long-term disability coverage.\nSupportive Services:\nJust like our colleagues get injured workers the care they need when they need it, we want to do the same for our colleagues in their time of need. We offer a Colleague Assistance Program that provides free counseling and financial services, and our One Call Foundation, a non-profit arm of our company, provides colleagues financial assistance during times of unexpected hardships.\nJOB SUMMARY:\nThe Retro Billing Associate reviews bills submitted by payors and channel partners via One Call’s retrospective program. Associates follow state and federal guidelines, fee schedules, and customer-specific rules to obtain enhanced savings for our clients. Associates interact with Providers and Claim Professionals as necessary to deliver accurate and efficient bill processing. Communicates timely responses to inquiries from Internal and External customers.\nESSENTIAL DUTIES & RESPONSIBILITIES:\nLearns or remains current on billing protocols and regulations, federal and state regulations, and internal procedures that affect processing.\nProvides subject matter expertise on billing and coding guidelines and regulations as required by the department.\nUses internal and external billing protocols and regulations for repricing bills at a cost savings to the customer.\nIdentifies trending opportunities related to policies and procedures to ensure efficiency and accuracy in bill processing.\nReviews, researches, and initiates the resolution of billing errors.\nReviews, researches, and resolves customer-related inquiries.\nDevelops/maintains process documentation for each assigned task.\nCommunicates with appropriate internal departments to solve issues and discrepancies.\nPerforms other related duties as assigned.\nEDUCATIONAL AND EXPERIENCE REQUIREMENTS:\nHigh school diploma/GED required.\nESSENTIAL KNOWLEDGE, SKILLS & ABILITIES:\nKnowledge of Billing rules and regulations and federal and state regulations.\nExcellent customer service skills that build high levels of customer satisfaction.\nEffective verbal and written communication skills.\nComputer navigation and operation skills.\nDetail-oriented with good organizational skills.\nAbility to manage multiple tasks.\nAbility to work both independently and in a team environment.\nAbility to maintain confidentiality.\nProficient with Microsoft Office.\nAbility to work in an environment that aligns with the company's diversity, equity, inclusion and belonging standards.\nAbility to work both independently and in a team environment.\nDemonstrate our core values of Think Big, Go Fast, Deliver Awe, and Win Together.\nPHYSICAL/MENTAL DEMANDS & WORK ENVIRONMENT:\nThis position will be performed in the colleague’s home. Work-from-home requirements include the colleague’s ability to set up computer equipment within their home office.\nThis job is primarily sedentary and may involve repetitive motions; the colleague must be able to remain in a stationary position for extended periods of time, operate a computer and other office equipment, assess information and files stored electronically, and converse/exchange accurate information with others, simultaneously.\nThe colleague must be able to discern text displayed on a monitor, input data into specific fields using a keyboard, and adjust focus to distances of up to three feet.\nThe colleague must have the ability to learn new tasks, follow established processes, maintain focus, complete tasks independently, complete multiple tasks simultaneously, communicate professionally with colleagues and customers, and complete tasks in situations that have a speed or productivity requirement.\nThe colleague must be able to manage moderate to significant mental stress as a result of, but not limited to, a dynamic and heavy workload.\nPlease be advised that job descriptions typically change over time as business needs, job requirements, and employee skill levels change. As such, One Call retains the right to change or assign other duties to this position at any time.\nRetro Billing Associate II\nIntermediate role. Moderate skills with high level of proficiency. Performs billing resolution processing and handles inquiries. Questions and issues are predominantly routine, but associate must be able to deviate from standard scripts and procedures as needed. Assists with resolving billing related issues within the department. May coach and share information with associates with less experience and/or expertise. Works under close to general supervision with little latitude for independent judgment. May consult with senior peers and team leads to learn through experience. Requires a High School diploma and typically a minimum of 2 to 3 years of experience in an office setting and/or billing experience.\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment regardless to race, color, religion, sex, nationality, disability status, protected veteran status, or any other status protected by law.\nGo back\nApply\nFacebook\nLinkedIn\nX\nEmail",
        "application_url": "https://onecall.avature.net/careers/SearchJobs/?folderRecordsPerPage=6&folderOffset=18&jobOffset=18",
        "": {},
        "metadata": {
            "Location": "Remote",
            "Function": "RCM",
            "Business Unit": "Shared Services",
            "Full-time/Part-time": "Full Time",
            "Salary Range Min - Max (USD)": "17.75-26.7",
            "Country": "United States",
            "Date": "21-Jan-2026",
            "Job ID": "5349"
        },
        "link": "https://onecall.avature.net/careers/JobDetail/Retro-Billing-Assoc-II/5349"
    },
    {
        "title": "VP, Data",
        "description_html": null,
        "description_text": "General information\nLocation\nRemote\nFunction\nTechnology\nBusiness Unit\nShared Services\nFull-time/Part-time\nFull Time\nSalary Range Min - Max (USD)\n192942-308708\nCountry\nUnited States\nDate\n22-Jan-2026\nJob ID\n5352\nDescription & Requirements\nJoin Our Team and Make a Difference!\nAre you looking for an impactful role where you finish the workday knowing you helped someone? Whether you are part of our care coordination team or play a supporting role, the work our colleagues do every day enables us to collectively reach our mission of\ngetting people the care they need when they need it.\nBy staying committed to our core values of\nThink Big, Go Fast, Deliver Awe, Win Together and Care Deeply\n,\nwe can positively impact the lives of the injured workers we serve and get them back to the things that matter most in life.\nSalary Range:\nThis compensation range considers a wide range of factors, including, but not limited to, skill set, experience and training, licensure and certifications, and other business and organizational needs. The disclosed range estimate is not adjusted for geographic differential associated with the location where the position may be filled. At One Call, it is not typical for an individual to be hired at or near the top of the range for their role, and compensation decisions are dependent on the facts and circumstances of each case.\nWhat We Provide in Return for Your Commitment to Our Mission\nWe offer a vast array of benefits to help support the whole you, including:\nRemote Work:\nWe are a remote-first company, and almost all positions receive the flexibility of working from home.\nGenerous Time Off:\nBesides 8 company holidays and 2 personal days every year, all colleagues receive a minimum of 18 days of paid time off.\nComprehensive Benefits Package:\nIncluding medical, dental, vision, and pet insurance; 401(k) matching program; and company-paid life insurance and short and long-term disability coverage.\nSupportive Services:\nJust like our colleagues get injured workers the care they need when they need it, we want to do the same for our colleagues in their time of need. We offer a Colleague Assistance Program that provides free counseling and financial services, and our One Call Foundation, a non-profit arm of our company, provides colleagues financial assistance during times of unexpected hardships.\nJOB SUMMARY:\nThe VP Data is a critical senior leadership role responsible for defining, building, and governing One Call’s enterprise data foundation in alignment with the company’s digital platform vision. This leader will oversee data architecture, data engineering, data governance, master data management, and enterprise analytics — ensuring that One Call’s extensive data assets are high-quality, real-time, trusted, and fully capable of supporting our AI strategy and the company’s operational transformation.\nThis role serves as the primary steward of One Call’s data ecosystem, enabling the organization to harness its data for workflow automation, operational excellence, customer experience improvement, customer analytics and future AI-driven capabilities. The VP Data will partner closely with Engineering, Product, Operations, Clinical, Network, Finance, Commercial and Executive Leadership to ensure data is treated as a strategic enterprise asset and embedded into the company’s day-to-day and long-term decision making.\nThe position requires a highly strategic, technically strong leader with deep experience in enterprise data management, capable of building modern data systems and fostering a culture of data literacy, transparency, and continuous improvement.\nESSENTIAL DUTIES & RESPONSIBILITIES:\nStrategic Leadership:\nDefine and execute the enterprise data strategy in alignment with corporate objectives and One Call’s AI strategy.\nEstablish a modern, cloud-native enterprise data architecture that scales and integrates with the care coordination platform.\nDevelop and communicate the long‑term data roadmap, prioritizing investments that enhance data accessibility, quality, and governance.\nServe as a strategic advisor to executive leadership, ensuring data capabilities advance business goals\nData Architecture & Platform Development\nArchitect core data platforms including our data lake, streaming pipelines, ingestion frameworks, semantic layers, and metadata systems.\nDesign and maintain a unified enterprise data model enabling analytics, automation, and AI readiness.\nEnsure delivery of highly available pipelines and data services powering business applications and workflows\nData Governance. Quality & Master Data Management\nLead governance programs ensuring data accuracy, consistency, and compliance.\nEstablish stewardship roles ensuring accountability for data quality.\nImplement strong privacy, security, and access controls\nAnalytics & Insight Enablement\nDevelop scalable analytics foundations and self‑service tools.\nEnsure analytics maturity supports predictive and automated decisioning.\nDefine KPIs, reporting standards, and dashboards.\nCross- Functional Collaboration\nPartner across Engineering, Product, Operations, Network, and Commercial teams to align data solutions with business needs.\nCollaborate with Product Management to embed data and analytics into digital platform experiences.\nEnsure alignment of data investments with enterprise priorities.\nSupport customer‑facing and operational teams with accurate, timely data.\nLeadership & Organizational Development\nBuild and scale a high‑performing data organization.\nImplement best practices for data operations, agile delivery, and monitoring.\nFoster a strong culture of data literacy and responsible usage.\nManage vendors and evaluate emerging technologies.\nEDUCATIONAL AND EXPERIENCE REQUIREMENTS:\nBachelor’s Degree in Computer Science, Information Systems, Engineering, Data Science, or related field; advanced degree preferred.\n10+ years of progressive experience in enterprise data management and leadership roles.\nExperience building and governing cloud-based data platforms.\nStrong knowledge of healthcare or service-oriented operational businesses preferred\nESSENTIAL KNOWLEDGE, SKILLS & ABILITIES:\nAbility to design and deliver large-scale data strategies.\nExpertise in cloud platforms, modern data architectures, and engineering patterns.\nStrong background in governance, Master Data Management (MDM), metadata, lineage, and data quality\nExcellent leadership, communication, and stakeholder management capabilities.\nStrong analytical and strategic thinking skills.\nAbility to work in fast-paced environments with competing priorities.\nAbility to work in an environment that aligns with the company's diversity, equity, inclusion and belonging standards.\nAbility to work both independently and in a team environment.\nDemonstrate our core values of Think Big, Go Fast, Deliver Awe, Win Together and Care Deeply.\nPHYSICAL/MENTAL DEMANDS & WORK ENVIRONMENT:\nThis position will be performed in the colleague’s home. Work-from-home requirements include the colleague’s ability to set up computer equipment within their home office. Occasional in-person team meetings may be required depending on the position.\nThis job is primarily sedentary and may involve repetitive motions; the colleague must be able to remain in a stationary position for extended periods of time, operate a computer and other office equipment, assess information and files stored electronically, and converse/exchange accurate information with others, simultaneously.\nThe colleague must be able to discern text displayed on a monitor, input data into specific fields using a keyboard, and adjust focus to distances of up to three feet.\nThe colleague must have the ability to learn new tasks, follow established processes, maintain focus, complete tasks independently, complete multiple tasks simultaneously, communicate professionally with colleagues and customers, and complete tasks in situations that have a speed or productivity requirement.\nThe colleague must be able to manage moderate to significant mental stress as a result of, but not limited to, a dynamic and heavy workload.\nPlease be advised that job descriptions typically change over time as business needs, job requirements, and employee skill levels change. As such, One Call retains the right to change or assign other duties to this position at any time.\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment regardless to race, color, religion, sex, nationality, disability status, protected veteran status, or any other status protected by law.\nGo back\nApply\nFacebook\nLinkedIn\nX\nEmail",
        "application_url": "https://onecall.avature.net/careers/SearchJobs/?folderRecordsPerPage=6&folderOffset=18&jobOffset=18",
        "": {},
        "metadata": {
            "Location": "Remote",
            "Function": "Technology",
            "Business Unit": "Shared Services",
            "Full-time/Part-time": "Full Time",
            "Salary Range Min - Max (USD)": "192942-308708",
            "Country": "United States",
            "Date": "22-Jan-2026",
            "Job ID": "5352"
        },
        "link": "https://onecall.avature.net/careers/JobDetail/VP-Data/5352"
    },
    {
        "title": "VP Corporate Accounts",
        "description_html": null,
        "description_text": "General information\nLocation\nRemote\nFunction\nSales\nBusiness Unit\nShared Services\nFull-time/Part-time\nFull Time\nSalary Range Min - Max (USD)\n135700-278300\nCountry\nUnited States\nDate\n27-Jan-2026\nJob ID\n5372\nDescription & Requirements\nJoin Our Team and Make a Difference!\nAre you looking for an impactful role where you finish the workday knowing you helped someone? Whether you are part of our care coordination team or play a supporting role, the work our colleagues do every day enables us to collectively reach our mission of\ngetting people the care they need when they need it.\nBy staying committed to our core values of\nThink Big, Go Fast, Deliver Awe, Win Together and Care Deeply\n,\nwe can positively impact the lives of the injured workers we serve and get them back to the things that matter most in life.\nSalary Range:\nThis compensation range considers a wide range of factors, including, but not limited to, skill set, experience and training, licensure and certifications, and other business and organizational needs. The disclosed range estimate is not adjusted for geographic differential associated with the location where the position may be filled. At One Call, it is not typical for an individual to be hired at or near the top of the range for their role, and compensation decisions are dependent on the facts and circumstances of each case.\nWhat We Provide in Return for Your Commitment to Our Mission\nWe offer a vast array of benefits to help support the whole you, including:\nRemote Work:\nWe are a remote-first company, and almost all positions receive the flexibility of working from home.\nGenerous Time Off:\nBesides 8 company holidays and 2 personal days every year, all colleagues receive a minimum of 18 days of paid time off.\nComprehensive Benefits Package:\nIncluding medical, dental, vision, and pet insurance; 401(k) matching program; and company-paid life insurance and short and long-term disability coverage.\nSupportive Services:\nJust like our colleagues get injured workers the care they need when they need it, we want to do the same for our colleagues in their time of need. We offer a Colleague Assistance Program that provides free counseling and financial services, and our One Call Foundation, a non-profit arm of our company, provides colleagues financial assistance during times of unexpected hardships.\nJOB SUMMARY:\nThe VP of Corporate Accounts serves as the executive leader for the Strategic Account Executive and Account Managers within the Regional Accounts organization. This role provides oversight of the organization’s regional key accounts as well as drives the sales strategy and activities of the strategic account executives who manage this client base. It assists One Call to better understand the client landscape and their priorities to allow the organization to create meaningful solutions and service models that win new business and retain our valued client base.\nESSENTIAL DUTIES & RESPONSIBILITIES:\nPromotes high performance culture while strategically focusing on client growth initiatives, leaning heavily on outside-in customer feedback and data.\nServes as the primary management contact and provides oversight to Corporate Accounts organization in all customer engagement and management activities.\nOversees the processes of monitoring post-implementation client success to ensure pull through of expected revenue opportunities.\nManages processes to define and act on potential areas of opportunity post-implementation (ex. Identify leakage capture strategies, panel elevation opportunities and product extension strategies).\nManages the workflow of the applicable areas of the business unit to achieve goals set forth by the executive leadership team while ensuring the business maintains high levels of customer satisfaction.\nLeads executive strategic plans by setting clearly defined goals with measurable results to ensure successful on-going client engagement, opportunity development and positive customer experience.\nImplements strategic initiatives including communicating goals to business units to allow staff training and communicates and executes executive vision to managers.\nDevelops innovative initiatives to enhance internal efficiency, customer experience, and effectiveness while controlling costs.\nImproves the operational systems, processes and policies in support of organization’s mission.\nDevelops or maintains internal control systems to ensure accountability.\nDetermines needs, identifies growth areas, reduces cost and analyzes improvement areas in accordance with the overall corporate strategy.\nDevelops strong relationships with outside partners, such as key clients. vendors and advisors, as well as internal partners, including department supervisors and co-executives.\nDevelops reporting, reporting tools, processes, and disciplines to deliver the right information to the right areas of the enterprise at the right time.\nEDUCATIONAL AND EXPERIENCE REQUIREMENTS:\nA BS/BA degree from an accredited college/university; MBA or advanced degree in related field of study preferred and/or the equivalent combination of education, training, or work experience.\nESSENTIAL KNOWLEDGE, SKILLS & ABILITIES:\nProven track record in leading teams and driving meaningful client growth. Success in facilitating progressive organizational change and development within a growing organization.\nExcellent communication skills both verbal and written for interpersonal communication and collaborative management, across all sales and company departments.\nStrong knowledge of the Workers Compensations field and experience in organizational effectiveness and implementing best practices.\nDemonstrated leadership and vision in managing staff groups and major projects or initiatives.\nExhibits a high degree of initiative and analytical skills to handle and solve complex problems and thrives in a high production environment.\nViewed as an expert resource by peers and coworkers, maintains a good working relationship with both internal and client management, and has thorough internal working knowledge of the enterprise.\nDemonstrates the ability to lead by example and motivate professional level staff through training and multi-tasking.\nDisplays strong leadership qualities, decision making abilities, and strong business judgment.\nPossesses strong personnel management skills to mentor and coach diverse teams.\nExceptional written, oral, interpersonal, and presentation skills.\nOperates as an effective tactical and strategic leader producing positive and measurable financial and administration results adhering to initiatives. Manages budget development and oversees accounting principles and applications.\nExcels at operating in a fast pace, community environment.\nChallenges and debates issues of importance to the organization.\nExcellent computer skills and proficient in Excel, Word, Outlook, and Access.\nAbility to work in an environment that aligns with the company's diversity, equity, inclusion and belonging standards.\nAbility to work both independently and in a team environment.\nDemonstrate our core values of Think Big, Go Fast, Deliver Awe, Win Together and Care Deeply.\nPHYSICAL/MENTAL DEMANDS & WORK ENVIRONMENT:\nThis position will be performed primarily in the colleague’s home but will also require travel to other sites and include both sedentary and active work.\nWork-from-home requirements include the colleague’s ability to set up computer equipment within their home office.\nThis role requires travel at a minimum of 50% of the time.\nTravel requirements include the colleague’s ability to move between work locations for client meetings and other field work assignments.\nThe colleague must be able to remain in a stationary position, operate a computer and other office equipment, perform repetitive motions, assess information and files stored electronically, converse with customers and exchange accurate information.\nThe colleague must be able to discern text displayed on a monitor and input data into specific fields using a keyboard.\nThe colleague must have the ability to learn new tasks, follow established processes, maintain focus, complete tasks independently, complete multiple tasks simultaneously, communicate professionally with colleagues and customers, and complete tasks in situations that have a speed or productivity requirement.\nThe colleague must be able to manage moderate to significant mental stress as a result of, but not limited to, a dynamic and heavy workload.\nReasonable accommodation will be individually assessed and possibly made to enable individuals with disabilities to perform the essential functions of the position.\nPlease be advised that job descriptions typically change over time as business needs, job requirements, and employee skill levels change. As such, One Call retains the right to change or assign other duties to this position at any time.\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment regardless to race, color, religion, sex, nationality, disability status, protected veteran status, or any other status protected by law.\nGo back\nApply\nFacebook\nLinkedIn\nX\nEmail",
        "application_url": "https://onecall.avature.net/careers/SearchJobs/?folderRecordsPerPage=6&folderOffset=18&jobOffset=18",
        "": {},
        "metadata": {
            "Location": "Remote",
            "Function": "Sales",
            "Business Unit": "Shared Services",
            "Full-time/Part-time": "Full Time",
            "Salary Range Min - Max (USD)": "135700-278300",
            "Country": "United States",
            "Date": "27-Jan-2026",
            "Job ID": "5372"
        },
        "link": "https://onecall.avature.net/careers/JobDetail/VP-Corporate-Accounts/5372"
    }
]