[
    {
        "title": "Advisory Consultant - MSP(3PM - 12AM IST)",
        "description_html": null,
        "description_text": "Advisory Consultant - MSP(3PM - 12AM IST)\nBangalore, India\nJob ID:\n12150\nAre you solution focused with excellent communication skills? Do you enjoy providing data to help drive talent acquisition needs? If so, keep reading!\nPontoon has a need for an Advisory Consultant. This individual would manage our customer’s recruitment needs for their contingent workforce. Pontoon’s Advisory Consultants excel at communication as they have direct interaction with our customers and partners. By utilizing a consultative approach, our Advisory Consultants provide market and industry insight to help influence decision making for our customers. While this role would be an individual contributor, Advisory Consultants often grow into exceptional Program Managers.\nWhat does a day in the life of a Pontoon Advisory Consultant look like?\nYou are the trusted advisor on all workforce solutions for your client, guiding them end to end through the requisition process\nYour partnership includes reviewing current business challenges and needs, guiding decision making on roles and job descriptions, providing insights gained from market intelligence, and creating custom talent acquisition strategies to address each unique challenge\nAs an Advisory Consultant your focus is the client and you will spend most of your time acting as a liaison with key stakeholders, while receiving support from internal colleagues to complete the full lifecycle of talent acquisition\nInternal and external partners will look to you to offer subject matter expertise specific to domain knowledge, industry, contingent labor, etc.\nAt Pontoon, we are customer obsessed. We partner with some of the largest companies in the world to transform their talent strategies. We are game changers who don’t believe in standing still. If you are looking to make an impact and to learn and develop, then Pontoon is the place for you to thrive.\nApply Now",
        "application_url": "https://pontoonsolutions.avature.net/careers/Login?jobId=12150",
        "metadata": {},
        "link": "https://pontoonsolutions.avature.net/careers/JobDetail/Bangalore-India-Advisory-Consultant-MSP-3PM-12AM-IST/12150"
    },
    {
        "title": "Data Support Administrator - US Hours",
        "description_html": null,
        "description_text": "Data Support Administrator - US Hours\nTaguig, Philippines\nJob ID:\n12271\nSUMMARY:\nThe Data Administrator & Support will function as the Vendor Management System Administrator and second level support analyst for Vendor Management Systems (VMS), Applicant Tracking Systems (ATS), Candidate Relationship Management Systems (CRM), digital interviewing, mobile recruitment, sourcing, assessments, and numerous other emerging tech tools. This role is responsible for delivering business as usual VMS administration and best in class technical support service through processing both internal and external inbound calls and support tickets via the Salesforce application.\nGENERAL RESPONSIBILITIES:\nFunctions as second tier front office BAU support channel for processing post-launch configuration and ongoing application maintenance support.\nDocuments, responds, and resolves technical support requests as submitted from internal colleagues, PMO staff, client users, etc.\nAccesses and utilizes the customized knowledge libraries and / or supplemental resource collateral provided to triage and resolve cases.\nManages and performs repetitive data imports for clients and 3rd party vendors. These can include but are not limited to time import, rate card, user, locations, and Job Title/Descriptions.\nMonitors support system integrations/APIs where Pontoon is the responsible party. Oversee run schedule, data load and error handling.\nInterfaces with all related internal Pontoon Shared Support channels as well as the VMS Partner, when applicable,\nAssists Data Engineers with Quality Assurance checks for all data – both uploaded and manual portions of configuration.\nAnswers and processes all technology application support inbound telephone calls and incident case submittals in a timely manner/according to established SLA’s.\nUtilizes Salesforce Ticketing System, Internal Technologies, like CRM software and/or ATS systems, to effectively track cases, detail support activities and manage tasks.\nUtilizes internal Pontoon equipment (i.e. Laptop, Outlook, Lync, MSWord, etc.) to access and deliver support.\nComprehends Vendor Management Systems (VMS) functionality, workflow and dependencies in order to troubleshoot, issue replicate and/or escalate cases for resolve.\nAccesses standardized responses, SOPs, FAQs and processes necessary for case resolution protocol.\nAssesses customers' support needs, then provides resolutions or refers them to other support channels within the organization.\nRotates through different technical specialties and skill sets.\nEscalates issues according to standard escalation process and protocol.\nParticipates in scheduled information sharing and education events to train fellow colleagues.\nWorks to meet all existing SLA’s and to improve overall process by recommending improvements to Supervisor.\nResearches, documents, and escalates Technology Service Representative requests to higher level support departments and or VMS partners, when necessary.\nTrouble-shoots and processes error handling files for integration and data exchange feeds.\nWorks with leads, supervisors, and/or managers to train, mentor, and offer troubleshooting best practices and techniques to Technology Service Representatives.\nManages and prioritizes special projects and performs other duties as assigned.\nSupports various program enablement technologies such as VMS tools, ATS, Internal Pontoon tools.\nProvides governance and back-up support necessary for established efficiency and effectiveness standards regarding customer service factors.\nCreates and maintains the technology support knowledge base, not limited to development of quick reference materials, frequently asked questions, troubleshooting guidelines, etc.\nSupports project lead/channel partner with data staging as applicable to the implementation/project in the areas of UAT, integration testing and solution sign-off.\nONGOING SUPPORT AND MAINTENANCE:\nPerforms data maintenance requests in applicable VMS application. Interfaces with all related internal\nPontoon MSP Solutions teams as well as the field, VMS Tool Company and back office teams.\nVerifies and performs quality assurance on data adjustments upon completion.\nTracks, documents, and communicates data requests, actions taken, issues identified, etc.\nCreates and maintains documentation for all processes, procedures, and policies following set standards.\nProvides technical support for online clients (routine requests and special additional setup issues).\nParticipates in special projects and performs other duties as assigned.\nEDUCATION AND EXPERIENCE REQUIREMENTS:\nHigh School Diploma required. Advanced degree preferred but not required.\nVMS System administration (2 years) in one of the major industry systems. i.e. SAP Fieldglass,Beeline, Coupa SmartTrack, Peoplefluent, Avature, Taleo.\nMinimum of two 2 years’ experience in a customer service environment or equivalent.\nMinimum of two 2 years’ experience utilizing an incident tracking system (i.e. Salesforce, ServiceNow, Contractual, etc) or equivalent.\nExperience with VMS and/or ATS (i.e. SAP Fieldglass, Beeline, IQNavigator, Avature).\nExperience with managing large data sets.\nWith RXO tech experience (ATS and CRM technologies)\nKNOWLEDGE, SKILLS & ABILITIES:\nSkilled in communicating effectively verbally and in writing.\nAbility to establish and maintain effective working relationships.\nKeen attention for detail.\nDatabase experience (i.e. MS Access).\nHighly skilled at time management and decision making.\nDemonstrated experience in maintaining composure and customer focus while troubleshooting.\nFlexibility with work shift/schedule, assigned shift/hours at onsite location based on business needs\nProven customer service abilities –verbal and written communication with keen attention to detail.\nAbility to work in a fast-paced and dynamic environment.\nAbility to interact and communicate within a team environment.\nAdapt swell to changes as products evolve.\nTechnical aptitude and comfort level facilitating business requirements for Web based applications.\nProficient with Microsoft Office products, including Word, Excel, PowerPoint and Outlook.\nApply Now",
        "application_url": "https://pontoonsolutions.avature.net/careers/Login?jobId=12271",
        "metadata": {},
        "link": "https://pontoonsolutions.avature.net/careers/JobDetail/Taguig-Philippines-Data-Support-Administrator-US-Hours/12271"
    },
    {
        "title": "Engagement Coordinator  (US Hours) - IT Recruitment",
        "description_html": null,
        "description_text": "Engagement Coordinator  (US Hours) - IT Recruitment\nTaguig, Philippines\nJob ID:\n12163\nSUMMARY:\nThe Engagement Coordinator provides front-line customer service to internal team members, clients, vendors and users for the various supported Vendor Management Software solutions. Responsible for communicating ongoing issues through the appropriate escalation process and providing timely feedback and responses to the end users. The Engagement Coordinator must work with all parties within Center of Excellence for problem resolution and must provide a professional response and exhibit strong customer service orientation when dealing with all external clients. Responsibilities may include requisition review, entry and maintenance using VMS technology, CM system and other systems as required. Works under general supervision.\nMAIN RESPONSIBILITIES:\nWorking      experience with any VMS Tool.\nResume      Qualifications.\nVendor      management.\nMeet      SLA’s as per the program.\nReporting      to the immediate Manager/Lead at every interval.\nNeed      to be strong with Technology knowledge – Testing, SAP, Oracle, Data and      Analytics and Enterprise architectures.\nEDUCATION AND EXPERIENCE REQUIREMENTS:\nEducation:\nAPAC: Bachelor’s Degree\nExperience:\nHands-on recruitment experience, if in IT minimum 3+ years in recent years, and if not minimum 5+ years’ experience is a must.\nKNOWLEDGE, SKILLS & ABILITIES:\nSkilled in communicating effectively verbally and in writing.\nAbility to establish and maintain effective working relationships through strong customer service skills.\nProven ability to work in a fast-paced and dynamic environment.\nPossess strong attention to detail.\nProficient with Microsoft Office products, such as Word, Excel, PowerPoint and Outlook.\nFlexibility to work in US hours\nApply Now",
        "application_url": "https://pontoonsolutions.avature.net/careers/Login?jobId=12163",
        "metadata": {},
        "link": "https://pontoonsolutions.avature.net/careers/JobDetail/Taguig-Philippines-Engagement-Coordinator-US-Hours-IT-Recruitment/12163"
    },
    {
        "title": "Engagement Coordinator - Rotational Shift - 6 months contract",
        "description_html": null,
        "description_text": "Engagement Coordinator - Rotational Shift - 6 months contract\nBangalore, India\nJob ID:\n12066\nJOB SUMMARY:\nThe Engagement Coordinator provides front-line customer service to internal team members, clients and vendors. You will be responsible for communicating ongoing issues through the appropriate escalation process and providing timely feedback and responses to the end users.\nYou must work with all parties for problem resolution, providing a professional response and exhibit strong customer service orientation when dealing with all external clients. Your main responsibilities are listed below:\nESSENTIAL DUTIES AND RESPONSIBILITIES:\nResponsible for the contractor onboarding process.\nResponds to all inbound telephone calls, ticket requests, and e-mail correspondence in a timely manner/according to SLA’s.\nUses working knowledge of various supported Vendor Management Software to troubleshoot issues.\nUses customized and standardized situational responses and processes to resolve customer issues.\nRecognizes and gathers relevant information on customer issues/scenarios requiring further solutions. Escalates such issues according to standard escalation process.\nMakes recommendations to improve efficiencies where applicable.\nAssists with training of peers in the standards and practices within the Customer Support organization.\nReceives and reviews new requisition requests daily using the VMS tool.\nParticipates in special projects and performs other duties as assigned.\nEDUCATION/EXPERIENCE AND OTHER POSITION REQUIREMENTS:\nWe're looking for candidates with Bachelors Degree.\nIdeally, we would like work experience in recruitment (in-house, RPO, MSP or Core HR)\nYou'll need to be skilled in communicating effectively, both in one-on-one and in group settings\nYou must have the ability to establish and maintain effective working relationships\nWe need someone to work in a fast-paced environment and perform multiple work assignments simultaneously\nYou will possess data entry, analytical, and organizational skills with attention to detail\nProficient with Microsoft Office products, including Word, Excel, PowerPoint and Outlook\nEqual Opportunity Employer M/F/D/V\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law.\nKind attention: Pontoon India does not collect any fee/s from the candidate for recruitment. Pontoon India employees are not allowed or authorized to collect any fee/s from the associates, candidate and client. Selection of candidate/associate is based on defined process, merit and as per the requirement.\nApply Now",
        "application_url": "https://pontoonsolutions.avature.net/careers/Login?jobId=12066",
        "metadata": {},
        "link": "https://pontoonsolutions.avature.net/careers/JobDetail/Bangalore-India-Engagement-Coordinator-Rotational-Shift-6-months-contract/12066"
    },
    {
        "title": "Engagement Coordinator - US Hours (MSP Operations)",
        "description_html": null,
        "description_text": "Engagement Coordinator - US Hours (MSP Operations)\nVirtual, Philippines\nJob ID:\n12161\nJOB SUMMARY:\nThe Engagement Coordinator provides front-line customer service to internal team members, clients and vendors. You will be responsible for communicating ongoing issues through the appropriate escalation process and providing timely feedback and responses to the end users.\nYou must work with all parties for problem resolution, providing a professional response and exhibit strong customer service orientation when dealing with all external clients. Your main responsibilities are listed below:\nESSENTIAL DUTIES AND RESPONSIBILITIES:\nResponsible for the contractor onboarding process.\nResponds to all inbound telephone calls, ticket requests, and e-mail correspondence in a timely manner/according to SLA’s.\nUses working knowledge of various supported Vendor Management Software to troubleshoot issues.\nUses customized and standardized situational responses and processes to resolve customer issues.\nRecognizes and gathers relevant information on customer issues/scenarios requiring further solutions. Escalates such issues according to standard escalation process.\nMakes recommendations to improve efficiencies where applicable.\nAssists with training of peers in the standards and practices within the Customer Support organization.\nReceives and reviews new requisition requests daily using the VMS tool.\nParticipates in special projects and performs other duties as assigned.\nEDUCATION/EXPERIENCE AND OTHER POSITION REQUIREMENTS:\nWe're looking for candidates with Bachelors Degree.\nIdeally, we would like work experience in recruitment (in-house, RPO, MSP or Core HR)\nYou'll need to be skilled in communicating effectively, both in one-on-one and in group settings\nYou must have the ability to establish and maintain effective working relationships\nWe need someone to work in a fast-paced environment and perform multiple work assignments simultaneously\nYou will possess data entry, analytical, and organizational skills with attention to detail\nProficient with Microsoft Office products, including Word, Excel, PowerPoint and Outlook\nEqual Opportunity Employer M/F/D/V\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law.\nApply Now",
        "application_url": "https://pontoonsolutions.avature.net/careers/Login?jobId=12161",
        "metadata": {},
        "link": "https://pontoonsolutions.avature.net/careers/JobDetail/Virtual-Philippines-Engagement-Coordinator-US-Hours-MSP-Operations/12161"
    },
    {
        "title": "Engagement Coordinator (US Hours) - Fixed-term Contract 5 Months",
        "description_html": null,
        "description_text": "Engagement Coordinator (US Hours) - Fixed-term Contract 5 Months\nTaguig, Philippines\nJob ID:\n12120\nJOB SUMMARY:\nThe Engagement Coordinator provides front-line customer service to internal team members, clients and vendors. You will be responsible for communicating ongoing issues through the appropriate escalation process and providing timely feedback and responses to the end users.\nYou must work with all parties for problem resolution, providing a professional response and exhibit strong customer service orientation when dealing with all external clients. Your main responsibilities are listed below:\nESSENTIAL DUTIES AND RESPONSIBILITIES:\nResponsible for the contractor onboarding process.\nResponds to all inbound telephone calls, ticket requests, and e-mail correspondence in a timely manner/according to SLA’s.\nUses working knowledge of various supported Vendor Management Software to troubleshoot issues.\nUses customized and standardized situational responses and processes to resolve customer issues.\nRecognizes and gathers relevant information on customer issues/scenarios requiring further solutions. Escalates such issues according to standard escalation process.\nMakes recommendations to improve efficiencies where applicable.\nAssists with training of peers in the standards and practices within the Customer Support organization.\nReceives and reviews new requisition requests daily using the VMS tool.\nParticipates in special projects and performs other duties as assigned.\nEDUCATION/EXPERIENCE AND OTHER POSITION REQUIREMENTS:\nWe're looking for candidates with Bachelors Degree.\nIdeally, we would like work experience in recruitment (in-house, RPO, MSP or Core HR)\nYou'll need to be skilled in communicating effectively, both in one-on-one and in group settings\nYou must have the ability to establish and maintain effective working relationships\nWe need someone to work in a fast-paced environment and perform multiple work assignments simultaneously\nYou will possess data entry, analytical, and organizational skills with attention to detail\nProficient with Microsoft Office products, including Word, Excel, PowerPoint and Outlook\nEqual Opportunity Employer M/F/D/V\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law.\nApply Now",
        "application_url": "https://pontoonsolutions.avature.net/careers/Login?jobId=12120",
        "metadata": {},
        "link": "https://pontoonsolutions.avature.net/careers/JobDetail/Taguig-Philippines-Engagement-Coordinator-US-Hours-Fixed-term-Contract-5-Months/12120"
    },
    {
        "title": "Engagement Coordinator MSP - US Hours",
        "description_html": null,
        "description_text": "Engagement Coordinator MSP - US Hours\nBangalore, India\nJob ID:\n11897\nJOB SUMMARY:\nThe Engagement Coordinator provides front-line customer service to internal team members, clients and vendors. You will be responsible for communicating ongoing issues through the appropriate escalation process and providing timely feedback and responses to the end users.\nYou must work with all parties for problem resolution, providing a professional response and exhibit strong customer service orientation when dealing with all external clients. Your main responsibilities are listed below:\nESSENTIAL DUTIES AND RESPONSIBILITIES:\nResponsible for the contractor onboarding process.\nResponds to all inbound telephone calls, ticket requests, and e-mail correspondence in a timely manner/according to SLA’s.\nUses working knowledge of various supported Vendor Management Software to troubleshoot issues.\nUses customized and standardized situational responses and processes to resolve customer issues.\nRecognizes and gathers relevant information on customer issues/scenarios requiring further solutions. Escalates such issues according to standard escalation process.\nMakes recommendations to improve efficiencies where applicable.\nAssists with training of peers in the standards and practices within the Customer Support organization.\nReceives and reviews new requisition requests daily using the VMS tool.\nParticipates in special projects and performs other duties as assigned.\nEDUCATION/EXPERIENCE AND OTHER POSITION REQUIREMENTS:\nWe're looking for candidates with Bachelors Degree.\nIdeally, we would like work experience in recruitment (in-house, RPO, MSP or Core HR)\nYou'll need to be skilled in communicating effectively, both in one-on-one and in group settings\nYou must have the ability to establish and maintain effective working relationships\nWe need someone to work in a fast-paced environment and perform multiple work assignments simultaneously\nYou will possess data entry, analytical, and organizational skills with attention to detail\nProficient with Microsoft Office products, including Word, Excel, PowerPoint and Outlook\nFind out more\nReady to raise the talent bar? Find out how fast and how far Pontoon can take you – connect with our Talent Acquisition Partner, Joanne on joanne.villanueva@pontoonsolutions.com\nEqual Opportunity Employer M/F/D/V\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law.\nKind attention: Pontoon India does not collect any fee/s from the candidate for recruitment. Pontoon India employees are not allowed or authorized to collect any fee/s from the associates, candidate and client. Selection of candidate/associate is based on defined process, merit and as per the requirement.\nApply Now",
        "application_url": "https://pontoonsolutions.avature.net/careers/Login?jobId=11897",
        "metadata": {},
        "link": "https://pontoonsolutions.avature.net/careers/JobDetail/Bangalore-India-Engagement-Coordinator-MSP-US-Hours/11897"
    },
    {
        "title": "Engagement Coordinator- MSP (3PM IST - 12AM IST)",
        "description_html": null,
        "description_text": "Engagement Coordinator- MSP (3PM IST - 12AM IST)\nBangalore, India\nJob ID:\n10891\nSUMMARY:\nThe Engagement Coordinator provides front-line customer service to internal team members, clients, vendors and users for the various supported Vendor Management Software solutions. Responsible for communicating ongoing issues through the appropriate escalation process and providing timely feedback and responses to the end users. The Engagement Coordinator must work with all parties within Center of Excellence for problem resolution and must provide a professional response and exhibit strong customer service orientation when dealing with all external clients. Responsibilities may include requisition review, and maintenance using VMS technology, and other systems as required. Works under general supervision.\nGENERAL RESPONSIBILITIES:\nResponsible for the contractor onboarding process.\nValidates client onboarding documents to ensure compliance.\nServes as a primary point of contact for multiple vendors to facilitate onboarding.\nBuild strong relationships with all stake holders. (Client, Suppliers and Internal Team)\nResponsible to ensure that the vendors are following the client guidelines for onboarding.\nResponds and answers all inbound telephone calls, ticket requests, and e-mail correspondence in a timely manner/according to SLA’s.\nRespond to Various partners via phone call/ Emails or any other mode suggested by management.\nSupports the business as backup when the team members are on leave.\nUses customized and standardized situational responses and processes to resolve customer issues.\nRecognizes and gathers relevant information on customer issues/scenarios requiring further solutions. Escalates such issues according to standard escalation process.\nMakes recommendations to improve efficiencies where applicable.\nWorks to meet all contracted SLA’s and works to improve overall process by recommending improvements to Advisory Consultant and/or Program Manager.\nDocuments and escalates all contacts reported by users following Customer Support standard operating procedure.\nMaintains and continually increases knowledge of supported software solutions.\nAssists with training of peers in the standards and practices within the Customer Support organization.\nReceives and reviews new onboarding requests daily using the VMS tool.\nUpdates and maintains records of all the onboarding information to organize and prioritize work.\nMaintains thorough and accurate documentation on any end user interactions.\nParticipates in special projects and performs other duties as assigned.\nEDUCATION AND EXPERIENCE REQUIREMENTS:\nEducation: Bachelor’s Degree\nExperience:\nMinimum of two (2) years’ work experience in a service level industry and/or one (1) to three (3) years’ experience in a customer service environment or equivalent.\nKNOWLEDGE, SKILLS & ABILITIES:\nSkilled in communicating effectively verbally and in writing.\nAbility to establish and maintain effective working relationships through strong customer service skills.\nProven ability to work in a fast-paced and dynamic environment.\nPossess strong attention to detail.\nProficient with Microsoft Office products, such as Word, Excel, PowerPoint and Outlook.\nApply Now",
        "application_url": "https://pontoonsolutions.avature.net/careers/Login?jobId=10891",
        "metadata": {},
        "link": "https://pontoonsolutions.avature.net/careers/JobDetail/Bangalore-India-Engagement-Coordinator-MSP-3PM-IST-12AM-IST/10891"
    },
    {
        "title": "Engagement Specialist - (8PM - 4:30AM IST)",
        "description_html": null,
        "description_text": "Engagement Specialist - (8PM - 4:30AM IST)\nBangalore, India\nJob ID:\n11939\nJOB SUMMARY:\nThe Engagement Coordinator provides front-line customer service to internal team members, clients and vendors. You will be responsible for communicating ongoing issues through the appropriate escalation process and providing timely feedback and responses to the end users.\nYou must work with all parties for problem resolution, providing a professional response and exhibit strong customer service orientation when dealing with all external clients. Your main responsibilities are listed below:\nESSENTIAL DUTIES AND RESPONSIBILITIES:\nResponsible for the contractor onboarding process.\nResponds to all inbound telephone calls, ticket requests, and e-mail correspondence in a timely manner/according to SLA’s.\nUses working knowledge of various supported Vendor Management Software to troubleshoot issues.\nUses customized and standardized situational responses and processes to resolve customer issues.\nRecognizes and gathers relevant information on customer issues/scenarios requiring further solutions. Escalates such issues according to standard escalation process.\nMakes recommendations to improve efficiencies where applicable.\nAssists with training of peers in the standards and practices within the Customer Support organization.\nReceives and reviews new requisition requests daily using the VMS tool.\nParticipates in special projects and performs other duties as assigned.\nEDUCATION/EXPERIENCE AND OTHER POSITION REQUIREMENTS:\nWe're looking for candidates with Bachelors Degree.\nIdeally, we would like work experience in recruitment (in-house, RPO, MSP or Core HR)\nYou'll need to be skilled in communicating effectively, both in one-on-one and in group settings\nYou must have the ability to establish and maintain effective working relationships\nWe need someone to work in a fast-paced environment and perform multiple work assignments simultaneously\nYou will possess data entry, analytical, and organizational skills with attention to detail\nProficient with Microsoft Office products, including Word, Excel, PowerPoint and Outlook\nFind out more\nReady to raise the talent bar? Find out how fast and how far Pontoon can take you – connect with our Talent Acquisition Partner, Joanne on joanne.villanueva@pontoonsolutions.com\nEqual Opportunity Employer M/F/D/V\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law.\nKind attention: Pontoon India does not collect any fee/s from the candidate for recruitment. Pontoon India employees are not allowed or authorized to collect any fee/s from the associates, candidate and client. Selection of candidate/associate is based on defined process, merit and as per the requirement.\nApply Now",
        "application_url": "https://pontoonsolutions.avature.net/careers/Login?jobId=11939",
        "metadata": {},
        "link": "https://pontoonsolutions.avature.net/careers/JobDetail/Bangalore-India-Engagement-Specialist-8PM-4-30AM-IST/11939"
    },
    {
        "title": "Lead Sourcer",
        "description_html": null,
        "description_text": "Lead Sourcer\nBangalore, India\nJob ID:\n11635\nDo you lead by example? Can you juggle multiple tasks while working in complex systems? Well, then it just so happens that Pontoon is looking for someone to lead a team of unique individuals.\nAs a Lead Sourcer you will be tasked with overseeing the ongoing sourcing activities of your team. You will collaborate with other team leads across the business to stay abreast of current candidate flow issues that relate to sourcing. At times you will responsible for delegating tasks while also being ready to lend a helping hand when needed. So, all those great leadership qualities you have will be of huge benefit here. If you are skilled at maintaining the balance of a team and contributing to our customer’s best interests, we want to hear from you!\nWhat does a day in the life of a Pontoon Lead Sourcer look like?\nSupervising two or more Sourcers, directing their efforts to identify and attract top tier candidates, as well as ensuring they are trained, coached, and developed\nCreating, updating, improving, and overseeing adherence to standard operating procedures\nUtilizing data and metrics to evaluate current initiatives, strategies, pipelines, tools, technologies, job boards, etc. and identifying, recommending, and developing best practices and solutions\nDeveloping strong relationships with internal and external stakeholders and acting as the main point of contact for escalations\nEach role will require its own sourcing strategy, so it’s up to you to drive creativity with marketing content, including postings, email campaigns, and flyers!\nAt Pontoon we are customer obsessed. We partner with some of the largest companies in the world to transform their talent strategies. We are game changers who don’t believe in standing still. If you are looking to make an impact and to learn and develop, then Pontoon is the place for you to thrive.\nApply Now",
        "application_url": "https://pontoonsolutions.avature.net/careers/Login?jobId=11635",
        "metadata": {},
        "link": "https://pontoonsolutions.avature.net/careers/JobDetail/Bangalore-India-Lead-Sourcer/11635"
    },
    {
        "title": "Recruitment Coordinator - 11AM to 7:30PM Manila",
        "description_html": null,
        "description_text": "Recruitment Coordinator - 11AM to 7:30PM Manila\nTaguig, Philippines\nJob ID:\n11638\nWere you labeled as most likely to have an organizing show on Netflix? Do you have a color-coded schedule and zero emails in your inbox? Are you everyone’s go-to for planning and coordinating events?  If this sounds like you, then you need to look at this opportunity!\nPontoon needs a person just like you who enjoys taking on administrative tasks and running with them. Someone who is quick thinking, detail oriented and appreciates keeping matters in order. You will be a collaborator who can approach tasks with a sense of urgency not only to support your team members but the customer as well.\nWhat does a day in the life of a Recruitment Coordinator look like?\nYou’re the “right hand” of our recruiting and human resources teams, providing administrative support on items such as: initiating requisitions, facilitating approvals, scheduling candidate interviews, and administering candidate assessments and pre-screens.\nData entry must also be tops on your list as you’ll be responsible for entering and tracking candidate data and running reports.\nOnce we have the candidate identified you will also administer pre-employment activities, including, but not limited to: coordinating forms, applications, offer letters and expense reports, drug testing, background and reference checks, and security clearance validation.\nAt Pontoon we are customer obsessed. We partner with some of the largest companies in the world to transform their talent strategies. We are game changers who don’t believe in standing still. If you are looking to make an impact and to learn and develop, then Pontoon is the place for you to thrive.\nReady to ignite your potential? What are you waiting for? More details can be found here.\nApply Now",
        "application_url": "https://pontoonsolutions.avature.net/careers/Login?jobId=11638",
        "metadata": {},
        "link": "https://pontoonsolutions.avature.net/careers/JobDetail/Taguig-Philippines-Recruitment-Coordinator-11AM-to-7-30PM-Manila/11638"
    },
    {
        "title": "Senior IT Recruitment Specialist",
        "description_html": null,
        "description_text": "Senior IT Recruitment Specialist\nWarsaw, Poland\nJob ID:\n11345\nSenior IT Recruitment Specialist\nLocation: Warszawa\nSenior IT Recruitment Specialist contributes by attracting, sourcing and recruiting diverse pools of top IT talent for current and future organizational needs (Permanent Placement & IT Contracting).\nResponsibilities:\nConduct recruitment activities for IT positions (e2e) including candidate sourcing, resume screening, phone screening, and on-line interviews;\nEnsure applicants match experience with specific job-related requirements;\nProactively source, identify, and recruit passive candidates utilizing a variety of sourcing methods such as networking and internet recruiting to build strong, timely pipelines for open positions;\nNegotiate and prepare employment offers;\nBuilding relationships with candidates.\nRequirements:\n3+ years of experience in recruitment area;\nExperience with various interview formats, including phone screening calls, on-line interviews, etc.;\nExperience evaluating IT candidates;\nExcellent communication and relationship-building skills;\nSolid organizational and time-management abilities;\nEnglish: B2.\nWe offer:\nLong-term & stable cooperation (Contract of Employment);\nProfessional development and support of Adecco’s Consultants and experienced Managers;\nEnhance your expertise in the IT area;\nOffice in the heart of Warsaw (Plac Europejski 2); hybrid model;\nMedical, Insurance & Multisport Package;\nTrainings & Webinars.\nApply Now",
        "application_url": "https://pontoonsolutions.avature.net/careers/Login?jobId=11345",
        "metadata": {},
        "link": "https://pontoonsolutions.avature.net/careers/JobDetail/Warsaw-Poland-Senior-IT-Recruitment-Specialist/11345"
    },
    {
        "title": "Senior/Consultant Professional Recruitment",
        "description_html": null,
        "description_text": "Senior/Consultant Professional Recruitment\nWroclaw, Poland\nJob ID:\n11355\nSenior/Consultant Professional Recruitment\nLocation: Wroclaw\nSenior Recruitment Consultant contributes by attracting, sourcing and recruiting diverse pools of top talent for current and future organizational needs.\nResponsibilities:\nConduct recruitment activities for positions (e2e) including candidate sourcing, resume screening, phone screening, and on-line interviews;\nEnsure applicants match experience with specific job-related requirements;\nProactively source, identify, and recruit passive candidates utilizing a variety of sourcing methods such as networking and internet recruiting to build strong, timely pipelines for open positions;\nNegotiate and prepare employment offers;\nBuilding relationships with candidates;\nParticipation in marketing / business events;\nConducting telephone sales of the company's services to prospect and existing clients.\nRequirements:\n3+ years of experience in recruitment area;\nExperience with various interview formats, including phone screening calls, on-line interviews, etc.;\nExperience evaluating candidates;\nExcellent communication and relationship-building skills;\nSolid organizational and time-management abilities;\nEnglish: B2.\nWe offer:\nLong-term & stable cooperation (Contract of Employment);\nProfessional development and support of Adecco’s Consultants and experienced Managers;\nEnhance your expertise in various recruitment areas;\nOffice in the heart of Warsaw (Plac Europejski 2); hybrid model;\nMedical, Insurance & Multisport Package;\nTrainings & Webinars.\nApply Now",
        "application_url": "https://pontoonsolutions.avature.net/careers/Login?jobId=11355",
        "metadata": {},
        "link": "https://pontoonsolutions.avature.net/careers/JobDetail/Wroclaw-Poland-Senior-Consultant-Professional-Recruitment/11355"
    },
    {
        "title": "Senior/Consultant Professional Recruitment",
        "description_html": null,
        "description_text": "Senior/Consultant Professional Recruitment\nWarsaw, Poland\nJob ID:\n11344\nSenior/Consultant Professional Recruitment\nLocation: Warszawa\nSenior Recruitment Consultant contributes by attracting, sourcing and recruiting diverse pools of top talent for current and future organizational needs.\nResponsibilities:\nConduct recruitment activities for positions (e2e) including candidate sourcing, resume screening, phone screening, and on-line interviews;\nEnsure applicants match experience with specific job-related requirements;\nProactively source, identify, and recruit passive candidates utilizing a variety of sourcing methods such as networking and internet recruiting to build strong, timely pipelines for open positions;\nNegotiate and prepare employment offers;\nBuilding relationships with candidates;\nParticipation in marketing / business events;\nConducting telephone sales of the company's services to prospect and existing clients.\nRequirements:\n3+ years of experience in recruitment area;\nExperience with various interview formats, including phone screening calls, on-line interviews, etc.;\nExperience evaluating candidates;\nExcellent communication and relationship-building skills;\nSolid organizational and time-management abilities;\nEnglish: B2.\nWe offer:\nLong-term & stable cooperation (Contract of Employment);\nProfessional development and support of Adecco’s Consultants and experienced Managers;\nEnhance your expertise in various recruitment areas;\nOffice in the heart of Warsaw (Plac Europejski 2); hybrid model;\nMedical, Insurance & Multisport Package;\nTrainings & Webinars.\nApply Now",
        "application_url": "https://pontoonsolutions.avature.net/careers/Login?jobId=11344",
        "metadata": {},
        "link": "https://pontoonsolutions.avature.net/careers/JobDetail/Warsaw-Poland-Senior-Consultant-Professional-Recruitment/11344"
    },
    {
        "title": "Sourcer",
        "description_html": null,
        "description_text": "Sourcer\nBangalore, India\nJob ID:\n12182\nAs a Sourcer, you know that you need to come up with fresh ideas in order to drive candidate flow in the full lifecycle recruiting process. You also know that customer service is key to successfully supporting your customers and attracting top talent.\nPontoon is looking for someone who can bring a new outlook to candidate attraction. As a part of the sourcing team, you will be tasked with communication and outreach to create a candidate funnel. Your top priority will be marketing to top talent and searching for ideal candidates for our clients. The ideal Sourcer is confident in data mining, social media campaigns, and advertisements. The Sourcer is a vital part of the talent acquisition process because they are our front line of defense when it comes to producing quality candidates for our clients.  Are you up for this task?\nWhat does a day in the life of a Pontoon Sourcer look like?\nEach role will require its own sourcing strategy, so it’s up to you to get creative with marketing content, including postings, email campaigns, and flyers!\nBeing a job board and sourcing tool wizard as you leverage these platforms to post approved requisitions, identify and attract talent, and build your pipeline\nDeveloping research skills using Boolean searches and leveraging relevant media and communication channels\nUtilizing data and metrics to evaluate current initiatives, strategies, pipelines, tools, technologies, job boards, etc. and identify, recommend, and develop best practices\nDaily interaction with your recruiting team as well as hiring managers and candidates\nAt Pontoon we are customer obsessed. We partner with some of the largest companies in the world to transform their talent strategies. We are game changers who don’t believe in standing still. If you are looking to make an impact and to learn and develop, then Pontoon is the place for you to thrive.\nSo are looking for a company that not only caters to its clients but its employees as well? Then Pontoon is waiting for candidates like you! Click here to find out more.\nApply Now",
        "application_url": "https://pontoonsolutions.avature.net/careers/Login?jobId=12182",
        "metadata": {},
        "link": "https://pontoonsolutions.avature.net/careers/JobDetail/Bangalore-India-Sourcer/12182"
    },
    {
        "title": "Sourcer",
        "description_html": null,
        "description_text": "Sourcer\nPune, India\nJob ID:\n12137\nAs a Sourcer, you know that you need to come up with fresh ideas in order to drive candidate flow in the full lifecycle recruiting process. You also know that customer service is key to successfully supporting your customers and attracting top talent.\nPontoon is looking for someone who can bring a new outlook to candidate attraction. As a part of the sourcing team, you will be tasked with communication and outreach to create a candidate funnel. Your top priority will be marketing to top talent and searching for ideal candidates for our clients. The ideal Sourcer is confident in data mining, social media campaigns, and advertisements. The Sourcer is a vital part of the talent acquisition process because they are our front line of defense when it comes to producing quality candidates for our clients.  Are you up for this task?\nWhat does a day in the life of a Pontoon Sourcer look like?\nEach role will require its own sourcing strategy, so it’s up to you to get creative with marketing content, including postings, email campaigns, and flyers!\nBeing a job board and sourcing tool wizard as you leverage these platforms to post approved requisitions, identify and attract talent, and build your pipeline\nDeveloping research skills using Boolean searches and leveraging relevant media and communication channels\nUtilizing data and metrics to evaluate current initiatives, strategies, pipelines, tools, technologies, job boards, etc. and identify, recommend, and develop best practices\nDaily interaction with your recruiting team as well as hiring managers and candidates\nAt Pontoon we are customer obsessed. We partner with some of the largest companies in the world to transform their talent strategies. We are game changers who don’t believe in standing still. If you are looking to make an impact and to learn and develop, then Pontoon is the place for you to thrive.\nSo are looking for a company that not only caters to its clients but its employees as well? Then Pontoon is waiting for candidates like you! Click here to find out more.\nApply Now",
        "application_url": "https://pontoonsolutions.avature.net/careers/Login?jobId=12137",
        "metadata": {},
        "link": "https://pontoonsolutions.avature.net/careers/JobDetail/Pune-India-Sourcer/12137"
    },
    {
        "title": "Sourcer",
        "description_html": null,
        "description_text": "Sourcer\nBangalore, India\nJob ID:\n11636\nAs a Sourcer, you know that you need to come up with fresh ideas in order to drive candidate flow in the full lifecycle recruiting process. You also know that customer service is key to successfully supporting your customers and attracting top talent.\nPontoon is looking for someone who can bring a new outlook to candidate attraction. As a part of the sourcing team, you will be tasked with communication and outreach to create a candidate funnel. Your top priority will be marketing to top talent and searching for ideal candidates for our clients. The ideal Sourcer is confident in data mining, social media campaigns, and advertisements. The Sourcer is a vital part of the talent acquisition process because they are our front line of defense when it comes to producing quality candidates for our clients.  Are you up for this task?\nWhat does a day in the life of a Pontoon Sourcer look like?\nEach role will require its own sourcing strategy, so it’s up to you to get creative with marketing content, including postings, email campaigns, and flyers!\nBeing a job board and sourcing tool wizard as you leverage these platforms to post approved requisitions, identify and attract talent, and build your pipeline\nDeveloping research skills using Boolean searches and leveraging relevant media and communication channels\nUtilizing data and metrics to evaluate current initiatives, strategies, pipelines, tools, technologies, job boards, etc. and identify, recommend, and develop best practices\nDaily interaction with your recruiting team as well as hiring managers and candidates\nAt Pontoon we are customer obsessed. We partner with some of the largest companies in the world to transform their talent strategies. We are game changers who don’t believe in standing still. If you are looking to make an impact and to learn and develop, then Pontoon is the place for you to thrive.\nSo are looking for a company that not only caters to its clients but its employees as well? Then Pontoon is waiting for candidates like you! Click here to find out more.\nApply Now",
        "application_url": "https://pontoonsolutions.avature.net/careers/Login?jobId=11636",
        "metadata": {},
        "link": "https://pontoonsolutions.avature.net/careers/JobDetail/Bangalore-India-Sourcer/11636"
    },
    {
        "title": "Sourcer - MSP (3PM - 12AM IST)",
        "description_html": null,
        "description_text": "Sourcer - MSP (3PM - 12AM IST)\nBangalore, India\nJob ID:\n12165\nIf you're the sort of person who obsesses about high levels of customer service and is passionate about managing key HR activities, then we have a role for you!\nPontoon is looking for an Sourcer who can competently manage the day-to-day HR operations. Someone who is easy to do business with and capable of resolving challenging issues.  Someone who is also a data entry whiz and can expertly and accurately maintain vendor information systems.\nWhat does a day in the life of a Pontoon Engagement Coordinator look like?\nAn Engagement Coordinator is a wizard on admin tasks and data entry. You are responsible for our contactor onboarding process and will spend much of your time responding to inquiries, making assignment updates and changes, answering questions or concerns on invoices and timesheets, working on visa letter requests and coordinating general reporting requests, among other   administrative and data entry activities.\nYou will experience a high volume of calls, tickets, and emails that require responses according to client SLAs, so being a great communicator who works with a sense of urgency and accuracy is the recipe to success.\nYou’ll spend much of your day in Vendor Management technology and will be a subject matter expert for both your team and the client before you know it!\nAt Pontoon, we are customer obsessed. We partner with some of the largest companies in the world, to transform their talent strategy. We are game changers who don’t believe in standing still.  If you are looking to make an impact and to learn and develop, then Pontoon is the place for you to thrive.\nApply Now",
        "application_url": "https://pontoonsolutions.avature.net/careers/Login?jobId=12165",
        "metadata": {},
        "link": "https://pontoonsolutions.avature.net/careers/JobDetail/Bangalore-India-Sourcer-MSP-3PM-12AM-IST/12165"
    },
    {
        "title": "Sourcing and Engagement Lead",
        "description_html": null,
        "description_text": "Sourcing and Engagement Lead\nBangalore, India\nJob ID:\n12219\nSUMMARY:\nThe Sourcing and Engagement Lead oversees the North American coordinating team and provides front\n‐\nline customer service and escalation support. This role is responsible for addressing and communicating ongoing issues through the appropriate escalation process and providing timely feedback and responses to end users. Responsible for driving client and internally owned projects and initiatives, proposition solutions and building execution plans.\nThis role assumes responsibility for case review, entry and maintenance with the VMS technology. Partners with all parties for problem resolution and provides a professional response exhibiting strong customer service orientation when dealing with all partners. The lead is responsible for supervising the team to ensure work is managed in an efficient, effective and timely manner while meeting/exceeding SLA’s.\nGENERAL RESPONSIBILITIES:\nResponsible for all people management, coaching and development, training, and other applicable responsibilities.\nSatisfies quality metrics that are established for the program and ensures supplier adherence to quality standards and compliance requirements.\nResponsible for maintaining team members accountable to SLAs, client delivery, and other performance goals.\nResolves escalated customer issues that are not being solved by team or where customer escalates.\nIdentifies solutions to ongoing or repetitive issues.\nPartners with client on projects and initiatives in ongoing business operations.\nGenerates and audits reports for operational monitoring.\nClosely monitors execution of Program Consultants & Coordinators to responsibilities/assigned tasks, ensuring program is achieving/exceeding predetermined company targets and SLA’s.\nProvides on\n‐\ngoing training to team as individual professional and/or business needs dictate.\nAssists with training of new team members on standards and practices so that required tasks, both existing and future, can be effectively executed.\nParticipates in special projects and performs other duties as assigned.\nEDUCATION & JOB REQUIREMENTS:\nSignificant experience in the customer service level industry and a proven track record measured by increased responsibilities.\nPrevious people management experience.\nPrevious account management experiences preferred but not required.\nPrevious staffing and recruiting experience preferred but not required.\nMulti-country/region experience preferred but not required.\nLean Six Sigma: Green Belt preferred but not required.\nKNOWLEDGE, SKILLS & ABILITIES:\nSkilled in communicating effectively verbally and in writing.\nAbility to establish and maintain effective working relationships.\nAbility to think critically, make judgements in ambiguity and enjoy problem solving.\nStrong client management capabilities, building rapport and confidence.\nProficient with Microsoft Office products, including Word, Excel, PowerPoint and Outlook.\nApply Now",
        "application_url": "https://pontoonsolutions.avature.net/careers/Login?jobId=12219",
        "metadata": {},
        "link": "https://pontoonsolutions.avature.net/careers/JobDetail/Bangalore-India-Sourcing-and-Engagement-Lead/12219"
    },
    {
        "title": "Sr Specialty Recruiter",
        "description_html": null,
        "description_text": "Sr Specialty Recruiter\nBangalore, India\nJob ID:\n11633\nSUMMARY:\nThe Senior Specialty Recruiter is accountable for the recruitment for one or more clients, with a focus on meeting and/or exceeding performance expectations as identified by Service Level Agreements (SLAs) and ensuring a positive and efficient experience for prospective candidates and our clients. Serves as primary point of contact for the requisition and maintains healthy relationships with hiring managers and candidates. Drives requisition health and candidate flow, creating added value to achieve client strategy. Typically, responsible for one or more client accounts with requisitions that cover various roles and skillsets, including specialized or niche\nroles, as defined by the client.\nGENERAL RESPONSIBILITIES:\nDetermines or is provided with staffing needs of one or more clients and identifies, engages and recruits qualified candidates from the candidate pipeline.\nAnalyzes client requirements and qualifies candidates by conducting telephone and/or face-to-face interviews according to identified qualification standards.\nSelects candidates using discretion and independent judgement and prepares and delivers candidate presentations for clients.\nEnters and tracks candidate data in various electronic systems and runs standard reports as required.\nMaintains effective, ongoing relationships with candidates throughout the recruitment process, in addition to candidates who are in between assignments.\nFields moderately complex to complex inquiries from candidates and hiring managers; escalates\ninquiries to senior team members and/or management as necessary.\nResolves issues with client(s), utilizing a defined escalation matrix.\nCoordinates logistics for recruiting events, such as job fairs, open houses, and invitation-only events.\nIdentifies areas of potential optimization, shares with management, and assists with developing solutions.\nCollaborates with team members to develop and maintain a unified approach to talent sourcing and recruitment.\nTrains and provides guidance on industry best practices, as well as client-specific needs and expectations, to less experienced team members.\nProactively establishes and maintains beneficial business relationships through networking with industry contacts, association members, trade groups, employment groups and/or social media.\nMay initiate requisitions and/or assist with facilitating appropriate approvals for requisitions.\nMay schedule candidates for telephone and/or face-to-face interviews and orientations.\nMay administer pre-employment activities, including, but not limited to, coordinating forms,\napplications, offer letters and expense reports, drug testing, background and reference checks, and security clearance validation.\nMay coordinate the preparation of and/or assist with the distribution of new hire informational packets.\nMay audit candidate files to ensure required records are completed and entered in the appropriate electronic systems.\nParticipates in special projects and performs other duties as assigned.\nEDUCATION & JOB REQUIREMENTS:\nEducation:\nAPAC: Bachelor’s Degree\nExperience:\nMinimum four (4) years of agency and/or corporate recruiting experience.\nPrevious experience utilizing Applicant Tracking Systems (ATS) and/or Human Resources Information\nSystems (HRIS) is preferred.\nKNOWLEDGE, SKILLS & ABILITIES:\nSkilled in communicating effectively verbally and in writing.\nAbility to establish and maintain effective working relationships.\nAbility to prioritize, organize and perform multiple work assignments simultaneously while meeting assigned deadlines.\nAbility to maintain confidentiality and handle highly sensitive/confidential information.\nAbility to function effectively with or as part of a team.\nAbility to demonstrate critical thinking based on in-depth data, substantiating information,\nconsidering/respecting of other's input, personal values and ethics.\nAbility to demonstrate effective customer services skills.\nAbility to utilize market research tools and techniques.\nAbility to identify and/or document existing and new trends as well as evaluate and predict their impact on the organization.\nAbility to understand, interpret and apply related federal, state, and local laws, rules and regulations.\nKnowledge of and the ability to apply the principles, best practices, and standards of recruiting.\nAdvanced proficiency with electronic recruiting resources, such as customer relationship management (CRM) tools, applicant tracking systems (ATS), and job boards.\nProficient with Microsoft Office products, such as Word, Excel, PowerPoint, and Outlook.\nApply Now",
        "application_url": "https://pontoonsolutions.avature.net/careers/Login?jobId=11633",
        "metadata": {},
        "link": "https://pontoonsolutions.avature.net/careers/JobDetail/Bangalore-India-Sr-Specialty-Recruiter/11633"
    },
    {
        "title": "Supplier Operations Advisor",
        "description_html": null,
        "description_text": "Supplier Operations Advisor\nVirtual, India\nJob ID:\n11886\nSUMMARY:\nThe Supplier Operations Advisor is responsible for coordination of supplier facing activities which include but are not limited to managing the teams central mailbox, supplier on and off boarding for existing client portfolios and any new client implementations globally, support with the distribution of communication relating to supplier events, tracking supplier compliance specific to country and client, storing supplier compliance documentation and retaining up to date compliance documents, ensuring the supplier engagement status is accurate at all times, maintaining the contact list of our program delivery teams, all back office support teams. Continuously ensuring the supplier records in our central database reflect the suppliers, current engagement status and supporting the team with administrative tasks. Offer guidance on best practice and highlight lessons learnt from previous implementations.\nGENERAL RESPONSIBILITIES:\nSupplier Operations and Communications\nResponsible for creating, updating and maintaining Supplier records in the central database\nResponsible for managing the Supplier Operations central mailbox\nInitiates Supplier On/Off boarding engagement process and applies country and client specific compliance requirements after relevant approvals have been acquired\nResponsible to ensure the supplier engagement status is 100% accurate and most up to date at any given time during the on / off boarding process\nTo liaise with Procurement & Supplier Partnership Managers to coordinate and prioritise the supplier engagement activities\nAssists in Supplier Partnership risk management workshops with supplier partnership team\nAssists in the coordination efforts during a segmentation process for the supplier base\nParticipates in special projects and performs other duties as assigned\nHighlight risks to supplier on/off boarding to Supplier Operations Lead\nContracts and Compliance Document Administration\nTo ensure the applicable country and client specific On/Off boarding documents are sent to the supplier\nTo ensure suppliers are meeting the applicable country and client specific On/Off boarding requirements\nTo vet all On/Off boarding documents with 100% accuracy\nTo manage all required chases for outstanding supplier compliance documentation\nVerifies  supplier on and off boarding documentations meet the compliance requirements as per the process checklists specific to country and client\nAssists in the coordination of Supplier Management document reviews with other departments (e.g. Legal, Compliance and Audit).\nTo distribute the revelant compliance documents to the applicable back office team to on / off board suppliers in the applicable systems e.g. Vendor Management System (VMS), Finance & Invoicing System.\nEDUCATION AND EXPERIENCE REQUIREMENTS:\nHigh School Diploma; Bachelor Degree in related field or equivalent experience.\nOne (1) to two (2) years work experience.  MSP experience preferred.\nKNOWLEDGE, SKILLS & ABILITIES:\nExcellent attention to detail\nSkilled in communicating effectively verbally and in writing.\nAbility to establish and maintain effective working relationships.\nAbility to interact and communicate detailed information and requirements with all levels of staff and management.\nExperience using web-based systems preferred but not required.\nAbility to work well in a team, maintain a sense of urgency and continuously strive to improve processes to drive efficiencies.\nAbility to maintain 100% accurate documentation\nAbility to accept and cope with a varied and changing work load and respond positively\nAbility to define steps required for completion of deliverables\nAbility to produce results in an ever-changing environment\nProficient with Microsoft Office products, including Word, Excel, PowerPoint and Outlook.\nApply Now",
        "application_url": "https://pontoonsolutions.avature.net/careers/Login?jobId=11886",
        "metadata": {},
        "link": "https://pontoonsolutions.avature.net/careers/JobDetail/Virtual-India-Supplier-Operations-Advisor/11886"
    },
    {
        "title": "Test 10/13",
        "description_html": null,
        "description_text": "Test 10/13\nToledo, OH, United States\nJob ID:\n2103\nTest\nApply Now\nEqual Opportunity Employer/Veterans/Disabled.  The Company will consider qualified applicants with arrest and conviction records.",
        "application_url": "https://pontoonsolutions.avature.net/careers/Login?eeo=1&jobId=2103",
        "metadata": {},
        "link": "https://pontoonsolutions.avature.net/careers/JobDetail/Toledo-OH-United-States-Test-10-13/2103?eeo=1"
    }
]