[
    {
        "title": "Director of Compensation",
        "description_html": null,
        "description_text": "Director of Compensation\nCharlotte, NC, United States\nRef#:\n1085162\nDate published:\n13-May-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nResponsible for designing and implementing the compensation strategy and programs for the company.  Scope includes programs for exempt and non-exempt as well as executive compensation.  Activities will involve base compensation, short and long term incentives, commission and special bonus plans.  Will assist management in the development of the company’s compensation philosophy, policies and objectives.\nEssential Functions/Responsibilities:\nLead compensation strategy by recommending variable compensation designs, short and long-term incentive programs that enable the attraction, motivation and retention of talent.\nEnsure company is in compliance with compensation laws, IRS/DOL regulations and SEC disclosure requirements.\nDevelop Internal Compensation & Board Compensation meetings materials\nPlan and manage the year-end merit, bonus, LTI processes to enable a positive end-user experience\nCollaborate with HR Business Partners and Business leaders to understand people strategies and the impact to compensation.\nProvide expertise to HR Business Partners, HR Design Centers, and Managers regarding compensation questions, evaluating new positions, grade levels, job descriptions, promotions and transfers.\nBuild and sustain collaborative relationships at multiple levels in the company. Work through competing points of view of key stakeholders to achieve best resolution for the business.\nUnderstand the business strategy and how compensation programs align to the strategy.\nEmbrace cultural/individual differences with empathy and leverage this to make informed decisions.\nManage and negotiate contracts with external consulting partners.\nSupport M & A activities as they relate to compensation.\nDevelop and implement a comprehensive communication and change management strategy to improve understanding of the company’s compensation programs.\nFormulate and implement approach for evaluating jobs, establishing salary structure and job grades\nConduct appropriate market competitive analysis and deliver results to inform the effectiveness of the compensation programs\nEstablish compensation policies and practices to enable compensation governance, streamlined management reporting, and standardization where appropriate\nRequirements/Qualifications:\nBachelors degree and/or equivalent years of experience\n8 or more years of applicable experience\nSpecific work or project experience: Leading a team of 4 or more staff; Experience in designing and administering enterprise wide compensation programs; Preparation of board compensation committee materials and annual proxy disclosure.\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=5530",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-Director-of-Compensation/5530"
    },
    {
        "title": "Sr Financial Analyst",
        "description_html": null,
        "description_text": "Sr Financial Analyst\nCharlotte, NC, United States\nRef#:\n1085167\nDate published:\n13-May-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nThe role of the Senior Financial Analyst is to provide accurate, timely and insightful financial and operational analysis, focus on Omni-channel financials, and to identify and implement process improvement opportunities both within the Financial Planning Department and throughout the organization.\nEssential Functions/Responsibilities:\nAct as lead analyst for all things Omni-channel including capital, expense, benefits, reporting, test & learns, omni profitability and more\nBecome a subject matter expert for assigned areas of responsibility\nBuild & maintain appropriate pro forma models / business cases to support each of the Omni-channel workstreams\nPartner with Omni / Sustainability stakeholders to develop a challenging but achievable budget which reflects all known expense savings opportunities and approved investments\nIntegrate all omni financials into appropriate planning lanes (expense, capital, benefits) through interactions with your other FP&A counterparts\nDevelop budget, forecast, scenario planning reporting for inclusion in executive level presentations\nPartner with Director of Sustainability to build out formalized scorecard and to drive continued progress on sustainability initiatives and expense saving opportunities\nIdentify, quantify, and assist in implementing expense savings ideas\nDevelop and maintain expense forecasting models / reports for areas of responsibility\nPartner with business partners to understand current state of business & upcoming risks and opportunities\nPerform ad hoc analysis on all areas of the business as requested by the Manager of FP&A, Director of FP&A, VP of Finance and CFO\nIdentify process improvements within the Financial Planning Department, including but not limited to report reduction, process automation, improved use of technology, improved communication and data hand-off, and documentation of key assumptions\nDevelop and maintain relationships with other Finance Department associates and management\nDevelop and maintain relationships with departmental and divisional management and expense budget owners\nRequirements/Qualifications:\nFour Year Degree, Finance or Business, MBA preferred\nThree or more years Financial Analysis experience with a proved track record of career growth, preferably FP&A (retail a plus)\nDemonstrated ability to create complex financial models\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=5535",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-Sr-Financial-Analyst/5535"
    },
    {
        "title": "IT Director Infrastructure Architecture & Engineering",
        "description_html": null,
        "description_text": "IT Director Infrastructure Architecture & Engineering\nCharlotte, NC, United States\nRef#:\n1085126\nDate published:\n12-May-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nCharlotte, N.C.-based Belk, Inc. (www.belk.com) is the nation’s largest family owned and operated department store with more than $4 billion in sales and 300 Belk stores located in 16 Southern states and a growing digital presence on belk.com. Founded on May 29, 1888 by William Henry Belk in Monroe, N.C., the company is in the third generation of Belk family leadership. Our mission is to satisfy the modern Southern lifestyle like no one else, so that customers get the fashion they desire and the value they deserve. Our vision is for the modern Southern woman to count on Belk first – for her, for her family, for life.\nBelk has been committed to community involvement since its inception and today gives 2.5 percent of its pretax income back to the communities it serves. During the past fiscal year the company and its associates, customers and vendors donated more than $20.9 million to those communities.\nEssential Functions/Responsibilities:\nThe successful candidate will lead the Infrastructure architecture (plan) & engineering (Build) function and will work with our stakeholders, Enterprise Architects, Application Delivery Teams, and partners to establish and operate a comprehensive infrastructure function for Belk.  The Director of Infrastructure Architecture & engineering will be a career systems engineer who has progressed to senior leadership.\nThis leader will plan, articulate Belk’s infrastructure technology strategy, and execute the transformation across the portfolio so that we progress towards target end state and actualize planned advantages.  The successful candidate will also necessarily be expert at financial models associated with technology decisions, including upfront investment, total cost of ownership, and expense / run models.  The successful candidate will also have recent experience with technology trends, and will be knowledgeable about how best to implement cloud options in retail to best advantage.\nThis director will specialize in delivery of all infrastructure for Belk IT projects per project schedules, including management of capital and expense budgets and staff.\nEssential Responsibilities & Skills\nThe duties and responsibilities listed below are intended to provide general guidelines and parameters for the job and are not intended to be a comprehensive, detailed description of the job.\n•Develop and implement infrastructure strategy that enables innovation and seeks to leverage technology trends that can create business value with agility and performance.\n•Perform end-to-end systems infrastructure design, capacity planning and performance management, identifying opportunities for automation, cost savings, and service quality improvement for retail stores & data center technologies, wireless, VoIP and end-user computing\n•Manage and oversee all infrastructure projects delivery. Prioritize, guide, direct and monitor work efforts of Infrastructure Project Managers and Technical teams. Track, report, and resolve issues in a timely manner to ensure project delivery\n•Manage capital expenditures and related expense budgets. Work with IT Finance and vendors to ensure architected technologies are procured following Belk sourcing processes and procedures in a coordinated and timely fashion.\n•Communicate in both a technical and non-technical manner.  Must be able to listen and understand technical solutions, problems and issues and communicate them and their status for resolution to a non-technical audience.\n•Develop the Infrastructure team and mentor talent to deliver the technology management and execution capabilities of the organization.  Attract and retain talent through positive employee relations and robust succession planning.\n•Manage the technology direction and tools of the team, ensuring that appropriate standards are set, maintained, followed and reported on regularly.\nRequirements/Qualifications:\nBehavioral Traits:\n•Highly motivated and results oriented professional who enjoys working in a fast paced, technology rich environment\n•Must be able to function collaboratively in a multi-vendor, outsourced environment\n•Must be able to think and act both strategically and tactically\n•Must possess strong interpersonal and communication skills;  comfortable front of room\n•Able to explain complex concepts at various levels of detail depending on audience\n•Must be able to organize issues and prioritize in a fast paced environment with hard deadlines\n•Must be able to properly tailor communication to, and work effectively with, both business and technical teams.\n•Must be able to quickly identify and resolve issues and concepts.  Possess strong troubleshooting and problem solving skills\n•Must be a self-starter, be self-motivated, able to work independently, and able to effectively multi-task\n•Must be an expert presenter, evangelist, and strategist\nExternal Relationships:\n•Must be able to function collaboratively in a multi-vendor environment with Partners and Service Providers:\n•Cisco\n•IBM\n•Oracle\n•Tata Consulting IBM Global Services\n•AT&T hosting\n•Verizon\n•All other providers of hardware, software and services to the Belk organization\nInternal Relationships:\n•Belk associates and management\n•Belk IT associates and management\n•Belk finance team\nMinimum Requirements\n•Bachelor’s Degree in Information Systems, Computer Science or other relative Technical Degree\n•10+ years working experience with a broad range of Infrastructure solutions for both data center and retail stores related technologies\n•3+ years of senior leadership role in Retail or similar industry\n•Hands-on experience in building/operating/managing infrastructure technologies (Cisco Networking, IBM Series Servers, IBM/NetApp Enterprise Storage, SAN, VMware/Hyper-V/VIO/Power VM, IOS, AIX, RHEL, Microsoft Exchange & ADS, Oracle servers)\n•Possess deep technical experience including designing, installing, integrating, implementing, and supporting multiple versions of application and infrastructure components.\n•Experience in datacenter migration & consolidation is a huge plus.\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=5494",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-IT-Director-Infrastructure-Architecture-Engineering/5494"
    },
    {
        "title": "IT Manager Information Security",
        "description_html": null,
        "description_text": "IT Manager Information Security\nCharlotte, NC, United States\nRef#:\n1085077\nDate published:\n11-May-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nCharlotte, N.C.-based Belk, Inc. (www.belk.com) is the nation’s largest family owned and operated department store with more than $4 billion in sales and 300 Belk stores located in 16 Southern states and a growing digital presence on belk.com. Founded on May 29, 1888 by William Henry Belk in Monroe, N.C., the company is in the third generation of Belk family leadership. Our mission is to satisfy the modern Southern lifestyle like no one else, so that customers get the fashion they desire and the value they deserve. Our vision is for the modern Southern woman to count on Belk first – for her, for her family, for life.\nBelk has been committed to community involvement since its inception and today gives 2.5 percent of its pretax income back to the communities it serves. During the past fiscal year the company and its associates, customers and vendors donated more than $20.9 million to those communities.\nEssential Functions/Responsibilities:\nThe Manager Information Security is a key member of the Information Cybersecurity team, which provides information security and risk management support for all Belk businesses. This position leads and evolves the IT Risk and Security Architecture Program which includes security risk assessments, penetration testing, and application security review activities across the Belk enterprise. These activities will be conducted and performed to identify IT risk and vulnerabilities to the company to drive awareness, understanding, and remediation of potential exposures to the business.\nThis position will provide guidance and direction in leading the security team’s operational, tactical, and strategic planning to evolve and adapt the risk and security architecture management activities to align and support business objectives, minimize adverse threat impact, and foster productive partnerships across the organization. Serves as trusted advisor and security consultant to identify and communicate risk trends and considerations in support of remediation plans in collaboration with business partners across Belk.\nThe Manager manages the development, planning, execution, and reporting of risk assessments, penetration testing, security architecture strategic decisions, and application security assessment activities; establishes and maintains regular written and in-person communications with the organization’s executives, department heads, and end users regarding pertinent risk and vulnerability assessment activities.\nResponsible for making decisions in such a way that risk is identified, communicated, and effectively mitigated;  directs and manages project initiatives from beginning to end; define project scope, objectives and deliverables that support business goals in collaboration with senior management and stakeholders; effectively communicate pertinent risk information to management, business constituents, team members and appropriate audiences in a timely and clear fashion; liaison with business partners across the organization in an ongoing basis; build, develop, and grow any business relationships vital to the success of the project.\nChallenges others to develop as leaders while serving as a role model and mentor; manages the development of team by ensuring, when possible, that project tasks are in line with career interests; inspires co-workers to attain goals and pursues excellence; identifies opportunities for improvement and makes constructive suggestions for change; manages the process of innovative change effectively; remains on the forefront of emerging industry practices; consistently acknowledges and appreciates each team member's contributions; effectively utilizes each team member to his/her fullest potential; motivates team to work together in the most efficient and synergistic manner.\nRequirements/Qualifications:\n• 3+ years of direct managerial experience with building Risk and Security Architecture programs.\n• 10+ years overall experience in Cybersecurity.\n• Demonstrated knowledge of information security principles, standards, practices and subject areas.\n• Excellent written, oral, and presentation skills.\n• Excellent interpersonal skills.\n• Ability to conduct and direct research into IT security issues, trends, and solutions as required.\n• Ability to present ideas in business-relevant and user-friendly language.\n• Proven analytical, evaluative, and problem-solving abilities\n• Ability to effectively prioritize and execute tasks in a high-pressure environment.\n• Strong understanding of key security frameworks (NIST 800-37, SANS CSCs, PTES, etc.).\n• Strong understanding of PCI, HIPAA, SOX, and other governmental and industry requirements.\n• Experienced with ISO and ITIL.\n• Track record of partnering with other teams in different departments to build relationships that further Penetration Testing and Security.\n• 2+ years network/system architect/engineering experience\nPreferred Qualifications:\n• Familiarity with key technologies used for core infrastructure within the Retail industry.\n• Information security certifications such as CISSP, CISM, or GIAC.\n• Consensus builder with ability to defuse tension in stressful situations.\n• Service centric focus when performing daily tasks with emphasis on consultative and collaborative solution building.\n• Articulate and persuasive leader who can serve as an effective member of the management team and who is able to communicate security-related concepts to a broad range of technical and non-technical staff.\n• Strong project management office experience with understanding of Agile methodology.\nEducation and Experience:\nBachelor's degree (B. A.) from four-year college or university; or equivalent training, education and experience.\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=5445",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-IT-Manager-Information-Security/5445"
    },
    {
        "title": "Tax Accountant II - Sales and Use Tax",
        "description_html": null,
        "description_text": "Tax Accountant II - Sales and Use Tax\nCharlotte, NC, United States\nRef#:\n1085102\nDate published:\n11-May-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nResponsibilities include the sales/use tax support of a dynamic multi-state environment that includes completion of Sales/Use tax registrations, maintenance of sales/use tax exemption certificates, monthly filings, compliance, and audits. The position requires strong tax research skills, as well as solid application and project management skills in order to support the varied business activities that impact the collection and reporting of sales/use taxes.  Additionally, the position will be tasked with assisting the Manager - Sales and Tax with tax planning projects.\nEssential Functions/Responsibilities:\nOversee and manage the issuance and receipt of all documentation required to support tax-exempt transactions.\nOversee and manage the complete controls review of the monthly submission of all states Sales and Use tax reporting and payments (monthly compliance reports are prepared by a third party).  Work includes that monthly preparation of data to be sent to a third party for return preparation and filing, as well as post filing variance review. Ensure that payments are processed so as to meet all deadlines.\nStrategize audit defense and support.  Complete sales/use tax assignments related to audit support. Coordinate verbal and written communication with taxing authorities and others as needed. Assist in the initiation and completion of refund claims, as warranted.\nEnsure company’s compliance with state sales and use tax reporting requirements, laws, and regulations.\nDevelop and maintain taxability matrices to serve as guidance for other departments\nMonitor changes in tax rates and legislation, update management and team about discovered modifications, and initiate tax policy changes to comply with authoritative requirements\nResearch and resolve all tax notices of assessment timely.\nOversee and manage all correspondences and/or inquiries from state Sales and Use tax authorities.\nIdentify and implement tax savings and planning initiatives. Manage reverse sales/use tax recoveries as assigned. Maintain a schedule of savings realized from all efforts.\nOversee and manage the research, response and resolution to all Sales and Use tax inquiries from stores, corporate departments, customers, and vendors promptly as they arise.\nOversee and manage the monitoring process of state and local tax rate changes and submit timely to IT for effective date changes.\nProvide guidance to the business on sales/use tax planning and compliance.\nOversee and manage the monitoring of Sales and Use tax treatment on invoices to ensure company compliance.  Communicate with division, store, and corporate personnel to make constructive suggestions on improved invoice coding.\nOversee the quarterly review of capital and expense invoices, processing any self-assessments timely in order to minimize audit risk.  Work with the applicable personnel to rectify errors and re-train where appropriate.\nOversee the guidance to the applicable business partners in regard to Sales/Use Tax Holidays.  Detailed applicable information should be distributed to personnel in advance of the holidays.\nComplete all sales/use tax related IT project assignments.  Project work may include participation in design of new systems or reworking of existing systems.\nLead and/or participate in all sales/use tax training efforts.\nOversee seasonal requests for budgeting sales/use tax credits.\nReview assigned general ledger reconciliations on monthly basis including balance sheet analysis.  Assist with the reconciliation of general ledger accounts as assigned.\nReview tax reserves as needed on a quarterly basis.  Recommend adjustments as required.\nPerform account reviews and monthly variance analysis, as assigned.\nUnderstand process flows of data into the general ledger used in regulatory reporting and work towards improving processing efficiencies. Assume leadership role to recommend ways manual functions and re-keying can be eliminated.\nCoordinate the established annual affiliate nexus disclosure recertification process\nManage assigned SOX documentation and key controls.\nFollow any job-related instructions requested by supervisor or management.\nRequirements/Qualifications:\nBachelors degree and/or equivalent years of experience\n2 or more years of applicable experience\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=5470",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-Tax-Accountant-II-Sales-and-Use-Tax/5470"
    },
    {
        "title": "Visual Merchandising Presentation Coordinator",
        "description_html": null,
        "description_text": "Visual Merchandising Presentation Coordinator\nCharlotte, NC, United States\nRef#:\n1085075\nDate published:\n8-May-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nDevelop and coordinate visual merchandising strategies to support Seasonal Trend Sets, Holiday Gift Strategies, Key Items and Corporate Initiatives.  Partner and work closely with merchant teams to ensure business needs are met.  Provide solid, timely communication to Divisions and Merchants on scheduled basis.  Manage budget and communication through workflow system.\nEssential Functions/Responsibilities:\nCoordinate and develop visual programs in collaboration with Creative Manager for all merchandising strategies as requested to support corporate direction/strategies/seasonal visual sets. Complete distribution in workflow and place orders for all components. Adhere to allocated budget. Write directives in workflow within given timeline and communicate to stores.\nProvide exciting and innovative visual solutions that set us apart from our competition.\nTimely follow up and execution of agreed to projects and strategies as committed to at seasonal creative council turn in.\nAdhere to departmental policy on requesting purchase orders, placing commitments and distribution documents.\nEnsure all directives are entered into the system and tracked accordingly.\nCreate Art Production Request Forms and provide images as needed.\nManage planogram process for FOB.  Work with merchant teams to create and ensure accuracy of planograms.  Publish to workbench on set timeline.\nCoordinate and determine vendor signing and visual collateral for adequate merchandise support by store size. Primary role is to ensure all vendor adds are captured and plans are in place to identify each store each season.\nCoordinate and approve vendor supplied collateral and fixtures for use in stores – ensure deliveries and communicate proper usage and timing through workflow system.\nEnsure execution of all approved ‘shop’ attractions as assigned.\nEnsure all projects associated with assigned FOB are assigned a lead owner (if not the coordinator) and a secondary partner when necessary.  This includes projects which are funneled via the Capital Coordinator during non-Creative Council times.\nEnsure merchants submit all projects via the VM Request Form.\nCoordinate and provide updated information to support the Division Merchandise Presentation Directors on a bi-weekly basis on all new and revised merchandising programs.\nNegotiate corporate pricing with vendors on all existing and new programs as needed.\nNegotiate vendor co-op and develop vendor supported visual programs.\nAttend and participate in all staff meetings, art production meetings and division director’s conference calls.\nCollaborate with New Store/Renovation Coordinator on master order form – assist in maintenance.\nReview all vendor shop installations with New Store/ Renovation Manager as needed.\nRequirements/Qualifications:\nBachelors degree and/or equivent years of experience\n6 or more years of applicable experience\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=5443",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-Visual-Merchandising-Presentation-Coordinator/5443"
    },
    {
        "title": "Financial Analyst - Strategic Sourcing",
        "description_html": null,
        "description_text": "Financial Analyst - Strategic Sourcing\nCharlotte, NC, United States\nRef#:\n1085018\nDate published:\n7-May-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nThe role of the Financial Analyst in Operations is to prepare accurate and timely financial budgeting/forecasting reports; analyze trends and variances using various financial and other metrics/ measurements for the various Operations’ areas including Utilities, Repairs, Maintenance, Travel, Supplies, and Strategic Sourcing.  This individual ascertains trends and builds and executes action plans to address those trends.  The individual reviews results and adjusts action plans to get the desired outcome.  Is able to utilize existing financial databases and use/develop and/or maintain internal/external databases.  Ad hoc and project work as assigned by management.\nEssential Functions/Responsibilities:\nAssist in developing, analyzing, and tracking financial goals, metrics, and plans for assigned areas.  This would include, but not limited to, expense forecasting via historical trends and defined variables, future initiatives, usage rates, and other assigned measurements in addition to providing variance explanations, researching drivers both micro and macro, communication of results, etc.\nAid in the development, tracking, and analysis of annual and multi-year goals and strategies.\nProactively identify process improvements and efficiencies.  Develop and implement action plans, following up on results and adjusting plans as necessary to get desired outcome.\nPrepare standard and ad hoc management reports, financial analyses and communications/presentations upon request on a weekly, monthly, quarterly basis or as requested.\nIdentify, quantify, and communicate risks and opportunities to budget. Act as a “Subject Matter Expert” for areas of responsibility.\nLead the financial planning development (expense & capital budgets) for assigned areas and become an expert in those areas.\nAble to identify, analyze, and develop expense and margin improvement ideas that can be implemented and increase EBIT.\nAbility to develop effective communications with Operations, other Functional Heads, Divisions, and Executive management. Partner with key expense stakeholders to understand key expense drivers.\nAct as a “Subject Matter Expert” for areas of responsibility.\nDevelop and maintain expense forecasting models for areas of responsibility.\nDevelop budget reporting for inclusion in management presentations.\nFacilitate the entry of the budget into the Hyperion planning system.\nPrepare ad hoc management reports, financial analyses, and presentations.\nIdentify and communicate process improvements throughout the organization.\nDevelop and maintain relationships with other Finance Department associates and management.\nDevelop and maintain relationships with departmental and divisional management and expense budget owners.\nRequirements/Qualifications:\nBachelors degree and/or equivalent years of experience\n2 or more years of applicable experience\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=5386",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-Financial-Analyst-Strategic-Sourcing/5386"
    },
    {
        "title": "IT Director Enterprise Operations",
        "description_html": null,
        "description_text": "IT Director Enterprise Operations\nCharlotte, NC, United States\nRef#:\n1085020\nDate published:\n7-May-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nCharlotte, N.C.-based Belk, Inc. (www.belk.com) is the nation’s largest family owned and operated department store with more than $4 billion in sales and 300 Belk stores located in 16 Southern states and a growing digital presence on belk.com. Founded on May 29, 1888 by William Henry Belk in Monroe, N.C., the company is in the third generation of Belk family leadership. Our mission is to satisfy the modern Southern lifestyle like no one else, so that customers get the fashion they desire and the value they deserve. Our vision is for the modern Southern woman to count on Belk first – for her, for her family, for life.\nBelk has been committed to community involvement since its inception and today gives 2.5 percent of its pretax income back to the communities it serves. During the past fiscal year the company and its associates, customers and vendors donated more than $20.9 million to those communities.\nEssential Functions/Responsibilities:\nThe Director of Enterprise Operations reports to our VP Enterprise Operations and is a strong, highly visible leader responsible for leading both insourced and outsourced teams engaged in comprehensive management of Enterprise Operations for the company.  This includes services supporting servers, storage, desktops, data networks, voice networks, security, disaster recovery, business continuity, and overall incident and change management.\nThe Director provides senior leadership and direction for all operational work efforts of Belk’s internal and outsourced operations groups to build a culture of excellence based on leading by example, driving continuous improvement, performing root cause analysis for problem elimination, doing all work right the first time, and a relentless focus on customer service, innovation and creating an extraordinary end user experience.\nRequirements/Qualifications:\n•Communication – Communicate effectively and appropriately with both technical and non-technical audiences.  Ensure transparency and well planned communication.\n•Budget – Own and manage Operations expense and capital budgets, including multi-year plans and tracking of actuals and projections throughout the budget cycle.\n•Customer Service – Oversees customer service and all customer touch points.  Builds, maintains, measures, and constantly improves a culture of customer service excellence, where superb customer interaction and service is “baked in” to everything we do.\n•Relationship Management – Build partnerships with IT Delivery, Shared Services Managers and third party service providers. Own and manage contractual agreements and outsourced relationship to assure full value from a delivery and cost perspective. Ensure effective relationships amongst vendor staff with business end users and other service providers.\n•Security – Ensure security and compliance of all company compute assets and environments.  Ensure that risks are evaluated and minimized on an ongoing basis, and that security posture evolves as necessary to protect the enterprise.\n•Disaster Recovery – Work with architecture group to ensure that compute environments are designed and built to provide the required replication / recovery capabilities by tier of application.  Document, test and refine replication, failover, and DR processes.\n•Business Continuity – Work with key business stakeholders to ensure Business Continuity planning and testing.  Ensure company readiness for partial or full disaster at any technology site.\n•Process Improvement – Ensures constant improvement of operations processes.  Creates and maintains focus on measurement and constant improvement of all core support processes.\n•Incident and Problem Management – Ensures excellence in problem and incident management, including root cause analysis.  Drives planning, execution, and measurement of long term solutions.\n•Vendor Team Management – Manage performance of outsourced teams.  Ensure continuous improvement, responsiveness, accountability, and seamless effective service for customers.\n•Asset Management – Ensure comprehensive management of company technology assets, ensuring maximum value from expenditures, licensing compliance, and refresh cycles.\n•Provisioning and Procurement – Ensure timely, accurate, and complete provisioning for company associates and stores.\n•Transformation Management-Lead and support transformation, using best practices, incorporate ITIL processes and change management processes.\nPosition Requirements\nRequired Education, Experience and Skills\n•Bachelor’s Degree in Information Systems, Business Administration, Computer Science or other relative Technical Degree (equivalent work experience will be considered in lieu of degree)\n•At least 10 years experience working in an IT department\n•At least 3 years experience in an Operations Senior Leadership Role\n•Experience developing strategic and tactical plans to meet operational support strategies, goals and objectives\n•Experience developing and managing operational budgets in excess of $10MM annually\n•Experience managing outsourced teams, or contract teams to deliver end user support\n•Experience analyzing, designing, implementing and measuring the effectiveness of process improvement activities\n•Ability to act quickly in a crisis situation to make decisions and keep key constituents informed of the situation\n•Proficient in the use of Microsoft Office Products: Word, PowerPoint, Excel and Project\n•Excellent verbal and written communication and presentation skills\nPreferred Education, Experience and Skills\n•Knowledge and experience working in an IT department within a Fortune 500 retail company\n•ITIL Service Desk framework experience\nCompetencies\n•Ability to communicate technically and non-technically\n•Organizes and executes work to goals and end dates; demonstrates a sense of urgency around problems\n•Excellent relationship management skills\n•Proven financial responsibility\n•Process and customer service focused\n•Organize, manage and track multiple detailed tasks and assignments with frequently changing priorities in a fast-paced work environment.\n•Promoting effective coordination between work groups\n•Establish operational strategy, goals and objectives\n•Develop processes and procedures for efficient and timely work flow\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=5388",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-IT-Director-Enterprise-Operations/5388"
    },
    {
        "title": "IT Infrastructure Solutions Architect",
        "description_html": null,
        "description_text": "IT Infrastructure Solutions Architect\nCharlotte, NC, United States\nRef#:\n1085029\nDate published:\n7-May-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nCharlotte, N.C.-based Belk, Inc. (www.belk.com) is the nation’s largest family owned and operated department store with more than $4 billion in sales and 300 Belk stores located in 16 Southern states and a growing digital presence on belk.com. Founded on May 29, 1888 by William Henry Belk in Monroe, N.C., the company is in the third generation of Belk family leadership. Our mission is to satisfy the modern Southern lifestyle like no one else, so that customers get the fashion they desire and the value they deserve. Our vision is for the modern Southern woman to count on Belk first – for her, for her family, for life.\nBelk has been committed to community involvement since its inception and today gives 2.5 percent of its pretax income back to the communities it serves. During the past fiscal year the company and its associates, customers and vendors donated more than $20.9 million to those communities.\nEssential Functions/Responsibilities:\nThe Infrastructure Solutions Architect (ISA) is a member of the Belk Infrastructure Engineering team and is responsible for leading the process that aligns our technology foundational components to business system initiatives.  The ISA role is to provide architectural guidance and oversight among the individual infrastructure domains to ensure overall solution alignment to standards and business objectives.\nThe ISA possesses a broad knowledgebase with a focus on strategic technologies including: Microsoft Windows Server technologies, IBM Power Systems, VMware technologies, Cisco/Palo Alto Networking, and Storage technologies.\nThe ISA will also work with decision makers in other departments to identify, recommend, develop, implement, and support cost-effective technology solutions.  The ISA will participate in overall IT planning, bringing a current knowledge and future vision of technology and systems.\nThe ISA role works in close partnership with Belk’s Enterprise Architecture team aligning technical solutions to business and technology strategies. This position will be responsible for designing and delivering solutions which are fault tolerant, flexible, and scalable to support our development, test and production environments.\nThe scope of this position includes collaboration and participation with all IT Infrastructure core components; furthermore, the IA will be a liaison between Belk IT and Belk’s business partners, such as TCS, and will work collaboratively to maintain and operate all related systems in support of end-user access, performance, and stability.\nRequirements/Qualifications:\nThe duties and responsibilities listed below are intended to provide general guidelines and parameters for the job and are not intended to be a comprehensive, detailed description of the job.\n•Expert knowledge of and experience with enterprise scale technologies such as Windows technologies including Server platforms, Desktop platforms, Active Directory, IIS, Windows Clustering, Hyper-V, VMware Virtualization, and CA monitoring.\n•Expert knowledge of and experience with enterprise scale Unix/Linux technologies such as IBM Power Systems, ViOS, PowerVM, AIX, Red Hat, SUSE\n•Expert knowledge in Design and Implementation of Proactive Monitoring and Management processes for all responsible environments\n•Expert knowledge in Developing, Planning and executing DR procedures for all responsible environments\n•Experience in Design and Implementation of Retail Industry Systems (POS, eCommerce, CRM, Merchandising, etc)\n•Experience in designing and deploying solutions in a cloud environment, Public and Private (SaaS, PaaS, IaaS)\n•Provide Configuration Management leadership across the enterprise for all supported technology platforms\n•Practical knowledge and a large experience of a broad range of infrastructure technologies including: IBM X-Series Systems, Cisco Networking, and Storage Systems (XIV, V3700, Brocade, FCoE)\n•Practical knowledge of database systems and architectures(Oracle, MS SQL, MySql)\n•Practical knowledge and a large experience of infrastructure services delivery techniques\n•Practical knowledge and a large experience of Internet facing environments\n•Familiarity with Enterprise Architecture concepts and best practices\n•Excellent system problem diagnoses skills on both hardware and software\nBehavioral Traits:\n•Must be able to function collaboratively in a multi-vendor, outsourced environment\n•Must be able to think and act both strategically and tactically\n•Must possess strong interpersonal and communication skills.\n•Must be able to organize issues and prioritize in a fast paced environment with hard deadlines\n•Must be able to properly tailor communication to and work effectively with both business and technical teams.\n•Must be able to quickly identify and resolve issues and concepts.  Possess strong troubleshooting and problem solving skills\n•Must be a self-starter, be self-motivated, and able to effectively multi-task\n•Must be able to work independently, as a member of the Architecture team, and able to lead and mentor\nExternal Relationships:\n•Must be able to function collaboratively in a multi-vendor environment with Partners and Service Providers:\n•Tata Consultancy Services (TCS)\n•Windstream Hosted Solutions\n•Dynamix Group Inc.\n•All other providers of hardware, software and services to the Belk organization\nInternal Relationships:\n•Belk associates and management\n•Belk IT associates and management\n•Belk Project Management Office\n•Belk Enterprise Operations\nPosition Requirements\n•Research and evaluation of both software/hardware; IBM X-Series/P-Series Systems, Windows, AIX, Linux, VMware, Hyper-V and Storage products.  Knowledge of Cisco networking technologies and/or CA Monitoring and ITIL products is a plus\n•Must be able to remain current and possess knowledge of emerging technologies\n•Advises management of options, risk vs. cost, benefits and other impacts on Infrastructure technology solutions\n•Sets technical standards and procedures across the enterprise for all strategic platforms.\n•Creates \"Position Statements\", \"Technical Approaches\" and \"Technical Designs\" documents as technology guidelines\n•Monitors and recommends current and future architecture trends\n•Communicates to, educates, and mentors colleagues\nMinimum Requirements\n•10+ years experience creating, troubleshooting and supporting complex Windows, VMware, Unix, Linux, Networking and Storage solutions\n•10+ years in a Infrastructure Architecture role, with some focus on large enterprise technical designs and implementations\n•5+ years working as an Infrastructure Architect to implement complex solutions\n•5+ years working experience with a broad range of Infrastructure and Storage solutions\n•5+ years working experience in Retail technologies\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=5397",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-IT-Infrastructure-Solutions-Architect/5397"
    },
    {
        "title": "IT Infrastructure Architect-UNIX",
        "description_html": null,
        "description_text": "IT Infrastructure Architect-UNIX\nCharlotte, NC, United States\nRef#:\n1085030\nDate published:\n7-May-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nCharlotte, N.C.-based Belk, Inc. (www.belk.com) is the nation’s largest family owned and operated department store with more than $4 billion in sales and 300 Belk stores located in 16 Southern states and a growing digital presence on belk.com. Founded on May 29, 1888 by William Henry Belk in Monroe, N.C., the company is in the third generation of Belk family leadership. Our mission is to satisfy the modern Southern lifestyle like no one else, so that customers get the fashion they desire and the value they deserve. Our vision is for the modern Southern woman to count on Belk first – for her, for her family, for life.\nBelk has been committed to community involvement since its inception and today gives 2.5 percent of its pretax income back to the communities it serves. During the past fiscal year the company and its associates, customers and vendors donated more than $20.9 million to those communities.\nEssential Functions/Responsibilities:\nThe Infrastructure Architect (IA) is a member of the Belk Infrastructure Engineering team and is responsible for leading the process that aligns our technology foundational components to business system initiatives.  The IA role is to coordinate, direct, and design project infrastructure activities as well as provide technology direction in support of the project and support teams.\nThe IA possesses a broad knowledgebase with a focus on strategic technologies including: IBM Power Systems, AIX, Linux, Sun Solaris, Power VM, VIOS, and Storage technologies.\nThe IA will also work with decision makers in other departments to identify, recommend, develop, implement, and support cost-effective technology solutions.  The IA will participate in overall IT planning, bringing a current knowledge and future vision of technology and systems.\nThe IA role works in close partnership with Infrastructure Engineering team aligning technical solutions to business and technology strategies. This position will be responsible for designing and delivering solutions which are fault tolerant, flexible, and scalable to support our development, test and production environments.\nThe scope of this position includes collaboration and participation with all IT Infrastructure core components; furthermore, the IA will be a liaison between Belk IT and Belk’s business partners, such as TCS, and will work collaboratively to maintain and operate all related systems in support of end-user access, performance, and stability.",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=5398",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-IT-Infrastructure-Architect-UNIX/5398"
    },
    {
        "title": "IT Network Architect",
        "description_html": null,
        "description_text": "IT Network Architect\nCharlotte, NC, United States\nRef#:\n1085031\nDate published:\n7-May-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nCharlotte, N.C.-based Belk, Inc. (www.belk.com) is the nation’s largest family owned and operated department store with more than $4 billion in sales and 300 Belk stores located in 16 Southern states and a growing digital presence on belk.com. Founded on May 29, 1888 by William Henry Belk in Monroe, N.C., the company is in the third generation of Belk family leadership. Our mission is to satisfy the modern Southern lifestyle like no one else, so that customers get the fashion they desire and the value they deserve. Our vision is for the modern Southern woman to count on Belk first – for her, for her family, for life.\nBelk has been committed to community involvement since its inception and today gives 2.5 percent of its pretax income back to the communities it serves. During the past fiscal year the company and its associates, customers and vendors donated more than $20.9 million to those communities.\nEssential Functions/Responsibilities:\nThe Network Architect (NA) is a member of the Belk Infrastructure Engineering team and is responsible for leading the process that aligns our technology foundational components to business system initiatives.  The NA role is to coordinate, direct, and design network infrastructure activities as well as provide technology direction in support of the project and support teams.\nThe NA possesses a broad knowledgebase with a focus on strategic technologies including: Cisco Networking technologies including (LAN, WAN, SAN, VoIP, Wireless, Firewall), HP Networking, Palo Alto, Checkpoint and similar non-Cisco technologies.\nThe NA will also work with decision makers in other departments to identify, recommend, develop, implement, and support cost-effective technology solutions.  The NA will participate in overall IT planning, bringing a current knowledge and future vision of technology and systems.\nThe NA role works in close partnership with Belk’s Domain Architects, the Enterprise Architecture and Security teams aligning technical solutions to business and technology strategies. This position will be responsible for designing and delivering solutions which are fault tolerant, flexible, and scalable to support our development, test and production environments.\nThe scope of this position includes collaboration and participation with all IT Infrastructure core components; furthermore, the NA will be a liaison between Belk IT and Belk’s business partners, such as HP Enterprise Services, and will work collaboratively to maintain and operate all related systems in support of end-user access, performance, and stability.\nRequirements/Qualifications:\nThe duties and responsibilities listed below are intended to provide general guidelines and parameters for the job and are not intended to be a comprehensive, detailed description of the job.\n•Serves as network expert/lead and project leader of an enterprise network modernization effort\n•Responsible for high-level network planning, design, and optimization\n•Responsible for management of a network services team for operating, maintaining and enhancing an enterprise networking infrastructure environment\n•Responsible for network planning, network architecture design and engineering\n•Planning, forecasting, implementation, and identification of resource requirements for network systems\n•Proficiency in working in a cross collaboration teaming structure with other IT infrastructure teams, including data center, storage, service desk, security, and applications\n•Develops strategies and direction for network solutions and current and emerging technologies (wireless and VoIP)\n•Approves and modifies network design and architecture to ensure compliance\n•Translates business requirements into network or process designs\n•Integrates and schematically depicts communication architectures, topologies, hardware and software, transmission and signaling links and protocols into complete network configurations\n•Plans and recommends network hardware, systems management software and architecture\n•Configures and maintains routers, switches, and hubs for network systems (including wireless and VoIP)\n•Evaluates and recommends new products, maintains knowledge of emerging technologies for application to the enterprise\n•Monitors network performance, ensures capacity planning is performed, and is proactive in assessing and making recommendations for improvement\n•Provide technical assistance and knowledge during active network troubleshooting of the operational environment\n•Provide technical write-ups and root cause analysis in the event of network degradations, outages, or anomalies\n•Performs trouble shooting procedures and designs resolution descriptions\n•Monitor solutions and recommendations for compatibility with the IT Operations strategic direction.\n•Conduct risk assessments and business impact analysis to identify vulnerable areas and applications within the environment\n•Create and prioritize remediation plans\n•Review network operations designs to ensure that the infrastructure design continues to meet the needs of the business\n•Ensure best practices, standards and guidelines are applied in developing, designing/implementing solutions, establishing work priorities, resolving problems and reporting on project status\n•Assist in Development of SLAs for all organizational network and IP telephony applications\n•Recommend and implement disaster avoidance strategies and impact reduction strategies and process\n•Create and implement project plans, ensure adherence to project timelines, perform project risk assessment and develop contingency risk plans\n•Advanced knowledge of Wide Area Network (WAN) management and configuration principles\n•Advanced knowledge of networks, security guidelines and industry “best practices”\n•Advanced knowledge of LAN/WAN hardware devices, specifically Cisco Firewalls, Routers, and Switches\n•Advance knowledge or Palo Alto firewalls\n•Advanced skills in solving complex technical problems involving integrated operating systems and hardware platforms\n•Advanced skills in configuring and installing equipment to support LAN/WAN applications\n•Advanced skills in analyzing data and implementing solutions\n•Advanced skills in assessing and prioritizing multiple tasks, projects, and demands\n•Advanced skills in establishing and maintaining cooperative working relationships with other employees, telecom companies, vendors, and other organizations\n•Knowledge of a wide variety of operating and server systems\n•Understanding of Disaster Recovery concepts and applications\nBehavioral Traits:\n•Must be able to function collaboratively in a multi-vendor, outsourced environment\n•Must be able to think and act both strategically and tactically\n•Must possess strong interpersonal and communication skills.\n•Must be able to organize issues and prioritize in a fast paced environment with hard deadlines\n•Must be able to properly tailor communication to and work effectively with both business and technical teams.\n•Must be able to quickly identify and resolve issues and concepts.  Possess strong troubleshooting and problem solving skills\n•Must be a self-starter, be self-motivated, and able to effectively multi-task\n•Must be able to work independently, as a member of the Architecture team, and able to lead and mentor\nExternal Relationships:\n•Must be able to function collaboratively in a multi-vendor environment with Partners and Service Providers:\n•IBM Global Services\n•HP Enterprise Services\n•Windstream Hosted Solutions\n•Dynamix Group Inc.\n•All other providers of hardware, software and services to the Belk organization\nInternal Relationships:\n•Belk associates and management\n•Belk IT associates and management\n•Belk Project Management Office\n•Belk Enterprise Operations\n•Belk Security Architecture and Operations\nPosition Requirements\n•CCIE certification or equivalent experience\n•Must have a minimum of 10+ years of data networking experience\n•Must have a minimum of 10+ years in enterprise project/program management and managing network and other IT infrastructure technical teams and projects\n•10+ years experience - enterprise level network support, architecture, and design required.\n•8+ years experience - enterprise level telephony support and design required.\n•Cisco VOIP experience and wireless networking experience required\n•Extensive experience with major enterprise network infrastructure migrations required\n•HP Procurve, 3 Com, or similar non-CISCO networking experience required\n•CISCO ASA Firewall Architecture, Design, migration and networking experience required\n•Checkpoint Firewall Architecture, Design, migration and networking experience highly desired\n•Deep technical knowledge working across multiple applications, operating systems and devices required\n•Strong knowledge of Storage Area Networking\n•Candidate should be an expert with multiple devices, operating systems and applications\n•Sense of urgency, ability to trouble shoot complex problems is required\n•All aspects of connectivity Cisco Nexus/IOS, VOIP, Video conferencing, 3G/4G, Wi-Fi, VPN, Citrix, ex. Brocade/Cisco Fiber Networking, etc.\n•Executive and technical level communication and presentation skills required\n•Must be able to remain current and possess knowledge of emerging technologies\n•Advises management of options, risk vs. cost, benefits and other impacts on Infrastructure technology solutions\n•Creates \"Position Statements\", \"Technical Approaches\" and \"Technical Designs\" documents as technology guidelines\n•Monitors and recommends current and future architecture trends\n•Communicates to, educates, and mentors colleagues\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=5399",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-IT-Network-Architect/5399"
    },
    {
        "title": "Web Content Administrator",
        "description_html": null,
        "description_text": "Web Content Administrator\nCharlotte, NC, United States\nRef#:\n1085035\nDate published:\n7-May-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nThe Merchandise Assistant - CARS (\nContent Acquisition Requests)\nposition is responsible for data entry, set up and maintenance for merchandise on Belk.com.  This position will have full accountability of the CARS process, including turn in, processing CARS, following up on any issues and getting all items on the site in time for the receipt delivery. Focus on improving the quality level of product detail descriptions received from the vendors and buying offices to help increase the overall web site conversion rate.\nEssential Functions/Responsibilities:\nRequirements/Qualifications:\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=5403",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-Web-Content-Administrator/5403"
    },
    {
        "title": "Divisional Assistant – Home | Dept: Mens/Home/Kids",
        "description_html": null,
        "description_text": "Divisional Assistant – Home | Dept: Mens/Home/Kids\nCharlotte, NC, United States\nRef#:\n1085017\nDate published:\n6-May-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nThe Divisional Assistant acts as a coordinator and mediator for Division projects. Compiles, processes, disseminates and maintains merchandising information for the Merchandising & Planning Division.\nEssential Functions/Responsibilities:\nEssential Functions\nAccomplishes operations/organizational objectives by establishing standards and procedures; answering phones, ordering supplies, delivering reports and various other duties, such as, schedule meetings; report and maintain records of time adjustment for the department on a weekly basis.\nMonitors daily sales for division.  Processes and updates TY/LY recaps.\nCoordinates and compiles Division projects, reports and recaps under the supervision of the DMM including Volume Reports, resource books, Advertising co-op, Event recaps, etc.\nPrepares and provides management reports for GMM, DMM and management as requested.\nUpdates MMI tracking list on a weekly basis, adding new SKU‘s where necessary.\nPrepares excel spreadsheets for new report formats as required.\nCreates and assures standard formats are used for forms and reports within the Division and throughout the office.\nProcesses, coordinates and updates advertising coop records, and attends circular meetings and all ad meetings.\nCoordinates and executes time and action calendars for core meetings.\nSchedules all division travel and completes expense reports.\nCompletes\na variety of other tasks as business need requires.\nRequirements/Qualifications:\nPosition Requirements:\nExcellent computer skills, including Outlook, MS Word, Excel, Access, and PowerPoint.\nManages time effectively. Uses work plans to prioritize competing and interdependent tasks and meet deadlines.\nExcellent organizational skills.  Ability to multi-task and keeps file and work area organized.\nPlans work.  Sets goals and outlines tasks to achieve them.\nPosesses strong communication skills.\nBachelor Degree or Equivalent work experience.\nReports to:\nVP/Divisional Merchandise Manager, VP Planning\nFor reasonable accommodation information for an ADAAA qualified disability please see Belk Associate Handbook for policy and procedures.\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=5385",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-Divisional-Assistant-Home-Dept-Mens-Home-Kids/5385"
    },
    {
        "title": "Inbound Transportation Manager",
        "description_html": null,
        "description_text": "Inbound Transportation Manager\nCharlotte, NC, United States\nRef#:\n1085010\nDate published:\n5-May-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nThe Inbound Transportation Manager will manage and coordinate all domestic transportation activities with a major focus on the development, implementation and advancement of inbound transportation strategies and processes in order to advance the competitive position and profitability of the company.  The position will take a strategic leadership approach and will be located at the corporate office for improved collaboration with merchandising, vendors and stores.\nThe Inbound Transportation Manager ensures that internal and external customers receive the highest level of service, makes decisions that maximize the operation’s performance and cost metrics, and builds strong associate work teams with a positive work environment.\nThe Inbound Transportation Manager will work in partnership with the Director of Transportation to create a more strategic supply chain approach for the company to include vendors, trading partners and all distribution and transportation functions.  He / she will have operational and fiscal responsibility for all aspects of domestic transportation to the company’s distribution centers.  Belk will look to this position to integrate and develop the transportation capabilities of the organization.\nThe ideal candidate will be highly knowledgeable, who has gained transportation experience in an organization with a total supply chain approach.  He / she will have a career path which shows increasingly responsible roles in logistics and supply chain leadership.  He / she must be able to project immediate credibility regarding his / her understanding of an integrated transportation environment within the broader supply chain.  He / she will be a seasoned manager who has a background in supporting the supply chain for a customer-centric environment.\nEssential Functions/Responsibilities:\nLead the inbound domestic transportation team, supporting Belk’s business goals and strategy and achieving key performance metrics.\nDirectly responsible for managing the routing of all domestic inbound freight and cost management.\nDemonstrate support for the merchandising, vendors and stores organization by fostering effective communication through transparency of strategies and processes, and promoting relationship building initiatives.\nProactively manage, design and develop national solutions for transportation capacity, ensuring the integration of technology, people and processes across the enterprise.\nFoster a desire and commitment for continuous improvement.  Drive an environment that builds team camaraderie.\nLead / manage change internally within supply chain, cross-functionally and externally.\nDrive the development and attainment of short and long-range goals and objectives.  Review and analyze activities, costs, operations, and forecast data to determine progress toward stated goals and objectives.\nConfer with Director of Transportation and other administrative personnel to review achievements and discuss required changes in goals or objectives resulting from current status and conditions.\nEnsure that the transportation organization is a ‘customer-centric’ team supported by a strong technology infrastructure that provides the foundation for business growth.\nIdentify and create a new level of information connectivity between suppliers, service providers, distribution and logistics, and create customer value through technology-driven transportation services.\nEvaluate and recommend new or revised freight compliance processes and procedures, and assist with audits to ensure compliance with established standards.\nManage integration and flow for the distribution of all products; ensure effective distribution of product, incorporating best practices and processes to support evolving sourcing models; proactively enhance supply chain visibility.\nAssist in the development of improved transportation expertise and practices including negotiation of transportation contracts and domestic courier services; familiar with all modes and regulations, providers, etc.\nFormulate, manage, coordinate, and oversee projects across transportation for which responsibility is delegated in a manner that optimizes and meets customer needs, quality standards and cost objectives.\nResponsible for motivating, training, recruitment, retention and career development.  Direct key talent attraction, selection, and development of external providers as needed.\nAssess and develop the talent needs of the transportation team.  Develop \"bench strength\" in the organization to enable future growth strategies.\nPrepare the capacity of the team to deal proactively with the future by engaging the team to develop a complete understanding of the business, short and long-term business plans and objectives, the organization's core competencies, and current and required skill sets; develops and builds dashboards to track and measure results.\nAssist in the development of expense and capital budgets, controls, and measurements to monitor progress, including service-level agreements.  Report budget status to appropriate stakeholders.\nUnderstand best practice metrics and the requirements for operational compliance / commitment and be a key leader in meeting the guidelines for effective service levels and risk management.\nDemonstrate support for the merchandising and stores organizations by fostering effective communication\nRequirements/Qualifications:\nSkilled in the practice of Transportation Management.\nA proven track record of at least 3 to 5 years in transportation management, with a history of increasing responsibility.\nTrack record of working cross-functionally with merchandising, vendors & customers / stores.\nWell-developed numerical and analytical skills with reference to merchandise, vendors and freight; identification and development of supply chain trends; distribution and transportation systems operations; and expense control efforts.\nAbility to persuade and influence others, collaborative, accountable for results, impeccable record of delivering on their promise.\nContemporary technology savvy; experience in transportation technology / management systems.\nExcellent verbal and written communication skills, including the ability to prepare strong business cases and to support and defend ideas and positions.\nProven change management skills and reputation for building and leading high-performing, cross-functional teams that achieve their goals; track record in attracting, developing, and retaining talent.\nA champion on new initiatives with an ability to successfully work across different groups, and to execute by bridging functional and divisional silos.\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=5378",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-Inbound-Transportation-Manager/5378"
    },
    {
        "title": "Parcel Manager",
        "description_html": null,
        "description_text": "Parcel Manager\nCharlotte, NC, United States\nRef#:\n1085011\nDate published:\n5-May-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nThe Parcel Manager reports to the Director of Transportation and is responsible for supplier management and functional support for all Parcel shipments, including operational oversight and fiscal responsibility for these activities.  He / She will take a collaborative approach and will be accountable for creating plans to develop and integrate the capabilities of the transportation organization in line with the current Supply Chain Mission.  The Parcel Manager ensures that internal and external customers receive the highest level of service, makes decisions that maximize the operation’s performance and cost metrics, and builds strong associate work teams with a positive work environment.\nEssential Functions/Responsibilities:\nManage the suppliers responsible for parcel shipments throughout the network in a dynamic, Omnichannel environment.  Includes intra-company, retail inbound and outbound, and direct-to-consumer movements from fulfillment nodes (fulfillment centers, supplier direct and stores).\nCoordinate and manage supporting aspects of the company’s parcel programs\nProvide leadership that maximizes and optimizes resources in support of the company’s goals and objectives\nPromote a desire and commitment for continuous improvement\nDemonstrate support for the supply chain, eCom, Omnichannel and stores organizations by fostering effective communication through transparency of strategies and processes, and promoting relationship building initiatives.\nDevelop expense and capital budgets, controls, and measurements to monitor progress, including service-level agreements.  Ensure proper accounting treatment is attained and report status to appropriate stakeholders.\nEnsure effective and timely communication between the department and supply chain management, the network of fulfillment nodes and various corporate departments to guarantee coordination of efforts.\nPerforms other duties as assigned.\nRequirements/Qualifications:\n4 or more years of parcel and/or supply chain experience as an operator with a career path showing increasing responsibility in transportation, logistics and supply chain.\nWell-developed analytical skills with reference to merchandise, vendors and parcel; identification and development of parcel trends; parcel / transportation systems operations; and expense control efforts.\nAbility to work effectively across organizations among suppliers, supply chain, eCom and stores; ability to create strong, trust-based relationships with these constituents.\nAbility to persuade and influence others, collaborative, accountable for results, impeccable record of delivering on their promise.\nExperience in parcel / transportation management systems / supply chain technology.\nExcellent verbal and written communication skills.\nA champion on new initiatives with an ability to successfully work across different groups, and to execute by bridging functional and divisional silos.\nAbility to Travel.\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=5379",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-Parcel-Manager/5379"
    },
    {
        "title": "eCommerce - Executive Administrative Assistant",
        "description_html": null,
        "description_text": "eCommerce - Executive Administrative Assistant\nCharlotte, NC, United States\nRef#:\n1085005\nDate published:\n4-May-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nThe Administrative Assistant II in eCommerce supports the Senior Vice President by providing administrative support; completing special projects; working with the management team as assigned.\nEssential Functions/Responsibilities:\nEssential Functions\n·\nAccomplishes organizational objectives by supporting corporate standards and procedures\n·\nAnswering telephones and emails, delivering reports and various other duties, such as scheduling meetings and note taking in meetings\n·\nCompletes special projects; responds to inquiries, reviews and summarizes materials and data; prepares slide presentations for special meetings.\n·\nIn support of manager, maintains calendar; schedules travel; completes expense reports.\n·\nMaintains the travel budget for the eComm teams.\n·\nReviews departmental organizational charts for accuracy.\n·\nActs as backup for Timekeeping, Onboarding and supply ordering for eCommerce.\no\nfollow up on needed information, equipment, and software downloads and set up for new employees.\n·\nAssist other Executive Assistants in the department as needed.\n·\nCompletes a variety of other tasks as required for the eCommerce teams.  Follows any job-related instructions requested by supervisor or management as business need requires.\nRequirements/Qualifications:\nPosition Requirements\nEducation & Experience\n·\nBachelor Degree or Equivalent work experience.\n·\nOne to two years administrative experience, preferable.\n·\nExcellent oral and written communication skills. Effective at communicating to all levels of management.\n·\nExperience using database, spreadsheet, and word-processing software to prepare various versions of statistical and written summary reports for different levels of management.\n·\nExcellent computer skills, including MS Word, Excel, and PowerPoint. Knowledge of the Internet is useful for retrieving information on various companies, sites, and products\n·\nProven ability to compose memos, correspondence, and other professional documents.\n·\nCreates work plans, sets goals and outlines tasks to achieve them.\n·\nExperience using multiple resources and research methodologies to capture and interpret information.\n·\nAbility to expand job responsibilities, suggests improvement, and collaborates with others to generate ideas\nand improve processes and communications.\n·\nExperience analyzing causes of variances between actual and budgeted income and expenses\nBehavioral Traits\n·\nAbility to handle sensitive data and maintain a high level of confidentiality.\n·\nAbility to handle meeting conflicts and rescheduling.  It is critical for the individual to gain sense of priority and ensure the executive is most effective with time.\n·\nAbility to thrive in a fast paced environment and anticipate managers needs\n·\nExtreme attention to detail, organized\n·\nManages time effectively. Uses work plans to prioritize competing and interdependent tasks and meet deadlines.\n·\nExcellent organizational skills. Keeps file and work area organized. Maintains a comprehensive library of reference and historical data.\nWorks collaboratively, exhibits competent people skills\nPhysical\n·\nAbility to operate computer & keyboard\n·\nAbility to sit in front of CRT monitor for long periods of time\n·\nAbility to open/manipulate/distribute mail and paperwork.\n·\nAbility to perform some lifting as required (up to 25 pounds).\n·\nAbility to load/unload supplies as required.\nReports To:\nSVP eCommerce\nFor reasonable accommodation information for an ADAAA qualified disability please see Belk Associate Handbook for policy and procedures.\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=5372",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-eCommerce-Executive-Administrative-Assistant/5372"
    },
    {
        "title": "IT Solutions Architect- Integration",
        "description_html": null,
        "description_text": "IT Solutions Architect- Integration\nCharlotte, NC, United States\nRef#:\n1085006\nDate published:\n4-May-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nCharlotte, N.C.-based Belk, Inc. (www.belk.com) is the nation’s largest family owned and operated department store with more than $4 billion in sales and 300 Belk stores located in 16 Southern states and a growing digital presence on belk.com. Founded on May 29, 1888 by William Henry Belk in Monroe, N.C., the company is in the third generation of Belk family leadership. Our mission is to satisfy the modern Southern lifestyle like no one else, so that customers get the fashion they desire and the value they deserve. Our vision is for the modern Southern woman to count on Belk first – for her, for her family, for life.\nBelk has been committed to community involvement since its inception and today gives 2.5 percent of its pretax income back to the communities it serves. During the past fiscal year the company and its associates, customers and vendors donated more than $20.9 million to those communities.\nEssential Functions/Responsibilities:\nPosition Summary:\nThe Senior Application Architect specializing in ESB technology is responsible for comprehensive technical design, implementation, administration, and support of the ESB and related integration for Belk IT. This includes all aspects of ESB design, install, creation, administration, tuning, and support.\nEssential Functions/Responsibilities:\n•Solid organizational and planning skills: Detail oriented to manage customer requirements, product understanding and ongoing management. Is multi-task oriented to meet deadlines\n•Leadership Skills: Is comfortable performing as technical and work stream lead for ESB technology. Has a positive leadership style.\n•Action-oriented: Must demonstrate a capacity to operate successfully in a fast paced, changing environment to make fact based decisions and implement recommendations quickly to drive for continuous improvement. Reacts to business trends in a timely and efficient manner, while ensuring continuity with strategic goals.\n•Analytical skills: Able to review data, determine conclusions, and take action on the next steps.\n•Communication skills: Ability to communicate effectively at all levels. Strong team building skills. Partners with others.\nRequirements/Qualifications:\n•At least 8 years of experience in WebSphere Message Broker, WebSphere MQ, WebSphere Data Power. Should have worked on Message Broker v7 or above. Knowledge and experience with Message Broker v8 is a plus.\n•End to End knowledge in requirements gathering, solution architecture, solution design, development, implementation and post implementation support.\n•At least 4 years’ experience leading Data Integration projects\n•Ability to understand Message Broker interfaces written in ESQL and Java is required.\n•Strong knowledge of XML, XSLT, SQL and FTP\n•Should have good experience of working with databases (Oracle and DB2)\n•Should have a strong understanding of the following concepts in Message Broker: a. WebServices with SOAP and HTTP nodes; b. MQ and file nodes; c. Message-sets & DFDL; d. Message domains like XML, MRM and BLOB (knowledge of DataObject domain is a plus); e. Exception handling and audit logging concepts; f. Using debugger and trace files for troubleshooting and testing; g. Logical message tree structure and specific use of Environment and LocalEnvironment sub-trees; h. Message parser concepts\n•Working knowledge of WebSphere Data Power is desirable\n•Ability to troubleshoot and fix complex WebSphere Message Broker and WebSphere Data Power interfaces in an Unix environment.\n•Ability to guide junior team members on ESB concepts\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=5373",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-IT-Solutions-Architect-Integration/5373"
    },
    {
        "title": "IT Solutions Architect- ESB",
        "description_html": null,
        "description_text": "IT Solutions Architect- ESB\nCharlotte, NC, United States\nRef#:\n1085008\nDate published:\n4-May-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nCharlotte, N.C.-based Belk, Inc. (www.belk.com) is the nation’s largest family owned and operated department store with more than $4 billion in sales and 300 Belk stores located in 16 Southern states and a growing digital presence on belk.com. Founded on May 29, 1888 by William Henry Belk in Monroe, N.C., the company is in the third generation of Belk family leadership. Our mission is to satisfy the modern Southern lifestyle like no one else, so that customers get the fashion they desire and the value they deserve. Our vision is for the modern Southern woman to count on Belk first – for her, for her family, for life.\nBelk has been committed to community involvement since its inception and today gives 2.5 percent of its pretax income back to the communities it serves. During the past fiscal year the company and its associates, customers and vendors donated more than $20.9 million to those communities.\nEssential Functions/Responsibilities:\nPosition Summary:\nThe Senior Application Architect specializing in ESB technology is responsible for comprehensive technical design, implementation, administration, and support of the ESB and related integration for Belk IT. This includes all aspects of ESB design, install, creation, administration, tuning, and support.\nEssential Functions/Responsibilities:\n•Solid organizational and planning skills: Detail oriented to manage customer requirements, product understanding and ongoing management. Is multi-task oriented to meet deadlines\n•Leadership Skills: Is comfortable performing as technical and work stream lead for ESB technology. Has a positive leadership style.\n•Action-oriented: Must demonstrate a capacity to operate successfully in a fast paced, changing environment to make fact based decisions and implement recommendations quickly to drive for continuous improvement. Reacts to business trends in a timely and efficient manner, while ensuring continuity with strategic goals.\n•Analytical skills: Able to review data, determine conclusions, and take action on the next steps.\n•Communication skills: Ability to communicate effectively at all levels. Strong team building skills. Partners with others.\nRequirements/Qualifications:\n•At least 8 years of experience in WebSphere Message Broker, WebSphere MQ, WebSphere Data Power. Should have worked on Message Broker v7 or above. Knowledge and experience with Message Broker v8 is a plus.\n•End to End knowledge in requirements gathering, solution architecture, solution design, development, implementation and post implementation support.\n•At least 4 years’ experience leading Data Integration projects\n•Ability to understand Message Broker interfaces written in ESQL and Java is required.\n•Strong knowledge of XML, XSLT, SQL and FTP\n•Should have good experience of working with databases (Oracle and DB2)\n•Should have a strong understanding of the following concepts in Message Broker: a. WebServices with SOAP and HTTP nodes; b. MQ and file nodes; c. Message-sets & DFDL; d. Message domains like XML, MRM and BLOB (knowledge of DataObject domain is a plus); e. Exception handling and audit logging concepts; f. Using debugger and trace files for troubleshooting and testing; g. Logical message tree structure and specific use of Environment and LocalEnvironment sub-trees; h. Message parser concepts\n•Working knowledge of WebSphere Data Power is desirable\n•Ability to troubleshoot and fix complex WebSphere Message Broker and WebSphere Data Power interfaces in an Unix environment.\n•Ability to guide junior team members on ESB concepts\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=5376",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-IT-Solutions-Architect-ESB/5376"
    },
    {
        "title": "Strategic Sourcing Analyst",
        "description_html": null,
        "description_text": "Strategic Sourcing Analyst\nCharlotte, NC, United States\nRef#:\n1084966\nDate published:\n28-Apr-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nThe Strategic Sourcing Analyst supports the Category Managers as they engage cross functional teams in enterprise-wide strategic sourcing initiatives.  The Strategic Sourcing Analyst assesses the elements of the spend category and helps to define, execute, and support the strategic sourcing and refinement of that spend area through extensive financial analysis and market research.  Can work independently taking a proactive approach in assigned commodities supporting the Sourcing team in ensuring Strategic Sourcing’s value commitment to internal business partners is met.\nAnalyst is also responsible for administering any/all sourcing programs that are within multiple functional areas.  Includes, but not limited to, ensuring compliance against the sourcing process, making adjustments to existing programs to enhance profitability, efficiency, and/or controls, proactively making modifications to programs to address macro-changes in the business, acting as the main contact with external business partners.\nEssential Functions/Responsibilities:\nWorks closely with Category Managers to perform strategic sourcing activities\nConducts accurate financial analysis of comparative bids\nLeads the collection, analysis, and total cost ownership analytical activities\nDevelops forward looking pricing forecast models\nWorks with Finance to calculate savings against budget and forecast\nInterviews internal stakeholders to develop service specification levels\nCompletes supply market research and presents learnings from  research/analysis\nCollects data and prepares monthly sourcing reports\nExecutes low risk / low dollar supplier contracts / events\nRequirements/Qualifications:\nBachelors degree and/or equivalent years of experience\n2 or more years of applicable experience\nProven strong research and analytical skills\nProven financial analysis skills – proficient in Essbase\nProven understanding of financial planning in budgeting and forecasting\nA high proficiency in business communications both written and oral\nProven interpersonal, meeting/interview facilitation and team skills\nProven ability to multi-task, manage time and be flexible to function in ambiguous and/or time-sensitive situations\nSelf-directed, requiring limited guidance and/or structure\nAptitude for conducting supply market research\nExcellent PC skills: Essbase, Lawson, Excel, Access, Powerpoint, Microsoft Word\nMust be detail-oriented; organized; team player; self-motivated; creative and persuasive\nMust be open to and comfortable with change\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=5333",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-Strategic-Sourcing-Analyst/5333"
    },
    {
        "title": "IT Sr. Financial Analyst",
        "description_html": null,
        "description_text": "IT Sr. Financial Analyst\nCharlotte, NC, United States\nRef#:\n1084895\nDate published:\n24-Apr-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nProvide experience and leadership in the management of capital and expense budgeting in the information technology area.\nHolds primary responsibility for the compilation of capital and expense budgets, forecasting of multi-year Capital and Expense spend. Assists with vendor contract management activities for IT services, software, and maintenance.\nWorks with all IT teams to ensure business solutions are budgeted and capital and expense items are accounted for correctly.\nEssential Functions/Responsibilities:\n1.\nHolds Primary responsibility for development, management and tracking of all IT capital and expense budgets, including creation, forecasting, and accruals.\n2.\nIdentify, quantify and assist in implementing expense savings ideas.\n3.\nServes as financial point person in IT for all functional and operational IT teams.\n4.\nReviews and validates all invoices from our Outsource providers or other 3\nrd\nparties.\n5.\nDevelops, publishes and maintains monthly forecasts for the Belk IT Organization as a whole.\n6.\nResearches hardware and software maintenance contracts as they come up for renewal to ensure that licenses are appropriate and that terms and conditions are optimized for Belk.\n7.\nCollaborates with Applications Development Directors, Managers, Outsource Suppliers and consultants on contracts for new systems solution hardware, software, and services.\n8.\nCreates purchase order requisitions and insures that any created outside of IT are consistent with approved budget items.\n9.\nReviews and advises IT teams in the creation of project cost/benefit worksheets and ITRB scorecards.\nOversee compliance to SOP-98, Sarbanes Oxley and other accounting/finance regulations. Produce quarterly reports for SOX compliance.\nRequirements/Qualifications:\n·\nFour-year degree\n·\n6+ years experience as financial analyst in IT-related area (preferably retail)\n·\nDemonstrated knowledge of capital and expense budgeting, software licensing, maintenance contracts, and contract language.\n·\nStrong written and verbal communication, organization and time management skills\n·\nExceptional analytical and problem solving skills\n·\nAbility to work well within a team environment as well as independently as the situation demands\n·\nAbility to produce complex modeling and analysis using Excel spreadsheets using Pivot tables, vLookups etc.\n·\nFamiliarity with Excel Macros is desired.\n·\nKnowledge of Hyperion Planning, Essbase, and Lawson financials is desired\nFor reasonable accommodation information for an ADAAA qualified disability please see Belk Associate Handbook for policy and procedures.\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=5262",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-IT-Sr-Financial-Analyst/5262"
    },
    {
        "title": "IT eCommerce Tech Lead",
        "description_html": null,
        "description_text": "IT eCommerce Tech Lead\nCharlotte, NC, United States\nRef#:\n1084898\nDate published:\n24-Apr-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nThe role of the Sr. Systems Analyst (Tech Lead) - eCommerce is to provide technical expertise related to various eCommerce applications. This role will work closely with the eCommerce Application Architect, development manager and support manager on all technology issues and development projects. This role will be the owner of a number of applications in the eCommerce area for all support and enhancements. This role will be the technical subject matter expert for assigned eCommerce applications. This role will work with Business Analysts and business team to help define business requirements for new development and any support related changes.\nThe role requires proven experience with designing, implementing and maintaining eCommerce applications preferably using Java Spring - based platforms integrating with various Enterprise Services (Price/Promotion/Inventory and Order fulfillment).\nThe role will need to work with other application teams to define and implement any required interfaces for Product Information and Order Fulfillment using Web services/REST/MQ and file base interfaces\nThis role will also be primarily responsible and will work with internal and external vendor teams for all code deployment, source control, Quality/Performance testing for assigned applications from eCommerce application area.\nThe position requires knowledge of and hands-on experience with, eCommerce application tiers, concepts, processes, technology, and tools. This includes the following:\nJava Spring based eCommerce platform implementation in various modules Profile Management, Check out and Payment services\nExperience in Design and code review and put a structure/checklist in place to measure code quality\nObject oriented design patterns to support scalability and performance\nJava/J2EE programming including distributed caching\nIntegration tools like MQ and API services (REST)\nExperience with Service Oriented Architecture\nExperience with application integration using Enterprise Service Bus\nExperience with IBM Websphere Message Broker\nExperience with IBM Websphere Service Registry and Repository\nDatabase Software like Oracle, DB2, UDB etc.\nDatabase utilities like TOAD, SQLPlus and Oracle tools\nOperating Systems like Solaris, Linux, AIX, i5OS, mainframe zOS, Windows etc.\nOperating System level scripting tools like Shell scripts, PERL scripts, Batch programming etc.\nSource control and version management tools like CVS/SVN\nBuild and Release management tools like Hudson, Apache Ant\nWeb Analytics tools like Coremetrics, Omniture\nApplication Performance Monitoring Tools like CA-Wily, Tealeaf, and Dynatrace\nPerformance/availability monitoring tools/services like Gomez, Keynote\nLoad testing tools/services like QC/QTP, SOASTA and Gomez\nUnderstanding of front-end tools like Javascript, JSON, CSS, AJAX\nEssential Functions/Responsibilities:\n1. 5+ years of Java Spring development and implementation experience\n2. Maintain and manage the source control repository for assigned applications\n3. Work with business analysts and business team to define technically feasible requirements\n4. Work with Application Architect to analyze and implement appropriate tools/services to improve Belks eCommerce application portfolio for assigned applications\n5. Responsible for delivering the design and development phases of the project for assigned projects\n6. Work with internal and external vendor teams on all support/enhancement/project related activities\n7. Working with support team on day to day support activities\n8. Working with support team on small enhancements\n9. Deploy all support fixes, small enhancements and major projects to production environment for assigned applications\n10. Provide stability and improve performance for assigned applications\n11. Work with various parties to make all assigned eCommerce applications better to enhance customer experience and positively impact eCommerce sales.\nRequirements/Qualifications:\nRequired Education, Experience and Skills\nBachelor's degree in Computer Science, Information Systems, Electrical Engineering or similar field.\n7+ years experience as Systems Analyst, Technology Lead or other similar technology position in eCommerce application area in retail eCommerce space.\nStrong SDLC experience and application architecture/design background.\n3-5 years experience preferably in the retail and consumer products industry.\nDetailed functional understanding of eCommerce applications, interfaces and business processes.\nFor reasonable accommodation information for an ADAAA qualified disability please see Belk Associate Handbook for policy and procedures.\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=5265",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-IT-eCommerce-Tech-Lead/5265"
    },
    {
        "title": "IT Sr. Systems Analyst (Tech Lead) - Payment Systems",
        "description_html": null,
        "description_text": "IT Sr. Systems Analyst (Tech Lead) - Payment Systems\nCharlotte, NC, United States\nRef#:\n1084904\nDate published:\n24-Apr-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nThe role of the Sr. Systems Analyst – Payment Systems is to provide technical expertise related to various Payment applications. This role will work closely with the delivery manager, Project manager, and Business System Analysts on all technology issues and development projects. This role will be the technical subject matter expert for assigned Payment applications. This role will work with Business Analysts and business team to help define business requirements for new development and any support related changes.\nThe role will need to work with other application teams to define and implement any required interfaces to third party systems and mainframe based applications.\nThis role will also be primarily responsible planning and implementing payment system deployments.\nEssential Functions/Responsibilities:\n·\nWork with business analysts and business team to define and document technically feasible requirements\n·\nWork with Application Architect to analyze and implement appropriate tools/services to improve Belk’s payment application portfolio\n·\nResponsible for delivering the design and deployment artifacts and plans for assigned projects\n·\nWork with internal and external vendor teams on all support/enhancement/project related activities\n·\nWorking with support team on day to day escalated support needs\n·\nDeploy all support fixes, small enhancements and major projects to production environment for assigned applications\n·\nProvide suggestions for stability and improve performance for assigned applications\nRequirements/Qualifications:\nBachelor's      degree in Computer Science, Information Systems, Electrical Engineering or      similar field.\n7+ years      experience as Systems Analyst, Technology Lead or a other similar      technology position – supporting applications.\nStrong SDLC      experience and application architecture/design background.\n3-5 years      experience preferably in the retail and consumer products industry.\nDetailed functional      understanding of payment systems, and PCI, EMV experience a plus.\nFor reasonable accommodation information for an ADAAA qualified disability please see Belk Associate Handbook for policy and procedures.\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=5271",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-IT-Sr-Systems-Analyst-Tech-Lead-Payment-Systems/5271"
    },
    {
        "title": "Assistant Textile Designer - Private Brands",
        "description_html": null,
        "description_text": "Assistant Textile Designer - Private Brands\nCharlotte, NC, United States\nRef#:\n1084878\nDate published:\n22-Apr-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nResponsible for creation, development and execution of artwork that achieve Belk Private Brand’s objectives, and overall product strategy. Participate in research and development of seasonal trends and ensure that designs meet merchant line plans, assortment strategies, price points, and overall creative direction.\nEssential Functions/Responsibilities:\nEssential Functions:\nStrong fashion sense and ability to translate merchant/ market input into highly salable product.\nCreate and present textile design concepts to Apparel Design, Product Management, Merchant Teams, Trend Department, and Vendor partners.\nCreate artwork for new private brand styles.\nApply understanding of design process and Private Brands/Merchant’s business objectives to ensure consistency and drive financial results.\nCollaborate with Apparel Design, Product Management, Overseas Offices, Merchandising, Trend Department, Technical Design/QA, and Vendors to achieve product execution and maintain design integrity.\nProduce cohesive textile design presentations to sell concept to entire team, including boards, tear sheets and samples.\nEvaluate all meeting and production samples with extended Private Brand team.\nParticipate as a member of Private Brand team for continual improvement of product.\nRequirements/Qualifications:\nPosition Requirements:\nBS/BA degree with a major in Textile/Surface Design or closely related focus.\n2-5 years textile design experience in related field or equivalent experience.\nDemonstrated Creative ability.\nMust have experience with the current design software products i.e. Photoshop, Kaledo, Illustrator.\nProven textile design experience in a given category.\nKnowledge of print development techniques and printing technology currently used throughout the industry.  Must be able to translate these to various types of textiles.\nMust have strong working knowledge of knit and woven textiles as they pertain to the textile design process.\nAbility to work well independently and as part of a team.\nAbility to research and apply market/trend information.\nGood communication skills.\nReports Directly to:\nTextile Designer\nFor reasonable accommodation information for an ADAAA qualified disability please see Belk Associate Handbook for policy and procedures.\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=5245",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-Assistant-Textile-Designer-Private-Brands/5245"
    },
    {
        "title": "IT QA Improvement and Process Compliant Manager",
        "description_html": null,
        "description_text": "IT QA Improvement and Process Compliant Manager\nCharlotte, NC, United States\nRef#:\n1084854\nDate published:\n21-Apr-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nCharlotte, N.C.-based Belk, Inc. is the nation’s largest family owned and operated department store with more than $4 billion in sales and 300 Belk stores located in 16 Southern states and a growing digital presence on belk.com. Founded on May 29, 1888 by William Henry Belk in Monroe, N.C., the company is in the third generation of Belk family leadership. Our mission is to satisfy the modern Southern lifestyle like no one else, so that customers get the fashion they desire and the value they deserve. Our vision is for the modern Southern woman to count on Belk first – for her, for her family, for life. Belk has been committed to community involvement since its inception and today gives 2.5 percent of its pretax income back to the communities it serves. During the past fiscal year the company and its associates, customers and vendors donated more than $20.9 million to those communities.\nEssential Functions/Responsibilities:\nThe QA Improvement and Process Compliant Manager demonstrates up-to-date expertise in Software Development Methodologies (SDLC), Testing Methodologies (TLC) and the development and execution of IT Process Compliance Audit plans, metrics and reporting.  They will use their knowledge of IT processes to review in-flight initiatives, to develop a perspective on the quality of the deliverables, and adherence to Belk IT processes.  They will prepare reporting to show compliance to processes and recap to executive management quality risks to projects and programs.\nThe QA Improvement and Process Compliant Manager will be a leader in project discussions and an organizational advocate for quality and process improvement and will have the ability to negotiate solutions as to not compromise quality but still meet project objectives, timelines and budgets.  A high degree of self-organizational and negotiation skills will be required to manage compliance activities across multiple projects and communicate status to all levels of the organization.\nEssential Functions\nAbility to perform the following across large scale, strategic IT initiatives and multiple tactical projects:\n•Research, recommend, develop and maintain processes and documentation for Belk’s Testing Lifecycle (TLC)\n•Implement approved quality process improvements and enhancements\n•Develop risk based approach on how to engage projects and programs for deliverable review and SDLC and TLC process compliance\n•Develop, communicate and execute independent review/audit plans for projects and programs based on risk\n•Based on risk, review Software Development Lifecycle (SDLC) and project (PMO) deliverables for completeness and accuracy, identifying gaps and ambiguities, drive for revision with artifact owners to improve the quality of the deliverable\n•Based on risk, review Testing Lifecycle (TLC) deliverables for completeness and accuracy, identifying gaps and ambiguities, drive for revision with artifact owners to improve the quality of the deliverable\n•Work with development, PMO and QA teams to drive the resolution of identified quality issues\n•Develop and enhance existing reporting to highlight product and process quality for projects, programs and an organizational roll up\n•Supervise process improvement and audit/review activities and deliverables using contract staff\n•Plan, communicate and interact with all levels of IT and business users and management\n•Perform ad-hoc analysis and reporting as requested\n•Develop resource plans and budgets for process improvement and review/audit activities\nRequirements/Qualifications:\n•Bachelor’s Degree in Information Systems, Business Administration, Computer Science or other relative Technical Degree (equivalent work experience will be considered in lieu of degree)\n•8+ years related experience with a strong understanding of SDLC and Testing Methodologies\n•10+ years working in an IT environment\n•Ability to develop, communicate and execute plans keeping key stakeholders informed of progress\n•Ability to mitigate risk and independently remove roadblocks to success\n•Effective organizational and negotiation skills\n•Effective analytical and problem-solving skills\n•Experience managing and leading contract teams\n•Experience designing, implementing and measuring the effectiveness of process improvement activities\n•Ability to act quickly in a crisis situation to make decisions and keep key constituents informed of the situation\n•Proficient in the use of Microsoft Office Products: Word, PowerPoint, Excel and Project\n•Excellent verbal and written communication and presentation skills with the ability to communicate technically and in business terms when required\nPreferred Education, Experience and Skills\n•Knowledge and experience working in an IT department within a Fortune 500 retail company\n•Prior experience working in a quality management or quality assurance organization\n•Prior experience working in an IT or Internal Audit organization\n•Experience with IT industry frameworks such as PMBOK, BABOK, CMMI, TPI, ISO, ITIL, etc.\n•Experience with HP Quality Center defect management software\nCompetencies\n•Ability to communicate technically and non-technically\n•Organizes and executes work to goals and end dates; demonstrates a sense of urgency around problems\n•Excellent relationship management skills\n•Proven resource management skills\n•Process and customer service focused\n•Organize, manage and track multiple detailed tasks and assignments with frequently changing priorities in a fast-paced work environment.\n•Promoting effective coordination between work groups\n•Develop processes and procedures for efficient and timely work flow\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=5221",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-IT-QA-Improvement-and-Process-Compliant-Manager/5221"
    },
    {
        "title": "Internal Audit Manager",
        "description_html": null,
        "description_text": "Internal Audit Manager\nCharlotte, NC, United States\nRef#:\n1084831\nDate published:\n20-Apr-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nInternal Audit supports the company’s enterprise risk management and internal control activities by conducting audits, performing special projects, advising policy and internal control design and processes, and other consultative and investigative efforts.  The manager of internal audit is responsible for project planning, business process risk assessments, developing audit procedures, and managing the execution of financial, operational, and compliance and other special projects as needed.\nEssential Functions/Responsibilities:\nPlan and conduct business process, application, and fraud risk assessments.\nDevelop and lead the execution of audit procedures regarding Sarbanes Oxley objectives and risk based audits that evaluate the design and effectiveness of internal controls, accuracy and timeliness of financial information, effectiveness and efficiency of business operations, compliance with external and internal guidelines (including laws, regulations, policies), special investigations, etc.\nPrepare and review staff developed audit documentation, ensuring department standards are met\nConclude upon audit results, communicating in both written and verbal formats ensuring conclusions are factual, accurate, and complete\nDevelop recommendations and assist management in developing responses to address audit issues in a timely fashion\nProvide timely status updates to internal audit leadership and auditees to ensure timely project completion and recommend actions to overcome obstacles\nLead, train, supervise, and provide performance feedback to direct reports\nRequirements/Qualifications:\nBachelors degree and/or equivent years of experience\nSpecific Certifications: Any one of the following - CPA, CIA, CFE\nSpecific Training: ACL data analytics software\n6 or more years of applicable experience\nSpecific work or project experience: Internal Audit, External Audit, Accounting, Sarbanes Oxley  or other Compliance auditing\nIndustry experience: Direct to consumer industries\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=5198",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-Internal-Audit-Manager/5198"
    },
    {
        "title": "Manager - College Relations and Employment Branding",
        "description_html": null,
        "description_text": "Manager - College Relations and Employment Branding\nCharlotte, NC, United States\nRef#:\n1084832\nDate published:\n20-Apr-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nThe Manager - College Relations and Employment Branding will plan, coordinate, implement and continuously improve the company-wide college-recruiting program.  This position will focus on internship programs and the recruitment of full-time college graduates to support the growth of the organization as well as the overall employment brand for the company.  This position will work closely with all levels of management in designing, implementing and executing the college-recruiting program.\nEssential Functions/Responsibilities:\nPartner with leadership to gain detailed understanding of organizational goals and needs\nGrow company’s current campus recruiting programs – building a strategy that aligns with business’ talent needs and diversity goals\nDirectly recruit for both development programs and entry level positions as business needs require\nManage budget including developing proposals and monitoring expenditures.\nCreate and foster relationships with colleges, universities and professional organizations\nLead campus recruiting efforts related to corporate diversity initiatives\nProvide strategic recruiting expertise by staying abreast of industry trends, best practices, legal developments, technological advancements and competitive benchmarking.\nMeasure and analyze key metrics around campus recruiting efforts (according to NACE or EMA recruiting metric standards)\nRepresent the organization on various college panels and advisory boards, job fairs, interview days, information sessions and other recruitment related events.\nCoordinate business involvement in campus events – identify recruiting champions.\nWork with marketing and special events around employment-brand specific opportunities.\nResponsible for developing, executing and monitoring recruitment social media channels.\nWork closely with corporate recruiters to ensure continuity of all recruiting efforts\nAssist with the development of on-boarding and assimilation processes that support talent retention and set new hires up for success.\nManage Employment Branding initiatives from design to delivery.\nAbility to travel at least 50% of the time, and up to 75% during peak seasons.\nPerform other job duties as assigned.\nRequirements/Qualifications:\nMinimum of 5 years of recruiting experience in a large corporate environment, ideally focused on campus programs\nMinimum of 3 years supervisory experience\nPrior experience in budgeting and program management\nProven experience in developing campus recruiting strategies to include internship programs and college grads\nProven ability  track and measure recruiting results\nProven ability to develop internal and external relationships with senior leaders/executives and collaborating and building relationships across functional and organizational lines\nDemonstrated working knowledge of full lifecycle recruiting components\nProven ability to communicate effectively\nAbility to think strategically and to develop programs and processes with minimal direction\nBachelor’s degree\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=5199",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-Manager-College-Relations-and-Employment-Branding/5199"
    },
    {
        "title": "eCommerce - Merchandise Manager - Digital",
        "description_html": null,
        "description_text": "eCommerce - Merchandise Manager - Digital\nCharlotte, NC, United States\nRef#:\n1084668\nDate published:\n7-Apr-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nPosition Summary\nThe principle purpose of the Digital Merchandise Manager is to drive the strategy and business results of an assigned online category of business with the goal of meeting/exceeding sales, turn and margin.  The Digital Merchandise Manager is responsible for optimizing customer experience through digital marketing and site presentation.\nEssential Functions/Responsibilities:\nMajor Responsibilities\n·\nResponsible for eCommerce sales, turn and margin goals as well as total company sales for a category of business.\n·\nDevelop and manage assortment plans and ensure proper inventory flow, item depth and size/color penetrations to support strategy.\n·\nComplete and review OTB monthly and partner with buying teams to maintain appropriate inventory levels.\n·\nIdentify and execute drop ship and online only vendor, category and item opportunities to expand breadth of assortment.\n·\nIdentify in season opportunities through sales performance analysis and provide informed recommendations to buyers.\n·\nWork closely with Product Managers to ensure effective brand marketing and online merchandising while recommending and maintaining appropriate inventory levels.\n·\nDevelop and execute marketing strategies for weekly promotions, brand boutiques, seasonal shops and brand launches to drive online and enterprise sales.\n·\nComplete all steps of advertising process in collaboration with Digital Experience team to ensure effective promotional gels, emails, mobile, interactive and social campaigns.\n·\nSupport corporate and emerging trends with marketing and site content.\n·\nComplete competitive analysis on vendor matrix, assortment composition, site content and trends.\n·\nAnalyze and react to key site metrics to optimize customer experience and drive sales, conversion and AOV.\n·\nMerchandise site for best customer experience through Endeca boost & bury, taxonomy maintenance and search optimization.\n·\nPartner with IT team\nto report site and workflow issues. Partner on future ideas, strategies and projects to continually improve sales, user experience and site optimization.\nBehavioral Traits\nCommunicate effectively\nPossess strong merchandising and marketing skills\nDemonstrate strong analytical and problem solving skills\nHighly organized and able to multitask\nAdaptable to shifting circumstances in a business environment\nBuild and maintain productive relationships with peers and members of the merchant team\nDemonstrate leadership and decision-making skills\nDemonstrate strong listening, written and oral communication skills\nWilling to travel\nManagement Practices\nMaintain professionalism in work relationships and habits\nProvide direction, training, and development for direct reports\nDevelop creative solutions to business issues\nWork effectively with staff and BSS management to achieve sound financial and merchandising solutions based on analysis, input and experience\nInternal/\nExternal Relationships\nDigital Management Team\nDigital Experience and Content Teams\nPrivate Brands\nVendors\nBuying & Planning Teams\nIT\nFulfillment Center\nRequirements/Qualifications:\nPosition requirements\nBachelor’s degree required.\n3+ years retail experience as an Associate Buyer, Assistant Buyer, Planner, Assistant Planner or Web Merchant.  Ecommerce experience preferred.\nUnderstanding of online search and online marketing a plus.\nProficient in business-related computer software (Microsoft Windows, Word, Excel, Endeca, Coremetrics or other web analytic software package, etc.)\nExcellent analytical and reasoning skills including clear retail math skills.\nSolid organization, written and verbal communication skills a must.  The Digital Merchandise Manager must be able to handle a heavy workload and prioritize multiple projects.\nAbility to work in a deadline-driven environment and must be able to work both independently and as a team player to execute the merchandising vision.\nProven project management and vendor management experience.\nPhysical\nAvailable and able to travel as needed.\nAble to see and distinguish colors.\nReports Directly To\nDirector of Digital Merchandising\nFor reasonable accommodation information for an ADAAA qualified disability please see Belk Associate Handbook for policy and procedures.\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=5035",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-eCommerce-Merchandise-Manager-Digital/5035"
    },
    {
        "title": "IT Manager Operations",
        "description_html": null,
        "description_text": "IT Manager Operations\nCharlotte, NC, United States\nRef#:\n1084681\nDate published:\n7-Apr-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nCharlotte, N.C.-based Belk, Inc. (www.belk.com) is the nation’s largest family owned and operated department store with more than $4 billion in sales and 300 Belk stores located in 16 Southern states and a growing digital presence on belk.com. Founded on May 29, 1888 by William Henry Belk in Monroe, N.C., the company is in the third generation of Belk family leadership. Our mission is to satisfy the modern Southern lifestyle like no one else, so that customers get the fashion they desire and the value they deserve. Our vision is for the modern Southern woman to count on Belk first – for her, for her family, for life.\nBelk has been committed to community involvement since its inception and today gives 2.5 percent of its pretax income back to the communities it serves. During the past fiscal year the company and its associates, customers and vendors donated more than $20.9 million to those communities.\nEssential Functions/Responsibilities:\nThe IT Operations Manager reports to our IT Operations Director and is a versatile, highly visible leader responsible for leading insourced and outsourced teams engaged in Computer Operations, Production Control, and ITIL Process Management for Belk Information Technology.\nThe manager prioritizes, guides, directs and monitors all operational and ITIL based work efforts for Belk Information Technology.  This includes ITIL based functions and processes such as Change Management, Incident and Problem Management, Enterprise Monitoring, Asset Management, Batch Scheduling, Source Code Management, Production Control, and others.  Manage technical resources responsible for administration and operation of Enterprise Foundation Tools (CA Suite) and ensure standards and processes are appropriate and effective for Belk IT.\nE\nssential Functions\n•Process Improvement – constantly evaluates the status quo to determine operational or customer focused improvements that can be made.  Defines to be processes and drives them to implementation.  Measures the success they have had on operational metrics.\n•Enterprise Foundation Tools – Administer, support, maintain, and operate Enterprise Foundation Tools (CA Suite) and related processes for Belk IT.\n•Root Cause Analysis – Analyze critical or recurring problems to assure the Root Cause is identified and long term solutions are planned, executed and then monitored to permanently resolve the issue.\n•Problem Management – Manage and monitor problem management teams, queues and service level agreements to assure problems are being resolved.  Analyze problem trends and take appropriate action to address and eliminate.\n•Relationship Management – Build partnerships with IT Delivery, Shared Services Managers and third party service providers.\n•Asset Management – Works with the infrastructure architecture team to define end user computing needs and define desktop solutions accordingly.  Tracks end user computing hardware and software assets to assure licensing compliance and drive expense savings through appropriate coverage.\n•Change Management – Manage Production Control and Change Management processes for Belk Information Technology.\n•Communication – can communicate in both a technical and non-technical manner.  Must be able to listen and understand technical problems and issues and communicate them and their status for resolution to a non-technical audience.  Must ask probing questions to support associates to assure problem is fully understood and the correct course of action is being taken.\nRequirements/Qualifications:\nBachelor’s Degree in Information Systems, Business Administration, Computer Science or other\nrelative Technical Degree (equivalent work experience will be considered in lieu of degree)\n•At least 10 years experience working in an IT department\n•At least 3 years experience directly managing end user and infrastructure support teams\n•Experience developing strategic and tactical plans to meet operational support strategies, goals and objectives\n•Experience developing and managing operational budgets in excess of $10MM annually\n•Experience managing outsourced teams, or contract teams to deliver end user support\n•Experience analyzing, designing, implementing and measuring the effectiveness of process improvement activities\n•Ability to act quickly in a crisis situation to make decisions and keep key constituents informed of the situation\n•Proficient in the use of Microsoft Office Products: Word, PowerPoint, Excel and Project\n•Excellent verbal and written communication and presentation skills\nPreferred Education, Experience and Skills\n•Knowledge and experience working in an IT department within a Fortune 500 retail company\n•ITIL Service Desk framework experience\nCompetencies\n•Ability to communicate technically and non-technically\n•Organizes and executes work to goals and end dates; demonstrates a sense of urgency around problems\n•Excellent relationship management skills\n•Proven financial responsibility\n•Process and customer service focused\n•Organize, manage and track multiple detailed tasks and assignments with frequently changing priorities in a fast-paced work environment.\n•Promoting effective coordination between work groups\n•Establish operational strategy, goals and objectives\n•Develop processes and procedures for efficient and timely work flow\nPhysical\n•Ability to operate a PC\n•Ability to manipulate a keyboard\n•Ability to sit for long periods of time in an office environment\nOther Duties and Responsibilities\n•Follow any job-related instructions requested by supervisor or management.\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=5048",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-IT-Manager-Operations/5048"
    },
    {
        "title": "eCommerce - Executive Assistant",
        "description_html": null,
        "description_text": "eCommerce - Executive Assistant\nCharlotte, North Carolina, United States\nRef#:\n1084534\nDate published:\n25-Mar-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nSupports Vice President/Senior Vice President      by providing administrative support; completing special projects; working      with the management team.\nEssential Functions/Responsibilities:\nEssential Functions/Responsibilities:\n·\nAccomplishes organizational objectives by supporting corporate standards and procedures\n·\nAnswering telephones and emails, delivering reports and various other duties, such as scheduling meetings and note taking in meetings.\n·\nResponsible for collecting, assimilating, and sending out the eCommerce Weekly Business Notes to Belk executive management.\n·\nCompletes special projects; responds to inquiries, reviews and summarizes materials and data; prepares slide presentations for special meetings.\n·\nIn support of manager, maintains calendar; schedules travel for the Merchandising and Planning teams; completes expense reports.\n·\nMaintains the travel budget for the eComm Merchandising and Planning teams.\n·\nCompletes a variety of other tasks as required for the eCommerce merchandising and planning teams.\n·\nActs as a backup for Timekeeping, Onboarding, and supply ordering for eCommerce.\nRequirements/Qualifications:\nPosition Requirements\nQualifications:\no\nExperience using database, spreadsheet, and word-processing software to prepare various versions of statistical and written summary reports for different levels of management.\no\nExcellent computer skills, including MS Word, Excel, and PowerPoint.  Knowledge of the Internet is useful for retrieving information on various companies, sites, and products\no\nManages time effectively. Uses work plans to prioritize competing and interdependent tasks and meet deadlines.\no\nHave excellent organizational skills.  Keeps file and work area organized.  Maintains a comprehensive library of reference and historical data.\no\nProven ability to compose memos, correspondence, and other professional documents.\no\nPlans work.  Set goals and outlines tasks to achieve them.\no\nUses multiple resources and research methodologies to capture and interpret information.\no\nAbility to expand job responsibilities, suggests improvement, and collaborates with others to generate ideas and improve processes and communications.\no\nSkilled at analyzing causes of variances between actual and budgeted income and expenses\no\nBachelor Degree or Equivalent work experience.\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=4901",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-North-Carolina-United-States-eCommerce-Executive-Assistant/4901"
    },
    {
        "title": "IT Network Architect",
        "description_html": null,
        "description_text": "IT Network Architect\nCharlotte, NC, United States\nRef#:\n1084074\nDate published:\n23-Mar-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nCharlotte, N.C.-based Belk, Inc. (www.belk.com) is the nation’s largest family owned and operated department store with more than $4 billion in sales and 300 Belk stores located in 16 Southern states and a growing digital presence on belk.com. Founded on May 29, 1888 by William Henry Belk in Monroe, N.C., the company is in the third generation of Belk family leadership. Our mission is to satisfy the modern Southern lifestyle like no one else, so that customers get the fashion they desire and the value they deserve. Our vision is for the modern Southern woman to count on Belk first – for her, for her family, for life.\nBelk has been committed to community involvement since its inception and today gives 2.5 percent of its pretax income back to the communities it serves. During the past fiscal year the company and its associates, customers and vendors donated more than $20.9 million to those communities.\nEssential Functions/Responsibilities:\nThe Network Architect (NA) is a member of the Belk Infrastructure Engineering team and is responsible for leading the process that aligns our technology foundational components to business system initiatives.  The NA role is to coordinate, direct, and design network infrastructure activities as well as provide technology direction in support of the project and support teams.\nThe NA possesses a broad knowledgebase with a focus on strategic technologies including: Cisco Networking technologies including (LAN, WAN, SAN, VoIP, Wireless, Firewall), HP Networking, Palo Alto, Checkpoint and similar non-Cisco technologies.\nThe NA will also work with decision makers in other departments to identify, recommend, develop, implement, and support cost-effective technology solutions.  The NA will participate in overall IT planning, bringing a current knowledge and future vision of technology and systems.\nThe NA role works in close partnership with Belk’s Domain Architects, the Enterprise Architecture and Security teams aligning technical solutions to business and technology strategies. This position will be responsible for designing and delivering solutions which are fault tolerant, flexible, and scalable to support our development, test and production environments.\nThe scope of this position includes collaboration and participation with all IT Infrastructure core components; furthermore, the NA will be a liaison between Belk IT and Belk’s business partners, such as HP Enterprise Services, and will work collaboratively to maintain and operate all related systems in support of end-user access, performance, and stability.\nResponsibilities & Essential Functions\nThe duties and responsibilities listed below are intended to provide general guidelines and parameters for the job and are not intended to be a comprehensive, detailed description of the job.\n• Serves as network expert/lead and project leader of an enterprise network modernization effort\n• Responsible for high-level network planning, design, and optimization\n• Responsible for management of a network services team for operating, maintaining and enhancing an enterprise networking infrastructure environment\n• Responsible for network planning, network architecture design and engineering\n• Planning, forecasting, implementation, and identification of resource requirements for network systems\n• Proficiency in working in a cross collaboration teaming structure with other IT infrastructure teams, including data center, storage, service desk, security, and applications\n• Develops strategies and direction for network solutions and current and emerging technologies (wireless and VoIP)\n• Approves and modifies network design and architecture to ensure compliance\n• Translates business requirements into network or process designs\n• Integrates and schematically depicts communication architectures, topologies, hardware and software, transmission and signaling links and protocols into complete network configurations\n• Plans and recommends network hardware, systems management software and architecture\n• Configures and maintains routers, switches, and hubs for network systems (including wireless and VoIP)\n• Evaluates and recommends new products, maintains knowledge of emerging technologies for application to the enterprise\n• Monitors network performance, ensures capacity planning is performed, and is proactive in assessing and making recommendations for improvement\n• Provide technical assistance and knowledge during active network troubleshooting of the operational environment\n• Provide technical write-ups and root cause analysis in the event of network degradations, outages, or anomalies\n• Performs trouble shooting procedures and designs resolution descriptions\n• Monitor solutions and recommendations for compatibility with the IT Operations strategic direction.\n• Conduct risk assessments and business impact analysis to identify vulnerable areas and applications within the environment\n• Create and prioritize remediation plans\n• Review network operations designs to ensure that the infrastructure design continues to meet the needs of the business\n• Ensure best practices, standards and guidelines are applied in developing, designing/implementing solutions, establishing work priorities, resolving problems and reporting on project status\n• Assist in Development of SLAs for all organizational network and IP telephony applications\n• Recommend and implement disaster avoidance strategies and impact reduction strategies and process\n• Create and implement project plans, ensure adherence to project timelines, perform project risk assessment and develop contingency risk plans\n• Advanced knowledge of Wide Area Network (WAN) management and configuration principles\n• Advanced knowledge of networks, security guidelines and industry “best practices”\n• Advanced knowledge of LAN/WAN hardware devices, specifically Cisco Firewalls, Routers, and Switches\n• Advance knowledge or Palo Alto firewalls\n• Advanced skills in solving complex technical problems involving integrated operating systems and hardware platforms\n• Advanced skills in configuring and installing equipment to support LAN/WAN applications\n• Advanced skills in analyzing data and implementing solutions\n• Advanced skills in assessing and prioritizing multiple tasks, projects, and demands\n• Advanced skills in establishing and maintaining cooperative working relationships with other employees, telecom companies, vendors, and other organizations\n• Knowledge of a wide variety of operating and server systems\n• Understanding of Disaster Recovery concepts and applications\nAdditional Responsibilities\n• Special projects and other duties as assigned.\n• All employees are expected to be in compliance with government and corporate laws, rules, regulations, policies, and procedures.\nRequirements/Qualifications:\nBachelors degree and/or equivent years of experience\nSpecific Certifications: CCIE Certification or equivalent experience\nMinimum Experience:\n• 10 or more years of applicable experience\nPreferred:\n• Must have a minimum of 10+ years of data networking experience\n• Must have a minimum of 10+ years in enterprise project/program management and managing network and other IT infrastructure technical teams and projects\n• 10+ years experience - enterprise level network support, architecture, and design required.\n• 8+ years experience - enterprise level telephony support and design required.\n• Cisco VOIP experience and wireless networking experience required\n• Extensive experience with major enterprise network infrastructure migrations required\n• HP Procurve, 3 Com, or similar non-CISCO networking experience required\n• CISCO ASA Firewall Architecture, Design, migration and networking experience required\n• Checkpoint Firewall Architecture, Design, migration and networking experience highly desired\n• Deep technical knowledge working across multiple applications, operating systems and devices required\n• Strong knowledge of Storage Area Networking\n• Candidate should be an expert with multiple devices, operating systems and applications\n• Sense of urgency, ability to trouble shoot complex problems is required\n• All aspects of connectivity Cisco Nexus/IOS, VOIP, Video conferencing, 3G/4G, Wi-Fi, VPN, Citrix, ex. Brocade/Cisco Fiber Networking, etc.\n• Executive and technical level communication and presentation skills required\n• Must be able to remain current and possess knowledge of emerging technologies\n• Advises management of options, risk vs. cost, benefits and other impacts on Infrastructure technology solutions\n• Creates \"Position Statements\", \"Technical Approaches\" and \"Technical Designs\" documents as technology guidelines\n• Monitors and recommends current and future architecture trends\n• Communicates to, educates, and mentors colleagues\nKnowledge, Skills, and Abilities:\nMinimum Required:\n• Must be able to function collaboratively in a multi-vendor, outsourced environment\n• Must be able to think and act both strategically and tactically\n• Must possess strong interpersonal and communication skills.\n• Must be able to organize issues and prioritize in a fast paced environment with hard deadlines\n• Must be able to properly tailor communication to and work effectively with both business and technical teams.\n• Must be able to quickly identify and resolve issues and concepts.  Possess strong troubleshooting and problem solving skills\n• Must be a self-starter, be self-motivated, and able to effectively multi-task\n• Must be able to work independently, as a member of the Architecture team, and able to lead and mentor\n• Must be able to function collaboratively in a multi-vendor environment with Partners and Service Providers:\n• IBM Global Services\n• HP Enterprise Services\n• Windstream Hosted Solutions\n• Dynamix Group Inc.\n• All other providers of hardware, software and services to the Belk organization\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=4439",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-IT-Network-Architect/4439"
    },
    {
        "title": "IT Infrastructure Architect",
        "description_html": null,
        "description_text": "IT Infrastructure Architect\nCharlotte, NC, United States\nRef#:\n1084506\nDate published:\n23-Mar-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nCharlotte, N.C.-based Belk, Inc. (www.belk.com) is the nation’s largest family owned and operated department store with more than $4 billion in sales and 300 Belk stores located in 16 Southern states and a growing digital presence on belk.com. Founded on May 29, 1888 by William Henry Belk in Monroe, N.C., the company is in the third generation of Belk family leadership. Our mission is to satisfy the modern Southern lifestyle like no one else, so that customers get the fashion they desire and the value they deserve. Our vision is for the modern Southern woman to count on Belk first – for her, for her family, for life.\nBelk has been committed to community involvement since its inception and today gives 2.5 percent of its pretax income back to the communities it serves. During the past fiscal year the company and its associates, customers and vendors donated more than $20.9 million to those communities.\nEssential Functions/Responsibilities:\nThe Infrastructure Architect (IA) is a member of the Belk Infrastructure Engineering team and is responsible for leading the process that aligns our technology foundational components to business system initiatives.  The IA role is to coordinate, direct, and design project infrastructure activities as well as provide technology direction in support of the project and support teams.\nThe IA possesses a broad knowledgebase with a focus on strategic technologies including: IBM Power Systems, AIX, Linux, Sun Solaris, Power VM, VIOS, and Storage technologies.\nThe IA will also work with decision makers in other departments to identify, recommend, develop, implement, and support cost-effective technology solutions.  The IA will participate in overall IT planning, bringing a current knowledge and future vision of technology and systems.\nThe IA role works in close partnership with Infrastructure Engineering team aligning technical solutions to business and technology strategies. This position will be responsible for designing and delivering solutions which are fault tolerant, flexible, and scalable to support our development, test and production environments.\nThe scope of this position includes collaboration and participation with all IT Infrastructure core components; furthermore, the IA will be a liaison between Belk IT and Belk’s business partners, such as TCS, and will work collaboratively to maintain and operate all related systems in support of end-user access, performance, and stability.\nResponsibilities & Essential Functions\nThe duties and responsibilities listed below are intended to provide general guidelines and parameters for the job and are not intended to be a comprehensive, detailed description of the job:\n•Architect, Design, Engineer, Implement and provide technical support for Unix technologies (IBM Power Systems, Linux, Solaris) including hardware management, operating systems, network communications, transaction processing, testing, performance management, capacity planning, software management and other third party tools as required/needed, across dispersed datacenter locations\n•Sets technical standards and procedures across the enterprise for all strategic platforms.\n•Creates \"Position Statements\", \"Technical Approaches\" and \"Technical Designs\" documents as technology guidelines\n•Monitors and recommends current and future architecture trends\n•Communicates with, educates, and mentors colleagues\n•Perform and/or support the installation, upgrade, configuration, deployment, and administration of IBM Power Systems hardware and operating systems.\n•Analyzes and evaluates Power Systems operations and provides technical direction and recommendations to improve utilization. Implements automation procedures and tools to optimize staff and computing resources and their availability.\n•Knowledge of Cisco networking technologies and/or CA Monitoring and ITIL products is a plus\n•Must be able to remain current and possess knowledge of emerging technologies\n•Advises management of options, risk vs. cost, benefits and other impacts on Infrastructure technology solutions\nAdditional Responsibilities\n•Special projects and other duties as assigned.\n•All employees are expected to be in compliance with government and corporate laws, rules, regulations, policies, and procedures.",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=4873",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-IT-Infrastructure-Architect/4873"
    },
    {
        "title": "IT Business Systems Analyst - Store Systems",
        "description_html": null,
        "description_text": "IT Business Systems Analyst - Store Systems\nCharlotte, NC, United States\nRef#:\n1084523\nDate published:\n23-Mar-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nThe Business Systems Analyst (BSA) works as the liaison between IT and an assigned business area(s).\nThe role of the BSA is to build, demonstrate, and maintain a detailed knowledge of the business functions, processes and controls in place in the assigned business area.\nThe BSA must maintain a familiarity with current business issues, objectives, and strategies of the assigned area and recognize issues and opportunities to optimally apply technology to enhance existing or build new business capabilities.\nThe BSA works closely with business users and the IT Manager to identify, prioritize, and complete systems projects for the assigned area.\nThe BSA completes assigned projects of moderate to high complexity following assigned roles and documentation tasks from the Belk IT Operating Model and Systems Development Life Cycle (SDLC )including project definition / request; business cost and benefits preparation, requirements definition, review of design documents, user test planning and review, defect tracking, pilot, rollout, and project closure tasks.\nThe BSA applies the SDLC in a logical and reasonable manner identifying opportunities for tailoring the process to the specific project needs and obtaining approval for this tailoring with IT management and service providers.\nThe BSA provides input to portfolio management and\nproject management and planning activities.\nThis is done by providing estimates for BSA and user related tasks, assisting in documenting business or IT benefits, documenting project requests in IT standard tools/ practices, and providing input as to relative priority and benefits of project requests.\nThe BSA role is one that requires an ability to work independently and build and maintain strong working relationships with Belk IT service providers, and business users.\nThe BSA must be sensitive to the business and contractual relationships that Belk IT has with these organizations. The BSA role requires tact, diplomacy and strong written and verbal communication skills to address audiences from entry level to executive employees.\nBSA’s must demonstrate critical thinking skills, sound judgment, and an ability to\ninfluence others over whom there is no direct authority.\nEssential Functions/Responsibilities:\nBusiness      Research – Conduct research and analysis of the assigned business area and      functions both within Belk and across the retail industry.\nUnderstand all facets of and serve as an      SME for business operations and industry practices in assigned areas.\nPlanning – Carry      out detailed research within Belk and throughout the industry as a basis      for strategic and tactical systems planning.\nProject      Identification – Identify opportunities to address the systems aspects of issues,      objectives and strategies in the assigned business area.\nWork with the IT director to organize      these opportunities into logical manageable IT projects/ tasks.\nProject Planning/      Request – Translate abstract business requests into tangible manageable IT      projects with estimates, benefits and project approaches. Estimates and      re-estimates Belk project effort as project scope and degree of knowledge/      certainty changes as outlined in the Belk IT Operating Model.\nSDLC/Governance      - Comply with and demonstrate a sound knowledge of Belk’s systems      development methodology for assigned projects and tasks.\nAppropriately tailor SDLC based on IT      guidelines for project size and complexity. Strong adherence to Belk      governance and portfolio management practices is required.\nSystems      Requirements Definition –\nGather and analyzes business,      security, performance, and control needs from business and IT subject      matter experts and translates them into proper system requirement      specifications.\nFormally document and prioritize requirements to      provide a basis for cost-benefit/feasibility studies and future      development.\nAssure user approval with      requirements included for development project activity. Handle any      required PCR’s.\nSystem Design -      Work with solution delivery providers to ensure requirements are correctly      mapped through all stages of the SDLC. Reviews and advises on system      application and technical design.\nTesting - Establish      strategy for critical function and User Acceptance Testing (UAT). Performs      critical function testing and facilitates the UAT planning and testing process      with business users and IT service providers.\nEnsures test conditions for new      requirements are created, tested, and incorporated into regression testing      plans for future work.\nEnsures a      coordinated testing defect capture, tracking, and resolution process with IT      service providers and business users.\nPiloting/Implementation      Planning – Coordinate UAT sign-off, pilot planning and implementation with      IT service providers and business partners. Provides support for initial      pilot installation.\nProject      Management Input – Provide updates and feedback to IT Manager on progress      on Belk tasks for inclusion in status reporting and project management      efforts.\nCost /      Benefit/Feasibility Studies – Carry out detailed analysis and research and      produce formal reports for management.\nConsultant - Provide      consulting on assigned areas and systems to business and IT. On a      management exception basis provides third level production support for assigned      systems.\nRequirements/Qualifications:\n·\nCollege or university degree in Information Systems, Business Management, Computer Science or related field strongly preferred.\n·\n3-5 years experience with systems development methodologies, definition, systems design and systems testing\n·\nExperience with Retail Store IT projects serving as a business analyst or related role.\n·\n2 years experience in a structured project management environment with a demonstrated appreciation for disciplined project management\n·\nKnowledge of design tools including Visio\n·\nExceptional verbal, written and communication skills.\n·\nExperience with relational databases and knowledge of SQL\n·\nAbility to think on both broad and detailed levels\n·\nAbility to work in a highly collaborative environment\n·\nExperience with user-centered design methodologies\n·\nStrong presentation skills\n·\nHigh tolerance for ambiguity matched with desire to organize it\n·\nExperience in Retail Store Systems, specifically Point of Sale and Payment solutions\n·\nExperience in Associate Mobility, Web and Kiosk Retail Applications, and Digital Media solutions is highly desirable.\n·\nComputer skills:\nØ\nExperience with Microsoft Project, automated portfolio and project tracking tools, and automated testing tools.\nØ\nExperience with Microsoft Office Suite (Word, Excel, Access, and PowerPoint) and system documentation tools required.\nØ\nExperience as a developer preferred.\nFor reasonable accommodation information for an ADAAA qualified disability please see Belk Associate Handbook for policy and procedures.\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=4890",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-IT-Business-Systems-Analyst-Store-Systems/4890"
    },
    {
        "title": "Manager of Store Facilities",
        "description_html": null,
        "description_text": "Manager of Store Facilities\nCharlotte, NC, United States\nRef#:\n1084491\nDate published:\n20-Mar-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nProvide oversight and management of all store facility related support services, for 28 million square feet, in a manner which provides an effective, efficient and safe environment for all associates and customers. This includes but is not limited to repair and maintenance on: HVAC, Electrical, Plumbing, Roofing, Exterior Services, Vertical Transportation and Housekeeping.\nEssential Functions/Responsibilities:\nWorks directly with in-house teams and Facility Partner to ensure the delivery and completion of requested/scheduled services, in a timely and cost effective manner.\nMonitors, tracks, & reports on expense and usage trends for all areas managed by the Operations Facilities Department and assists the Director of Facilities in budgeting, forecasting, and variance analysis.\nEnsures that expenses for areas of responsibility are recorded accurately and on time according to financial deadlines.\nAssists directly in maintaining and improving the internal and external databases utilized to manage the related aspects of facilities management.\nAssists in the selection, oversight, approval of purchase/work orders and removal of vendors utilized to maintain and repair the company’s facilities.\nConducts periodic site visits required to validate performance standards are being met and to facilitate review of additional cost savings or performance enhancing opportunities.\nWorks with other areas of the business such as Finance, Store Planning, Divisions, Stores and related Facility vendors to ensure & maintain the ongoing operational efficiencies of the company’s locations.\nDevelop and review savings opportunities; perform statistical and ROI analyses for new intelligent investments and identify/implement savings through process improvement strategies.\nAnalyze and improve vendor performance; negotiate contracts and administrate billing automation protocol.\nInterface with various Facility related service companies and energy management contractors to ensure programs are functioning to capacity.\nWork with store construction and design teams to identify facility related equipment needs, along with the related budgets to improve efficiencies for related equipment/systems at new/remodeling locations.\nWork with Facility Partners to further develop the Facilities Asset and Maintenance Management Database(s); ensure proper operation and accuracy of facility related data.\nAssists in developing and publishing various monthly &/or quarterly (company-wide) utility awareness newsletters, alerts, etc.\nAssists in the management of company’s recycling efforts and related regulatory compliance, including increasing the level of recycling, and providing the necessary reporting & monitoring information.\nDevelop and publish various monthly budget variance reports and assists in providing communications to various stakeholders (i.e., Finance, Divisions, etc.).\nSet-up and close all utility and maintenance contracts for new and closing locations.\nWork with utility reps to be sure Belk is receiving the lowest possible service rate.\nDevelop and maintain working relationship with division representatives to insure support services are being provided in a manner which meets or exceeds required support levels.\nWork with Facility Partner to ensure submitted invoices are complete, accurate and timely.\nWork with Facility Partner to ensure specific strategic programs, associated directly with agreed KPI measurements, are successfully implemented and managed.\nEvening and weekend (on call) responsibilities for issues after hours.\nRequirements/Qualifications:\nBachelors degree and/or equivent years of experience\n6-8 yrs of experience\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=4858",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-Manager-of-Store-Facilities/4858"
    },
    {
        "title": "Store Fulfillment Analyst",
        "description_html": null,
        "description_text": "Store Fulfillment Analyst\nCharlotte, NC, United States\nRef#:\n1084493\nDate published:\n20-Mar-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nThe Store Fulfillment Analyst (SFA) will be responsible for analyzing store fulfillment performance and key metrics, identifying and resolving issues, and developing recommendations for courses of action to Supply Chain management.  In this role the SFA will work with cross functional teams throughout the company to gather data through various resources and then reproduce the data into presentable formats. The SFA will also communicate findings to multiple levels of management and use data to create strategies to improve various facets of the store fulfillment network. The successful candidate will need to be a self-starter, detailed oriented, support numerous projects, and the ability to communicate to all levels and areas of the business.\nStore Fulfillment, Store operations, or eCommerce fulfillment experience\nHeavy order management (configuration/set-up) experience would also be a plus\nEssential Functions/Responsibilities:\nMonitor and support the execution of store fulfillment orders across the network.\nDevelop and create data tables to support day to day store fulfillment operations\nCreate forecasting for fulfillment stores based on current plans and metrics in conjunction with Finance\nEngage and collaborate with IT to align programs/projects in support of supply chain business objectives and strategies\nIdentify, recommend and implement improvement opportunities in work methods, procedures, or equipment to increase throughput and/or quality.\nMonitor and analyze identified and established key operating metrics and assists in development and maintenance of an accurate measurement system.\nLeverage reporting and dashboards to drive process improvements resulting in reduced costs and improved service.\nUpdate existing documentation to reflect changes in procedures, equipment, or standards.\nLead or participate on process improvement teams and prepares project reports for management.\nPrepare documentation, including SOP development / modification for assigned process improvement projects\nMonitor and maintain information related to inventory visibility\nRequirements/Qualifications:\nBA/BS in Computer Science, Industrial Engineering, MIS, Supply Chain, Logistics Management and/or equivalent work experience.\nBusiness analysis and business process management skills\nProject management skills\nStore Fulfillment, Store operations, or E-commerce fulfillment experience\nHeavy order management (configuration/set-up) experience also a plus\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=4860",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-Store-Fulfillment-Analyst/4860"
    },
    {
        "title": "Manager of Payroll Systems/Projects",
        "description_html": null,
        "description_text": "Manager of Payroll Systems/Projects\nCharlotte, NC, United States\nRef#:\n1084486\nDate published:\n19-Mar-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nThe Manager of Payroll Systems/Projects will be responsible for the overall quality of payroll systems and payroll related project work to support the payroll and human resources function within the Belk organization.\nEssential Functions/Responsibilities:\nProvides leadership and active participation in project identification, project planning/requests, status reporting, requirements definition, testing and implementation planning and execution.\nProvides leadership and active participation in maintaining payroll and other related systems (i.e. Time & Attendance, etc.) to ensure data accuracy, effectiveness of processing controls, defect prevention/mitigation, testing and application of system updates (i.e. routine tax updates, releases, patches/fixes, enhancements, etc.).\nManage cross-functional teams to identify and prioritize system and process improvement opportunities.\nProvide change management to payroll business partners, users and customers.\nPreparation and delivery of reports/data files to both internal and external business partners.\nMaintains close collaboration with the entire payroll team and provides knowledge transfer/training, support and guidance as required.\nMaintains a detailed working knowledge of payroll concepts, regulatory changes and employment tax laws.\nDrives continuous improvement and integration of payroll functions and processes.\nBuild and maintain positive relationships with the payroll team, total rewards team, corporate/division/store/DC HR, and corporate/field associates.\nServes as back-up to the Manager of Payroll Operations as needed.\nRequirements/Qualifications:\nBachelors degree and/or equivalent years of experience\n6 or more years of applicable experience\nExperience with payroll systems and related projects. Proficient in Microsoft Office applications.\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=4853",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-Manager-of-Payroll-Systems-Projects/4853"
    },
    {
        "title": "HRIS Analyst",
        "description_html": null,
        "description_text": "HRIS Analyst\nCharlotte, NC, United States\nRef#:\n1084488\nDate published:\n19-Mar-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nThe HR Analyst position supports the HRIS Director and HR leadership by providing reliable data, metrics and analytics to support Executive decision-making.  This position maintains intricate and detailed databases and is responsible for ensuring that the data is accurate and presented in a clear, concise manner.\nEssential Functions/Responsibilities:\nDevelop and provide timely delivery of accurate reports using PeopleSoft Query tool and other reporting tools.\nProvide analytics using Oracle’s Business Intelligence Applications, Tableau, Domo or a similar tool.\nConsult with HR managers and other business areas regarding information needs and provide ad hoc queries and reports upon request.\nCollaborate with users to develop, maintain and distribute custom queries.\nPerform a broad range of data analysis and present the results in an accurate, professional, and informative manner\nMake recommendations for action based on trends identified.\nCompile detailed reports into summaries for executive leadership review.\nRespond to periodic Department of Labor requests for employment and wage data\nCompile annual/quarterly EEOC and SOX data requirements\nPartner closely with HRIS Analysts to ensure data integrity and identify potential gaps.\nIdentify new opportunities for reporting by working closely with each HR team to understand needs.\nRequirements/Qualifications:\nAssociates degree and/or equivalent years of experience\n2 or more years of applicable experience\nPeopleSoft and PeopleSoft Query tools experience is required.  Strong analytical skills, proficient in statistical analysis with a high level of proficiency in Microsoft excel 2010.\nAt least 1 year of experience using OBIA, Tableau, Domo or similar tools\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=4855",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-HRIS-Analyst/4855"
    },
    {
        "title": "IT Business Systems Analyst - eCommerce",
        "description_html": null,
        "description_text": "IT Business Systems Analyst - eCommerce\nCharlotte, NC, United States\nRef#:\n1084358\nDate published:\n6-Mar-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nCharlotte, N.C.-based Belk, Inc. (\nwww.belk.com\n) is the nation’s largest family owned and operated department store with more than $4 billion in sales and 300 Belk stores located in 16 Southern states and a growing digital presence on\nbelk.com\n. Founded on May 29, 1888 by William Henry Belk in Monroe, N.C., the company is in the third generation of Belk family leadership. Our mission is to satisfy the modern Southern lifestyle like no one else, so that customers get the fashion they desire and the value they deserve. Our vision is for the modern Southern woman to count on Belk first – for her, for her family, for life.\nBelk has been committed to community involvement since its inception and today gives 2.5 percent of its pretax income back to the communities it serves. During the past fiscal year the company and its associates, customers and vendors donated more than $20.9 million to those communities.\nBusiness Systems Analyst eCommerce\nPosition Summary:\nThe eCommerce Business Systems Analyst is responsible for supporting the implementation of various development projects and support/enhancements activities related to belk.com website and related applications.\nPrimary responsibilities include requirements elicitation, documentation and analysis, solution design, testing definition and execution and business change management.  This position works with stakeholders, technical staff, and others to translate business needs into systems solutions. Additional responsibilities include system modifications and enhancements, product development, conversions, and provide on-going production support to the end users.\nEssential Functions/Responsibilities:\n·\nEvaluate site design and functionality and document enhancement recommendations from business stakeholders and product managers.\n·\nMaintain up-to-date knowledge of current user experience/website industry standards and best practices.\n·\nMonitor and analyze products and services, market trends, and customer requirements.\n·\nAssist in performing usability testing of proposed designs. Conduct competitive audits and other research.\n·\nAnalyze related web metrics once implementation is complete (traffic, visibility, outreach, effectiveness) and coordinate updates with the various members of the key business units to ensure ongoing maintenance.\n·\nDefine business and functional requirements on behalf of the business to provide to systems analysts for implementation.\n·\nWork closely with business users to understand their business needs and opportunities for the use of technology to improve their processes and help them meet their business objectives. Understand the applications supporting the users, their capabilities and limitations. Assist the business users in developing business cases, including costs, benefits, and risks analysis.\n·\nDevelop an excellent working relationship with business users and IT, providing very customer focused and responsive support to their business needs.  Acts as liaison between systems software development staff, management, and system end-users to determine requirements.\n·\nTranslate business requirements into functional specifications for necessary systems modifications to satisfy business needs.  Work with IT to determine best technical solution to achieve objectives.\n·\nWork with QA and technical teams to develop test scripts based on functional specifications and participate in testing of systems enhancements and modifications.\n·\nServes as subject matter expert with content, processes, and procedures associated with the design of efficient, cost effective solutions.\n·\nPerform quality reviews of data results throughout the project lifecycle.\n·\nCoordinate implementation of the system software, including conversion of data to the new system, and work with application support personnel to resolve system problems.\n·\nWork proactively with end users to identify technical solutions to business problems or inefficiencies.\n·\nWork with the teams to ensure training materials and curriculums are developed to support systems enhancements and modifications.  Document system specifications, note and communicate any changes in procedure.\nRequirements/Qualifications:\nBachelor’s Degree in Information Systems, Business Administration, Computer Science or other related degree\nEXPERIENCE:\n·\n5 or more years in a business analyst or technical lead role.\n·\n5 or more years experience defining requirements for enterprise documentation.\n·\n3 or more years experience with Java related technologies.\n·\n2 or more years in retail eCommerce or a related domain.\n·\nExperience in design, development, implementation and deployment of web enabled eCommerce/Internet/Intranet applications (web-site design, development).\n·\nExperience with software testing tools.\n·\nExperience working on large, complex projects in the online retailing arena.\n·\nExperience demonstrating a detail orientation, solid time management skills and the ability to work in a fast-paced, cross-functional environment.\n·\nExperience writing technical documents, business requirements documents and user manuals.\n·\nProven ability to communicate complex data issues to a wide variety of decision-makers and interface with executive management, vendors and staff at all levels\nSKILLS:\n·\nExcellent verbal and written communication and presentation skills\n·\nProficient in the use of Microsoft Office: Word, PowerPoint, Excel, Visio and Project\nCOMPETENCIES:\n·\nKnowledge of usability testing constructs.\n·\nMust demonstrate excellent business analysis skills, inspire teamwork and responsibility among project team, and use current technology and tools to enhance deliverable and service effectiveness\n·\nAble to identify, challenge, and consider opportunities outside of conventional thinking and traditional ways of operating to resolve problems or inefficiencies.\n·\nDemonstrate a solid understanding of the capabilities of all platforms, including but not limited to web, mobile, widget and others and the constraints involved in designing for online and multimedia.\n·\nEffective at reporting and communication of project status in a cross-functional environment.\n·\nMust have strong problem-solving and analytical skills, an investigative mentality, organizational and logic skills.\n·\nExceptional communication skills. Good leadership and interpersonal skills.\n·\nMaintains knowledge of latest technology trends, new functionality and market demands.\n·\nMaintains up-to-date knowledge of current user experience/website industry standards and best practices\nPREFERRED SKILLS\nEXPERIENCE:\n·\nExperience working with third party vendors.\n·\nExperience working in an onsite-offsite team model.\nFor reasonable accommodation information for an ADAAA qualified disability please see Belk Associate Handbook for policy and procedures.\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=4725",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-IT-Business-Systems-Analyst-eCommerce/4725"
    },
    {
        "title": "Private Brands - Technical Designer",
        "description_html": null,
        "description_text": "Private Brands - Technical Designer\nCharlotte, NC, United States\nRef#:\n1084317\nDate published:\n3-Mar-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nThe primary purpose of the technical designer is to support the product development process by creating technical spec packages including technical sketch, measurement spec, construction details, trim details and quality standards. The technical designer owns and manages the technical spec and fit details throughout the different stages of sampling for specific product category.\nEssential Functions/Responsibilities:\nEssential Functions\nCollaborate with product manager and design team to translate the product design and style vision into a consistent fit and quality level by the development of technical specification.\nKey communicator of technical information. Responsible for communicating with vendor partners, agents, and internal team members to achieve the desired fit/quality for individual styles and product category.\nBuild technical specifications including technical illustration, construction details/seam specification, measurement spec, trim requirements and block patterns where necessary.\nEvaluate garment to determine compliance with measurement, construction, style and fit intent.\nEnsure size and fit consistency within individual brands. Adhere to established blocks.\nLead fit sessions with product managers, design team, and buying partners. Serve as technical expert, and offer innovative solutions to achieve the desired fit expression based on brand profile.\nOther Duties and Responsibilities\nResponsible for maintaining all target calendar dates and partnering with cross functional team and vendor partners to achieve an on-time delivery.\nGenerating and analyzing sample status and sales reports to determine any development issues. Collaborate with vendor to resolve issues as necessary.\nMonitor the follow up and tracking of samples to maintain delivery dates.\nPerforming store audits to ensure consistent quality and fit within brands. In special cases, finding production issues and reporting back to team.\nPattern adjustment and patternmaking, grading skills. Block pattern development.\nPartner with product and design teams on approvals and style creation in PLM.\nPossess accountability for the accuracy of all data in PLM.\nEnsure the product meets all quality and safety standards.\nRequirements/Qualifications:\nPosition Requirements\nEducation & Experience:\nBS, BA Pattern making, Textiles, Fashion Design or related program.\n5+ years technical design or patternmaking\nFlat pattern knowledge, pattern manipulation, draping and grading skills.\nStrong computer skills, knowledge of web based product development program, Adobe Illustrator, Windows applications\nOther Skills:\nStrong communication and collaboration skills, interpersonal skills\nEngaging personality\nSelf-motivated\nExcellent written and verbal skills\nKnowledge and ability to measure garments and follow product through the life-cycle.\nDetail-oriented personality with strong time management and organizational skills.\nPeople Management:\nManage and develop Assistant technical designer as specific to business.  Accountable for supporting a learning culture that will empower and leverage a collaborative team environment\n.\nResponsible for linking team’s work to support company mission, vision, values, goals, and strategies.\nReports Directly to:\nSr. Technical Designer\nSupervises:\nAssistant Technical Designer\nFor reasonable accommodation information for an ADAAA qualified disability please see Belk Associate Handbook for policy and procedures.\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=4684",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-Private-Brands-Technical-Designer/4684"
    },
    {
        "title": "IT Compliance Sr. Analyst (SOX)",
        "description_html": null,
        "description_text": "IT Compliance Sr. Analyst (SOX)\nCharlotte, NC, United States\nRef#:\n1084285\nDate published:\n26-Feb-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nCharlotte, N.C.-based Belk, Inc. (www.belk.com) is the nation’s largest family owned and operated department store with more than $4 billion in sales and 300 Belk stores located in 16 Southern states and a growing digital presence on belk.com. Founded on May 29, 1888 by William Henry Belk in Monroe, N.C., the company is in the third generation of Belk family leadership. Our mission is to satisfy the modern Southern lifestyle like no one else, so that customers get the fashion they desire and the value they deserve. Our vision is for the modern Southern woman to count on Belk first – for her, for her family, for life.\nBelk has been committed to community involvement since its inception and today gives 2.5 percent of its pretax income back to the communities it serves. During the past fiscal year the company and its associates, customers and vendors donated more than $20.9 million to those communities.\nEssential Functions/Responsibilities:\nThe IT Compliance  Sr. Analyst (SOX) will be responsible for assisting the Manager of Compliance  in both daily and long-term administration of the IT Compliance Program. They  will also assist and lead various compliance related initiatives, including  developing conceptual ideas into actionable implementation plans, monitoring,  analyzing and execution of compliance projects based on requirements including  but not limited to PCI, HIPAA, SOX, SANS, COBIT, ITIL, etc. This position  helps facilitate the creation of many of these initiatives as well as the  regular operation of the activities defined.\nThis role is also one that requires an ability to  work independently and build and maintain strong working relationships with  Belk IT service providers and business users.\nThe Compliance Analyst must be sensitive to the business and  contractual relationships that Belk IT has with these organizations. The  Compliance Analyst’s role requires tact, diplomacy, and strong written and  verbal communication skills to address audiences from entry level to executive  employees.\nThe Compliance Analyst must  demonstrate critical thinking skills, sound judgment, and an ability to  influence others over whom there is no direct authority.\nProject management experience  managing multiple tasks and projects simultaneously will be critical to the  professional’s success. A background in the retail industry is strongly  encouraged.\nResponsibilities & Essential Functions\n·\nActs as a subject matter expert for IT Compliance items. Assists with the administration and maintenance of policies and procedures for effective compliance management for all applicable IT related rules and regulations.\n·\nCreates and monitors systems and management processes for effective compliance reporting and remediation.\n·\nManages audits and remediation activities to ensure ongoing regulatory processes are followed.\n·\nCollaborates with internal customers including HR, Finance, Internal Audit, users, staff members, and IT colleagues to assist in the definition, development, and documentation of compliance related business requirements; objectives; deliverables; and specifications for projects and activities.\n·\nManages scheduled and non-scheduled audits and reviews IT processes to ensure compliance with mandated service levels (all high/critical patches within 30 days of patch release). Must lead resolution teams to address any non-compliance items.\n·\nWork closely with the Change Management process and applicable parties to ensure SOX, PCI and Internal Controls compliance and minimize change risks of IT production environment and report situations of non-compliance.\n·\nEnforce policies, standards and processes for information security and business continuity.\n·\nSupport the use of software and other tools, to manage security and business continuity objectives.\n·\nMaintain contact with and represent Belk in professional organizations, industry groups, and local/regional emergency response groups as appropriate.\n·\nImplement and support Identity and Access Management processes and tools for Belk.\n·\nDevelop roadmaps, strategies and project lists to achieve IT Compliance objectives.\nManage these projects to achieve these objectives on time and on budget.\n·\nEnsure systems, databases, applications, and IT processes comply with all SOX IT General Computing Controls (GCC)\n·\nImplement new SOX requirements, working closely with IT management and Internal Audit staff\n·\nManage segregation of duties (SOD) monitoring processes and controls, identify mitigating controls, and ensure compliance with company policies\n·\nSupport new system implementation and ensure compliance with existing policies\n·\nProvide guidance and facilitate understanding of SOX and compliance controls throughout the IT organization\n·\nPerforms other duties as assigned.\n·\nSpecial projects and other duties as assigned.\n·\nAll employees are expected to be in compliance with government and corporate laws, rules, regulations, policies, and procedures\nRequirements/Qualifications:\nEducation, Training, and/or Certifications:\nMinimum Required:\n·\nBachelors degree and/or equivalent years of experience\n·\nSpecific Degree:\nin Accounting, Information Systems, Business Administration, Computer Science or other relative Technical Degree\n·\nSpecific Certifications:\nCPA, CISSP, CISM, CIA\nExperience:\nMinimum Required:\n·\n2 or more years of applicable experience\n·\n3+ Years specific work or project experience:\nIT SOX Control Auditing\n·\nIndustry experience:\nRetail\n·\nPreferred:\n·\n2 or more years of applicable experience\n·\n5+ years specific work or project experience:\nExternal Audit, Internal Audit, Consulting\nKnowledge, Skills, and Abilities:\nMinimum Required:\n·\nBachelor’s Degree in Accounting, Information Systems, Business Administration, Computer Science or other relative Technical Degree\n·\nAt least 3 years’ experience in Information Technology\n·\nExperience performing enterprise risk management, risk identification, risk assessment, and risk mitigation.\n·\nFamiliarity with the following:\n·\nStrategies and techniques for network security and intrusion detection.\n·\nStrategies and techniques for enterprise identity and access management.\n·\nStrategies and techniques for meeting compliance objectives.\n·\nStrategies and techniques for end user awareness.\n·\nProficient in the use of Microsoft Office Products: Word, PowerPoint, Excel and Project\n·\nProficient in the use of Auditing Software: IDEA, ACL, etc…\n·\nExcellent verbal and written communication and presentation skills\n·\nAbility to interface with executives as necessary\n·\nStrong interpersonal and communication skills.\n·\nAbility to manage activities performed by multiple 3rd parties.\n·\nAbility to properly tailor communication to and work effectively with both business and technical teams.\n·\nStrong troubleshooting and problem solving skills.\n·\nAbility to think and act both strategically and tactically.\n·\nAbility to effectively multi-task.\nFor reasonable accommodation information for an ADAAA qualified disability please see Belk Associate Handbook for policy and procedures.\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=4652",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-IT-Compliance-Sr-Analyst-SOX/4652"
    },
    {
        "title": "eCommerce - Conversion and Onsite Search Specialist",
        "description_html": null,
        "description_text": "eCommerce - Conversion and Onsite Search Specialist\nCharlotte, NC, United States\nRef#:\n1084201\nDate published:\n16-Feb-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nThe Conversion Specialist is responsible for management of revenue driving activities outside of normal day to day category promotional spots utilizing rule-based merchandising, dynamic product assortments, dynamic personalized content insertion and A/B testing on Belk.com.  This position will report to the Sr Conversion Specialist, and may partner extensively with the Content Strategist to ensure coverage at all times on all functions.\nEssential Functions/Responsibilities:\nEssential Functions\nA Conversion Specialist will be expected to perform in the following areas:\nØ\nMonetate Tool\n·\nHelp develop and implement best practices for business rules and related processes across all Belk.com content for Monetate personalized offer engine.\nØ\nSOLR Search & Browse\n·\nReview weekly onsite search reports to identify keywords returning zero results for products carried on Belk.com, keywords not bringing back the entire product assortment, and keywords needing thesaurus entries for similar terms. Highlight keywords needing attention and deliver to Sr. Conversion Specialist with comments made in Comment Field for fine-tuning to be performed in search tool and platform.\n·\nReview weekly sales ad books, promotional flyers, and magazine ads to identify onsite search related problems for terms used in ad titles and product names that are different from those used on belk.com. Circle ad titles and products needing attention and deliver to Sr. Conversion Specialist with comments made next to ads for fine-tuning to be performed in search tool and platform.\n·\nMaster SOLR search tool, providing key leadership on direction and request help from IT as needed to improve the tool, ultimately improving search results & conversion rate.\nØ\nA/B Testing\n·\nAssist with A/B Testing by partnering with Web Merchants, User Experience, Content Strategy, Creative, Web Analytics, and Front End Developer teams to identify, implement, test, and analyze A/B Testing.\nØ\nReporting & Analysis\n·\nPartner with Conversion Specialists, Web Analysts, Web Merchants, Planners and Digital Marketing teams to compile, analyze and present reporting information to internal stakeholders.\n·\nProvide weekly actionable reports and analysis detailing insights and opportunities\nØ\nExposure to Monetate and Product Recommendations\n·\nAssist in project management of Monetate content development.\n·\nPartner with Conversion Specialists, Content Strategists, Interactive Marketing, UX and Web Merchants to gain solid understanding of merchandising and promotional strategy.  At times, assist with creating dynamic personalized offers and optimize rule-based merchandising opportunities throughout the year.\nBehavioral Traits\nPosition requires individual to take an analytical approach to decision making, work well with cross functional teams and perform project management duties. The candidate is also expected to have excellent written and oral communication skills, creativity in merchandising and marketing, organization and people savvy skills, leadership skills and strong problem-solving skills.  The individual should be detail orientated, customer focused, have strong time management skills, a professional demeanor and positive attitude. Additionally, this role requires the ability to work in a fast-paced, high-volume, multidiscipline environment with the ability to manage multiple time sensitive priorities, accelerated timeframes and quickly adapt to changes in priorities.\nRequirements/Qualifications:\nPosition Requirements\n·\nBS in business, marketing or computer-related field or equivalent experience\n·\nSTRONG understanding of SOLR search tool preferred\n·\nMinimum 1 years eCommerce experience\n·\nMinimum 1 years of project management experience\n·\nMinimum 1 years Internet merchandising and Internet marketing experience\n·\nMinimum 1 year of web analytics experience\n·\nExperience in A/B or Multivariate test planning, execution and analysis\n·\nStrong understanding of Microsoft Excel a must\n·\nSolid understanding of direct response marketing theories\n·\nExperience in product recommendation business tools\n·\nAbility to make connections between data and business goals\n·\nSolid understanding of Online user behaviors, Web Analytics, and Internet technology\nPhysical\n·\nAvailable and able to travel as needed.\n·\nAble to see and distinguish colors.\n·\nAble to sit for a long period of hours\nReports Directly To\nSr Conversion Specialist\nFor reasonable accommodation information for an ADAAA qualified disability please see Belk Associate Handbook for policy and procedures.\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=4568",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-eCommerce-Conversion-and-Onsite-Search-Specialist/4568"
    },
    {
        "title": "IT Sr. eCommerce Systems Architect",
        "description_html": null,
        "description_text": "IT Sr. eCommerce Systems Architect\nCharlotte, NC, United States\nRef#:\n1084133\nDate published:\n6-Feb-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nCharlotte, N.C.-based Belk, Inc. (\nwww.belk.com\n) is the nation’s largest family owned and operated department store with more than $4 billion in sales and 300 Belk stores located in 16 Southern states and a growing digital presence on belk.com. Founded on May 29, 1888 by William Henry Belk in Monroe, N.C., the company is in the third generation of Belk family leadership. Our mission is to satisfy the modern Southern lifestyle like no one else, so that customers get the fashion they desire and the value they deserve. Our vision is for the modern Southern woman to count on Belk first –for her, for her family, for life. Belk has been committed to community involvement since its inception and today gives 2.5 percent of its pretax income back to the communities it serves. During the past fiscal year the company and its associates, customers and vendors donated more than $20.9 million to those communities.\nSystems Architect - eCommerce\nPosition Summary:\nBelk is excited to give you a unique opportunity to define and build next generation digital platforms and applications that enable robust, consistent, and globally-scalable web capabilities. Are you excited to work in a highly collaborative environment, as part of a fast-paced, high-performing retail based technology team where your opinion matters?  Come join a stable national Retailer where you can make an impact on the business and be a part of our Hybris journey from inception.  You will be responsible for enabling key features and capabilities as prioritized by the business, and leverage them to define and implement complete B2C e-commerce solutions.\nT\nhe role of the\nSystems\nArchitect provides strategic uses of infrastructure, integrations, business application configuration, and other technology resources. The architect will work closely with the Belk architecture team, eCommerce development teams, operational support technical teams, and business analysts to\nprovide the overall guidance and structure for optimal use\nof technology resources.\nThe Systems Architect works regularly with solution architects to ensure the overall health of the organization’s technology resources and provides a bridge between enterprise infrastructure and solutions / business architecture. The Systems Architect has mastered the design, delivery, and maintenance of technology resources and contributes to selection and configuration of build tools, deployment environment configurations, capacity planning, and software architecture.\nThe role requires proven experience with designing, implementing, and maintaining eCommerce applications preferably using a large-scale eCommerce application framework. The architect brings experience in business technology strategy, design skills, balancing and optimizing quality attributes, and broad technical skills.\nT\nhe position requires knowledge of and hands-on experience with eCommerce application tiers, concepts, processes, technology, and tools. The technical skills include the following:\nApplication Server software administration like WebLogic, WebSphere, Tomcat\nWeb server software administration like Apache, nginx\nExperience with Service Oriented Architecture\nExperience with Web services\nExperience with application integration using Enterprise Service Bus\nExperience with messaging systems like IBM Websphere Message Queue\nSkilled with UML design and corresponding tools\nDatabase Software like Oracle, DB2, UDB\nDatabase utilities like TOAD, SQLPlus and Oracle tools\nOperating Systems like Linux, Solaris, Windows\nOperating System level scripting tools like Shell scripts, PERL scripts, Batch programming\nWeb Analytics tools like Coremetrics, Omniture\nApplication Performance Monitoring Tools like CA-Wily, Tealeaf\nPerformance/availability monitoring services like Compuware Gomez, Keynote\nLoad testing tools/services like Mercury LoadRunner/WinRunner, Gomez\nArchitectural and object oriented design patterns\nJava/J2EE programming\nFront-end interface protocols like JSON\nDistributed source control management tools like Git\nConfiguration of Build and Release management tools like Jenkins, Apache Ant, Maven\nEssential Functions/Responsibilities:\nEssential Functions/Responsibilities:\n·\nGuiding eCommerce development and support teams for all design and architecture decisions\n·\nReviewing all development and support activities for consistency with architecture and standards\n·\nEvaluating and collaborating changes in eCommerce application architecture with outsource providers, development teams, and outside consultants as required.\n·\nDeveloping, publishing and maintaining architectural standards in the eCommerce application area\n·\nProviding direction to all teams on standards and best practices in eCommerce\n·\nHelping various teams in eCommerce application area with code deployment, source control and change management processes\n·\nMonitoring the patch management process for eCommerce infrastructure. Work with third party hosting provider team to manage and implement this process.\n·\nIdentifying various tools to address the evolving needs of the eCommerce application area. Additionally, provide oversight and lead the tool selection process.\n·\nWork closely with development manager, support manager and their teams and other vendor teams to effectively address business requirements in the eCommerce application area.\n·\nWork with eCommerce director to define and implement strategic technology direction in eCommerce application area.\n·\nApplying industry best practices.\nRequirements/Qualifications:\nBachelor’s Degree in Information Systems, Business Administration, Computer Science or other related degree\nEXPERIENCE:\n·\n2+ years experience in a Systems/Application Architect role for eCommerce applications.\n·\n7+ years experience as Technology Lead or a senior technology position in eCommerce application area in retail domain.\n·\nStrong SDLC experience and application architecture/design background.\n·\n3-5 years experience preferably in the retail and consumer products industry.\n·\nDetailed functional understanding of eCommerce application, interfaces and business processes.\nFor reasonable accommodation information for an ADAAA qualified disability please see Belk Associate Handbook for policy and procedures.\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=4499",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-IT-Sr-eCommerce-Systems-Architect/4499"
    },
    {
        "title": "Director of Credit Marketing",
        "description_html": null,
        "description_text": "Director of Credit Marketing\nCharlotte, NC, United States\nRef#:\n1083958\nDate published:\n13-Jan-2015\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nDrive credit sales and penetration, new account solicitation, Belk Rewards loyalty program and best customer metrics by directing strategic efforts of our 3rd party credit provider. Additionally responsible for driving in-store and B2B gift card sales and ancillary product sales (offered through the credit card statement).\nPlan and coordinate credit marketing activities which maximize Belk Credit Sales, Belk Credit penetration and the number of Belk credit accounts solicited. This includes direct mail, in-store events, activation programs, and maintaining in-store credit knowledge and disciplines. Responsible for Gift Card sales.\nEssential Functions/Responsibilities:\nIn conjunction with GE and Sales Promotion, develop an overall payments marketing strategy to optimize our sales and customer loyalty; resulting in sales growth and customer satisfaction.\nDevelop and implement strategies to improve Belk Rewards card penetration of total sales.\nGet Sales Promotion buy-in to the payments strategy- calendar, direct mail, special events.\nPresent 3 year payments plan to Belk Senior management.\nExecute programs supporting specific payments objectives through partnership with GE, Stores, and Sales Promotion\nPrepare financial budget for credit marketing.\nDevelop and implement strategies regarding our Belk Rewards Loyalty program to drive customer and associate benefit awareness and incremental sales. Monitor Belk Rewards Loyalty program and make recommendations as needed to adjust the program to meet strategic credit objectives.\nWork with Advertising to ensure proper credit signage is in place to support events.\nAccurately forecast results and explain variances\nDevelop and implement strategies to drive store engagement in soliciting new Belk Rewards cards applications in order to achieve our credit solicitation goal.\nDevelop and present information to divisions, store managers and associates on how Belk Rewards card customers drive incremental sales.\nWork directly with GE Field Sales leader and Field Sales Mgrs as they support the stores in credit training/education to support the company’s credit solicitation goal.\nWork directly with Division credit champs (RVPs) to ensure that credit strategies are implemented.\nAct as an operational interface for credit operations with other departments, including GE.\nDevelop and implement strategies to drive Belk Gift Card sales as a % of total sales (in-store, B2B, belk.com and third parties).\nManage third party gift card providers- Hallmark, Blackhawk, etc.\nSupport financial budget preparation for gift card and operational areas through accurate and timely analysis and forecasting, explanation of variances.\nDevelop and implement strategies to increase ancillary income derived thru mailer sales in credit card statement\nManage operational aspect of billing of ancillary products\nRequirements/Qualifications:\n4 year College Degree- preferably Marketing related\n5 years Credit Marketing experience.\nThoroughly familiar with Excel, Word and PowerPoint\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=4322",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-Director-of-Credit-Marketing/4322"
    },
    {
        "title": "Summer Internship: Retail Management",
        "description_html": null,
        "description_text": "Summer Internship: Retail Management\nMultiple Cities, NC, AL, TN, SC, GA, United States\nRef#:\n1083846\nDate published:\n31-Dec-2014\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nRetail Stores Management Internship Program\nPOSITION DESCRIPTION\nBelk, Inc. is the nation’s largest privately owned and operated department store company with approximately 300 Belk stores and 23,000 associates located in 16 states with revenues of\n$\n4 billion\nand growing. Recently named in Stores Magazine as one of the\nTop 50 online retailers\n,\nwe are also philanthropic and provided over\n$19.0 million\nin support to local communities, education initiatives, and breast cancer. In 2013, we proudly celebrated our\n125\nth\nanniversary\nwith a continued commitment to our mission, “To satisfy the modern Southern lifestyle like no one else, so that our customers get the fashion they desire and the value they deserve.” We are investing heavily in our business and are looking for talented people to join our\ndiverse and inclusive Belk team.\nBelk Internship Program Summary\nDo you want a career where you can use your skills to make a difference? Then Belk’s Retail Stores Management Internship program is a fit for you! This hands-on 10 week program is designed to sharpen your ability to drive results through strong business acumen and leadership skills. As a Retail Stores Management Intern you will gain experience and exposure to various functional areas of the store. You will focus on analyzing business trends while building relationships with executives, customers, and the sales team. You will gain experience through structured shadowing assignments, workshop modules, and formal mentorship during the 10 week program.\nWhy intern at Belk?\n·\nWork in a fast paced, competitive, dynamic and entrepreneurial environment\n·\nPlan and collaborate on events and merchandising decisions in assigned areas\n·\nAssist in executing the store’s side of our Omni channel strategy and other Belk initiatives\n·\nOne-on-one mentoring with a Store executive\n·\nShadowing assignments in all areas of the store\n·\nGet exposure to senior executives in the stores\n·\nInvest in an internship with a highly successful family owned company that has been in business for over 125 years and has a commitment to diversity, the development of our people and giving back to the communities in which it serves\nWhat to bring to the program\n·\nRising College Senior, all majors welcomed\n·\nLeadership skills that include professional business ethics, confidence and self-motivation\n·\nDemonstrated ability to solve problems and manage complex relationships\n·\nAbility to prioritize projects and execute multiple tasks to drive sales and customer service\n·\nStrong business background with ability to analyze data, draw conclusions and take action\n·\nStrong interest in retail\nWhat happens after the Belk Internship Program?\nOur goal is to show you a career path where you can become a Stores Management Executive Trainee upon college graduation. You will be provided with a real life snapshot of how run to a multimillion dollar business. From Stores Executive Management Trainee, you can be considered for Assistant Store Manager and then Store Manager. Through this program, continuing learning opportunities and on the job experience Belk will give you the exposure of how to be a successful Stores Executive in an environment where you can manage your career, influence change and drive the business.\nQualifications:\n·\nMinimum 3.0 GPA on a 4.0 scale\n·\nGraduation date between December 2015 and May 2016\n·\nDemonstrated leadership and communication skills\n·\nStrong communication and computer skills\n·\nRetail selling/management and customer service experience\nInternship Logistics\n·\n10 week, paid internship with locations across 16 states\n·\nStart date: June 2015\n·\nInterns are responsible for their own housing, transportation and meals\nEssential Functions/Responsibilities:\nRequirements/Qualifications:\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=4210",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Multiple-Cities-NC-AL-TN-SC-GA-United-States-Summer-Internship-Retail-Management/4210"
    },
    {
        "title": "Sr. Supply Chain Analyst",
        "description_html": null,
        "description_text": "Sr. Supply Chain Analyst\nCharlotte, NC, United States\nRef#:\n1083791\nDate published:\n17-Dec-2014\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nThe Sr. Analyst will be responsible for driving analysis, creation of operational and financial reporting, executive dashboards and providing recommendations with an innate focus on key performance metrics and cost drivers related to Supply Chain initiatives that would enable informed and effective business decisions. The Sr. Analyst will be responsible for improving the order fulfillment process, develop education material for the broader Belk organization and support key stakeholders in preparation for peak period.\nEssential Functions/Responsibilities:\nIdentify and analyze business rules related to order allocation, order fulfillment and inventory management to optimize or improve cycle time, reduce expenses, etc\nIdentify and analyze data/trends, building correlations between operational metrics that drive both strategic and tactical opportunities\nDevelop a roadmap related to business rules, track actuals and compare actual vs. intended KPIs\nProvide analytical support related to outbound parcel strategy and initiatives\nDevelop informational material to educate the broader Belk organization on Supply Chain expense, inventory management, fulfillment metrics, etc.\nWork closely with cross-functional teams to support relevant activities related to peak period planning and overall Supply Chain initiatives.\nUnder minimum supervision, this position designs, analyzes, and creates management scorecards, reports/presentations and dashboards that assist senior leadership within the\nSupply Chain organization to help understand trends, variances, and opportunities.\nPropose alternative strategic and operational tactics to further improve overall results and efficiency.\nProvide financial, statistical and operational analyses, in support of key productivity and cost savings opportunities, and deliver action-oriented recommendations, resulting in attainment of goals.\nProactively communicate and collaborate with multiple teams and directly with the department team members to gather required data needed to validate accuracy.\nDevelop presentations highlighting key assumptions, business drivers and recommendations to leadership.\nPerform analysis to reconcile data to source reports to resolve discrepancies.\nIdentify opportunities for innovation, productivity improvement and savings.\nAdditional duties as assigned.\nRequirements/Qualifications:\n3 to 5 years work experience in Supply Chain, Store/Network Fulfillment, Operations Engineering, Fulfillment Operations or Finance. Retail experience a plus.\nBachelors of Science degree from accredited university in Finance, Industrial Engineering, MIS, Supply Chain, Logistics Management and/or equivalent work experience.\n3 to 5 years of experience in a quantitative analytical field with in-depth analysis, advanced\nExcel and large volume data management skills required.\nRequires sufficient demonstrated experience to immediately understand and proceed with the responsibilities of the position with minimal assistance.\nStrong communication and presentation skills; able to communicate effectively in various levels of the organization, i.e. large meeting facilitation, written and electronic communications.\nAbility to manage tight deadlines.\nAbility to handle multiple tasks simultaneously and influences, motivates people with no direct authority.\nProven ability to understand degree of implemented changes and forecast upstream and downstream effects across the supply chain, organization, and end consumer.\nAdvanced computer skills. Experience with: Microsoft Office Suite (Excel, Access, Word, Project, Outlook, Visio, Visual Basic, and PowerPoint), Microstrategy, Hyperion/Essbase, Tableau, SQL, and Minitab (or other statistical software).\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=4155",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-Sr-Supply-Chain-Analyst/4155"
    },
    {
        "title": "Loss Prevention Associate",
        "description_html": null,
        "description_text": "Loss Prevention Associate\nJackson, MS, United States\nRef#:\n1083970\nDate published:\n17-Dec-2014\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nThe Loss Prevention Associate is responsible for\nexecuting physical security, shortage control, and safety programs for a distribution center with dynamic service specializations. The Loss Prevention Associate, under direction from the Loss Prevention manager, communicates with distribution center employees, stores, and supply chain partners regarding Loss Prevention, safety, and security matters within his/her area of responsibility.\nEssential Functions/Responsibilities:\nEnsures that policies and procedures are executed in order to secure merchandise, physical property, and virtual assets, as well as safety and disaster response.\no\nConducts associate check in/check out and random search procedures and documents findings.\no\nExecutes regular physical audit of facility physical security controls, including primary and remote properties; reports findings and compliance rates.\no\nEnsures that daily yard checks are conducted, trailers are properly logged in/out and secure while located on the premises and compiles all related reports. Assists in trailer seal audit processes as is necessary or directed.\no\nConducts CCTV surveillance of the distribution center facility to detect and document incidents of theft and unsafe activity; reviews video footage from non-peak times to ensure compliance with safety and security controls.\no\nEducates distribution center associates in the safe and effective use of specialized and unique equipment, including warehouse vehicles, repair machinery, etc. to minimize incidents and liability.\no\nMaintains inventory of surveillance equipment, trailer storage yard (inbound and outbound) activity, lock cores, keys, and other physical security assets.\n§\nParticipates in regular meetings designed to educate, engage and drive participation in effective safety and Loss Prevention efforts.\no\nAssists the Loss Prevention Manager in maintaining an open and positive work environment where enforcement of policy and procedure standards minimizes loss while maintaining high levels of productivity and Associate Engagement.\no\nEngages in positive relationships with temporary staffing partners, including contracted workers and transportation employees to ensure all associates uphold Loss Prevention and safety standards; reports incidents of inappropriate or unsafe behavior to the Loss Prevention Manager and distribution center management.\no\nMaintains strong partnerships with contracted security providers to ensure high standards of service and training.  Assists in training of new contracted security associates as needed.\n§\nAssists the LP Manager in conducting investigations, interviews, and case procedure in partnership with the Supply Chain and corporate Loss Prevention departments.\no\nEnsures that all Loss Prevention incidents and accidents are documented, communicated, and resolved appropriately.\no\nApprehends individuals involved in theft, signs warrants, and attends court, based on direction from the Loss Prevention Manager\no\nInvestigates claims related to merchandise fulfillment and/or delivery; uses exception-based reporting and/or other specialized tools to research and present findings to the Loss Prevention Manager and the Director of Distribution.\no\nAssists stores in resolving actual and/or perceived pre-delivery or in transit shortage-related issues\no\nAudits cartons, shipping records, and safety standards on a routine basis.\nRequirements/Qualifications:\nHigh School or equivalent years of experience\n2 or more years of applicable experience\nAbility to operate standard phones, computers, and other business machines\nAbility to  perform some lifting (up to 50 lbs.)\nAbility to  climb ladders, scaffolds, and work at heights\nGood       organizational, written, communication and presentation skills and       problem-solving abilities within time constraints.\nMust       be able to maintain a professional demeanor and response when faced with       potentially stressful situations\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=4334",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Jackson-MS-United-States-Loss-Prevention-Associate/4334"
    },
    {
        "title": "Internship: Information Technology",
        "description_html": null,
        "description_text": "Internship: Information Technology\nCharlotte, NC, United States\nRef#:\n1081566\nDate published:\n5-Sep-2014\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nInformation Technology Internship Program:\nPosition Description\nCharlotte, N.C.-based Belk, Inc.\n(\nwww.belk.com\n)\nis the nation’s largest privately owned and operated department store company with approximately 300 Belk stores and 23,000 associates located in 16 states with revenues of\n$\n4 billion\nand growing.  B\nelk.com was awarded the Fastest Growing E-Retailer recognition from Internet Retailer Magazine in 2011, 2012 and 2013.\nRecently named in Stores Magazine as one of the\nTop 50 online retailers\n,\nwe are also philanthropic and provided over\n$19.0 million\nin support to local communities, education initiatives, and breast cancer. In 2013, we proudly celebrated our\n125\nth\nanniversary\nwith a continued commitment to our mission, “To satisfy the modern Southern lifestyle like no one else, so that our customers get the fashion they desire and the value they deserve.” We are investing heavily in business areas like IT, Omni-Channel, Ecommerce, and Innovation and are looking for talented people to join our\ndiverse and inclusive Belk team.\nInternship Program Summary\nDo you want a career where you can use your technology and analytical skills to make a difference? Then the Information Technology Internship program at Belk is a fit for you! This intensive 10 week program is designed to sharpen your ability to drive results through strong business acumen and leadership skills.  As an Information Technology Intern, you will gain experience and exposure to various functional areas of Belk’s corporate IT departments including eCommerce, Data Warehouse, Information Delivery and Quality Assurance.  Belk is seeking IT Summer Interns to support the following roles:\n·\nBusiness Intelligence Application Support Intern\n·\neCommerce Business Analyst Intern\n·\neCommerce Mobile Engineering Intern\n·\neCommerce Data Analyst Intern (SQL/DB Skills required)\n·\nQuality Assurance Intern\nWhat’s in it for you?\n·\nWork in a fast paced, competitive, dynamic and entrepreneurial environment\n·\nResponsible for executing the IT strategy as well as other Belk initiatives\n·\nGet exposure to senior executives in the information technology departments\n·\nIntern with a highly successful family owned company that has been in business for over 125 years and has a commitment to diversity, the development of our people and giving back to the communities in which it serves\nWhat can you bring to the Internship Program?\n·\nCurrently pursuing a Bachelor’s Degree with a record of achievement, academic focus in Information Systems, Software Engineering or Computer Science highly preferred\n·\nStrong written and verbal communication\n·\nLeadership skills that include professional business ethics, confidence and self-motivation\n·\nDemonstrated ability to solve problems and manage complex relationships\n·\nAbility to prioritize projects and execute multiple tasks\n·\nStrong business background with ability to analyze data, draw conclusions and take action\nInternship Logistics\n·\n10 week, paid internship based in Charlotte, NC\n·\nStart date: June 2015\n·\nInterns are responsible for their own housing, transportation and meals\nEssential Functions/Responsibilities:\nRequirements/Qualifications:\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=2520",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Charlotte-NC-United-States-Internship-Information-Technology/2520"
    },
    {
        "title": "Experienced Mechanical Maintenance Technician",
        "description_html": null,
        "description_text": "Experienced Mechanical Maintenance Technician\nBlythewood, SC, United States\nRef#:\n1081566\nDate published:\n17-Jul-2014\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nThe Mechanical Maintenance Technician position is responsible for assisting the Maintenance Supervisor in the maintenance and upkeep of the DC’s conveyor systems (accumulation and flex) and other equipment and machinery (e.g., lift trucks and etc.). Experienced applicant must be able to work flexible shifts plus some weekends and holidays.\nAlso assists in maintaining the physical structure/building and its surrounding properties and grounds.\nIn addition, assists in the processing of mail and battery maintenance as needed\n.\nThe position is non-exempt.\nEssential Functions/Responsibilities:\nPerforms daily walk through maintenance inspections of the facility, document findings, and maintains logs of all worked performed, and materials/supplies used in the repairs.\nConducts periodic/routine preventive maintenance inspections to ensure that all conveyor equipment is working properly and is in good repair.\nPerforms repairs, installation, and other services on fabrication machinery and other equipment\nand/or property\nin the facility as needed\nand documents time and type of work performed\n.\nAssist in the maintenance of the facility and its equipment by promptly responding to maintenance service calls, work orders, directives from superiors with priority given to conveyor and other related issues that could cause “down time”.\nAssists in the established facility conveyor and equipment preventive maintenance program, performing preventive maintenance of conveyor components and other equipment as required by the manufacturer or as directed by the Maintenance Manager/Supervisor.\nMaintains accountability of all issued or general maintenance equipment, tools and supplies.\nAssist in maintaining maintenance logs and schedules on all equipment and systems.\nAssist in the timely and proper processing of mail and the maintenance of “lift trucks” by changing and charging batteries when necessary and documenting/reporting damages, mechanical concerns and other discrepancies observed relevant to operating guidelines.\nAssist in the parts replenishment process by ensuring that used parts are removed from the inventory and that supervisor is apprised of parts used as well as parts that need to be ordered or when the last part/item used or when “on hand quantity” is below the established minimum if applicable.\nObserves mechanical devices in operation and listens to their sounds to locate causes of trouble and takes the appropriate corrective action when warranted.\nDismantles devices to gain access to and remove/replace/repair defective parts.\nAdjusts functional parts of devices and control instruments.\nInstalls special functional and structural parts in devices\nLubricates and cleans parts.\nAssist in and/or performs other related duties as assigned by management.\nRequirements/Qualifications:\nHigh School diploma or equivalent\nRead, understand and adhere to all policy and procedure manuals\nAbility to read and understand English\nAbility to work unsupervised\nThree years Industrial maintenance experience preferred\nFamiliarity with PC Software and general business computing skills (Microsoft Office Preferred)\nPhysical:\nAbility to lift materials up to 50 lbs\nMust be able to move freely throughout the distribution facility\nAbility to bend, twist, stoop, reach, climb ladders\nGood motor coordination between eyes and hands/fingers to rapidly and accurately make precise\nmovements.\nWork 25 - 30 feet above the production  floor area\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=1625",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Blythewood-SC-United-States-Experienced-Mechanical-Maintenance-Technician/1625"
    },
    {
        "title": "Experienced Mechanical Maintenance Technician (Seasonal August to Nov)",
        "description_html": null,
        "description_text": "Experienced Mechanical Maintenance Technician (Seasonal August to Nov)\nJackson, MS, United States\nRef#:\n1081566\nDate published:\n17-Jul-2014\nShare with:\nFacebook\nTwitter\nViadeo\nSend to a friend\nApply Now\nConnect with Facebook\nSend to a friend\nPosition Summary:\nThe Mechanical Maintenance Technician position is responsible for assisting the Maintenance Supervisor in the maintenance and upkeep of the DC’s conveyor systems (accumulation and flex) and other equipment and machinery (e.g., lift trucks and etc.). Experienced applicant must be able to work flexible shifts plus some weekends and holidays.\nAlso assists in maintaining the physical structure/building and its surrounding properties and grounds.\nIn addition, assists in the processing of mail and battery maintenance as needed\n.\nThe position is non-exempt.\nEssential Functions/Responsibilities:\nPerforms daily walk through maintenance inspections of the facility, document findings, and maintains logs of all worked performed, and materials/supplies used in the repairs.\nConducts periodic/routine preventive maintenance inspections to ensure that all conveyor equipment is working properly and is in good repair.\nPerforms repairs, installation, and other services on fabrication machinery and other equipment\nand/or property\nin the facility as needed\nand documents time and type of work performed\n.\nAssist in the maintenance of the facility and its equipment by promptly responding to maintenance service calls, work orders, directives from superiors with priority given to conveyor and other related issues that could cause “down time”.\nAssists in the established facility conveyor and equipment preventive maintenance program, performing preventive maintenance of conveyor components and other equipment as required by the manufacturer or as directed by the Maintenance Manager/Supervisor.\nMaintains accountability of all issued or general maintenance equipment, tools and supplies.\nAssist in maintaining maintenance logs and schedules on all equipment and systems.\nAssist in the timely and proper processing of mail and the maintenance of “lift trucks” by changing and charging batteries when necessary and documenting/reporting damages, mechanical concerns and other discrepancies observed relevant to operating guidelines.\nAssist in the parts replenishment process by ensuring that used parts are removed from the inventory and that supervisor is apprised of parts used as well as parts that need to be ordered or when the last part/item used or when “on hand quantity” is below the established minimum if applicable.\nObserves mechanical devices in operation and listens to their sounds to locate causes of trouble and takes the appropriate corrective action when warranted.\nDismantles devices to gain access to and remove/replace/repair defective parts.\nAdjusts functional parts of devices and control instruments.\nInstalls special functional and structural parts in devices\nLubricates and cleans parts.\nAssist in and/or performs other related duties as assigned by management.\nRequirements/Qualifications:\nHigh School diploma or equivalent\nRead, understand and adhere to all policy and procedure manuals\nAbility to read and understand English\nAbility to work unsupervised\nThree years Industrial maintenance experience preferred\nFamiliarity with PC Software and general business computing skills (Microsoft Office Preferred)\nPhysical:\nAbility to lift materials up to 50 lbs\nMust be able to move freely throughout the distribution facility\nAbility to bend, twist, stoop, reach, climb ladders\nGood motor coordination between eyes and hands/fingers to rapidly and accurately make precise\nmovements.\nWork 25 - 30 feet above the production  floor area\nApply Now\nConnect with Facebook\nSend to a friend",
        "application_url": "https://sandboxbelk.avature.net/careers/Login?jobId=1634",
        "": {},
        "metadata": {},
        "link": "https://sandboxbelk.avature.net/careers/JobDetail/Jackson-MS-United-States-Experienced-Mechanical-Maintenance-Technician-Seasonal-August-to-Nov/1634"
    }
]